JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// =============================================================================
// URTC - Universal Robot Tool Controller - Firmware
// Copyright (C) 2026 JuanenRac (Electro Hobby 3D) <electrohobby3d@gmail.com>
//
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program. If not, see <https://www.gnu.org/licenses/>.
//
// NOTE: this license covers the firmware source only. The URTC hardware
// designs (Eagle schematic/board/gerbers, 3D-printable parts) are licensed
// separately under CERN-OHL-S v2, and the project documentation under
// CC BY-SA 4.0 - see the repository README for the full breakdown.
// =============================================================================

#include "stm32f3xx_hal.h"
#include <string.h>
#include <math.h>

// =============================================================================
// TARGET MCU: STM32F303CCT6 (LQFP48 Package - 48 Pins)
// ENVIRONMENT: ASSEMBLY LINE / UNIVERSAL TOOL-HEAD CONTROLLER (URTC v1.1)
// PROJECTS: URTC/HYDRA-UMC (JUANENBOT/PAROL6)
// AUTHOR: JuanenRac (Electro Hobby 3D) - electrohobby3d@gmail.com
// SAFETY HARDWARE ALIGNMENT WITH PINOUT V1.0 AND ECOSYSTEM DOC
// =============================================================================

// Firmware identity - must match BOOTLOADER.C's THIS_HARDWARE_ID exactly
// (same board, same check). Reported over CAN via 0x7F8/0x7F9 - see
// HAL_CAN_RxFifo0MsgPendingCallback - so a host can ask "what's currently
// running" before deciding what to flash, without needing to trigger a
// reset into the bootloader first just to find out.
#define THIS_HARDWARE_ID     0x0303CC01UL // STM32F303CCT6, URTC board revision 1
#define FIRMWARE_VERSION_MAJOR 1
#define FIRMWARE_VERSION_MINOR 1

// ID configuration matrix (physical tool-head address readout)
#define ID0_PIN         GPIO_PIN_0  // PF0 - Bit 0
#define ID0_PORT        GPIOF
#define ID1_PIN         GPIO_PIN_1  // PF1 - Bit 1
#define ID1_PORT        GPIOF
#define ID2_PIN         GPIO_PIN_4  // PB4 - Bit 2
#define ID2_PORT        GPIOB
#define ID3_PIN         GPIO_PIN_7  // PB7 - Bit 3
#define ID3_PORT        GPIOB
#define ID4_PIN         GPIO_PIN_13 // PC13 - Bit 4 (32-tool addressing)
#define ID4_PORT        GPIOC

// Dedicated OLED interface via hardware I2C2 (PA9/PA10, AF4)
#define OLED_SCL_PIN    GPIO_PIN_9   // PA9  (Pin 19) -> I2C2_SCL (AF4) - confirmed against DS9118 Table 14
#define OLED_SDA_PIN    GPIO_PIN_10  // PA10 (Pin 20) -> I2C2_SDA (AF4) - confirmed against DS9118 Table 14
#define OLED_PORT       GPIOA
#define OLED_I2C_ADDR   0x78        // (0x3C << 1)
// FM24CL64B parameter-persistence F-RAM (64Kbit/8KB), sharing the OLED's
// own hardware I2C2 bus rather than a new one - this chip only has two
// I2C peripherals total (confirmed against ST's own STM32F303xB/xC
// product page: "up to two I2Cs" - there's no I2C3 on this density
// variant at all, a different situation from some larger STM32F3
// parts that do have one), and this design doesn't use the other one
// (I2C1) at all - its dedicated pin-pairs (PA14/15, PB6/7, PB8/9) are
// all already spoken for by other functions on this board. A third,
// bit-banged bus - the same approach already used for CONN_EXPANSION's
// own I2C - isn't an option either: every free GPIO pin on this board
// is already spoken for by that same bus. Sharing the OLED's bus is a
// deliberate choice: this F-RAM is a core board component, so it makes
// more sense paired with the OLED (another core component, and a
// device this firmware already knows how to share a bus with correctly)
// than routed through the expansion connector's own bus, which is
// reserved for whatever an unknown future expansion board turns out to
// need. Address 0x50 (A0/A1/A2
// tied to GND on the board - the most common wiring for a single device)
// doesn't collide with the OLED's own fixed 0x3C.
//
// F-RAM, not EEPROM: the FM24CL64B is pin/protocol-compatible with a
// serial I2C EEPROM of the same capacity (same control-byte/address
// scheme, confirmed against the official datasheet), but the underlying
// memory technology is genuinely different in two ways that matter here -
// writes complete at bus speed with no internal write cycle to wait for
// ("NoDelay" writes, per the datasheet - by the time a new bus
// transaction could be shifted in, the previous write is already done),
// and endurance is measured in the trillions of cycles rather than the
// ~1 million a real EEPROM would have. See FRAM_WriteBytes() below for
// what this actually changes in the code.
#define FRAM_I2C_ADDR 0xA0          // (0x50 << 1)
#define FRAM_WRITE_CHUNK 32         // not a hardware page-boundary limit the way EEPROM has (F-RAM has none) - just a conservative, arbitrary transaction size
#define FRAM_SIZE_BYTES 8192        // 64Kbit

// CAN BUS physical pin assignment (AF9)
#define CAN_RX_PIN      GPIO_PIN_11 // PA11 (Pin 21) -> CAN_RX (AF9)
#define CAN_TX_PIN      GPIO_PIN_12 // PA12 (Pin 22) -> CAN_TX (AF9)
#define CAN_GPIO_PORT   GPIOA

// Coexisting illumination channels: status LED on PA7/SPI1+DMA, ring on
// PB1/bit-banged - kept on two independent pins so CONN_LED1 and CONN_LED2
// don't need a PCB trace joining them in series.
// PA2 (Pin 8): free - not used by the status LED, which lives on PA7/SPI1 instead.
#define LED_RING_PIN     GPIO_PIN_1  // PB1 (Pin 15) -> Bit-Banging Asm NOPs (Camera Ring)
#define LED_RING_PORT    GPIOB

// Expansion connector's SPI bus (CONN_EXPANSION pins 8/9/12/13) - bit-banged,
// not a hardware SPI peripheral. Reasoning (why not SPI2 or SPI3, both of
// which exist on this chip but don't fit this board without moving other
// already-committed pins): SPI2's default pins are PB12/13/14/15, which
// this board already uses for EXP_TMC_STEP/DIR/EN/EXP_SPI_MOSI. SPI3's default
// pins are PC10/PC11/PC12, which - confirmed against the official
// STM32F303xB/xC datasheet's LQFP48-specific pin table - aren't present on
// this 48-pin package at all, only on the larger LQFP64/LQFP100 variants
// of the same silicon. See PINOUT_CONNECTORS.TXT's CONN_EXPANSION note for
// the full reasoning.
//
// MOSI is PB15 - a natural fit for sharing with a TMC2209 populated
// instead of a TMC5160 on the same connector, since a TMC2209 needs only
// its single UART pin beyond STEP/DIR/EN, and the two chips are never
// populated simultaneously on the same expansion board.
#define EXP_SPI_CS_PIN    GPIO_PIN_2   // PA2
#define EXP_SPI_CS_PORT   GPIOA
#define EXP_SPI_SCK_PIN   GPIO_PIN_2   // PB2
#define EXP_SPI_SCK_PORT  GPIOB
#define EXP_SPI_MISO_PIN  GPIO_PIN_8   // PB8
#define EXP_I2C2_SCL_PORT GPIOB
#define EXP_I2C2_SCL_PIN  GPIO_PIN_10  // PB10 - bit-banged, see MX_ExpansionI2C_Init's own note on why
#define EXP_I2C2_SDA_PORT GPIOB
#define EXP_I2C2_SDA_PIN  GPIO_PIN_11  // PB11 - bit-banged, see MX_ExpansionI2C_Init's own note on why
#define EXP_SPI_MISO_PORT GPIOB
#define EXP_SPI_MOSI_PIN  GPIO_PIN_15  // PB15
#define EXP_SPI_MOSI_PORT GPIOB

// Expansion driver interface (CONN_EXPANSION pins 5/6/15) - STEP/DIR/EN for
// whatever stepper driver (TMC2209 or TMC5160A) is populated on the
// expansion board, universal to either per PINOUT_CONNECTORS.TXT. Existed
// as real hardware pins since the connector's own design, but had no
// #define here until TOOL_CRIMPING_ACTUATOR (doc #12) became the first
// tool actually driving a motor through the expansion board's own driver
// instead of the onboard one - previously mentioned only in a comment
// (and briefly, incorrectly, as "EXP_PWM" - there is no dedicated PWM
// signal on this connector, confirmed against the same pinout doc).
#define EXP_TMC_STEP_PIN  GPIO_PIN_12  // PB12
#define EXP_TMC_STEP_PORT GPIOB
#define EXP_TMC_DIR_PIN   GPIO_PIN_13  // PB13
#define EXP_TMC_DIR_PORT  GPIOB
#define EXP_TMC_EN_PIN    GPIO_PIN_14  // PB14
#define EXP_TMC_EN_PORT   GPIOB

// TMC_DIAG0 - combined stall/fault diagnostic line, shared between the
// onboard TMC2209 (U6's own DIAG pin) and whatever driver populates the
// expansion connector, through a common-cathode dual diode (D4,
// MMBD4148CC): each driver's DIAG output feeds its own anode, the shared
// cathode feeds this pin plus an external 10K pull-down (R50) to GND.
// Diode-OR, not a direct tie, specifically because DIAG is a push-pull
// (actively-driven) output on the TMC2209 - confirmed against its own
// datasheet, which never describes this pin as open-drain the way it
// does other pins where that applies - so two such outputs tied
// directly together would fight if one asserts while the other doesn't,
// with real risk of damaging either driver. The diode-OR sidesteps that
// entirely: each output can only ever pull its own diode's cathode
// side high, never fight the other one's low state.
//
// Active-HIGH as a result (either driver's DIAG going high pulls the
// shared node high through its diode) - the OPPOSITE polarity from an
// single open-drain TMC5160 DIAG0 alone, which pulls active-LOW against
// a pull-up. A TMC5160 populating the expansion connector needs its own
// GCONF.diag0_int_pushpull bit set to 1 (push-pull/active-high) for its
// side of this diode-OR to work correctly - left at its power-on
// default of 0 (open-drain/active-low), its DIAG0 output can only pull
// low or float, never actively drive its diode's anode high, so a
// stall on that side would never register here at all. This firmware
// has no way to set that bit itself - the expansion SPI bus is a
// generic passthrough (0x180/0x181), not aware of TMC5160 registers by
// design (see that command's own note) - so getting this right is up
// to whatever configures the expansion driver, whether that's a script
// sending the right SPI frame over 0x180 or a future expansion board's
// own onboard MCU.
// Uses PC15, one of two general-purpose, EXTI-capable pins reserved for
// exactly this kind of fast interrupt-driven input - which is exactly
// what DIAG0 is. Confirmed no EXTI conflict: nothing else in this
// firmware uses bit 15 of SYSCFG_EXTICR (shared across every port for
// that bit number - see the EXP_GPIO1/2 note this replaces in
// PINOUT.TXT).
#define TMC_DIAG0_PIN  GPIO_PIN_15  // PC15 (was EXP_GPIO2)
#define TMC_DIAG0_PORT GPIOC

// DIAGNOSTIC PIN (Visual indicator / Heartbeat)
#define LED_DIAG_PIN    GPIO_PIN_15 // PA15 (Pin 25) -> Diagnostic digital output
#define LED_DIAG_PORT   GPIOA

// Fixed dedicated peripherals (T12 soldering / 3D hotend block)
#define T12_PWM_PIN     GPIO_PIN_1  // PA1 (Pin 7) -> Soldering iron PWM / Extruder heater
#define T12_PWM_PORT    GPIOA
#define T12_ADC_PIN     GPIO_PIN_0  // PA0 (Pin 6) -> ADC Channel 0 (T12 thermocouple / NTC 100k)

// DYNAMIC CENTRAL PIN SWITCHING MATRIX (PORT B)
#define STEP_PIN         GPIO_PIN_3  // PB3 (Pin 26) - Motor mode: Pulse output
#define STEP_PORT        GPIOB
#define TCRT_D0_DIG_PIN  GPIO_PIN_3  // PB3 (Pin 26) - Vacuum pickup sensor mode: LM393 digital input
#define TOUCH_IN_PIN     GPIO_PIN_3  // PB3 (Pin 26) - Probe mode: EXTI3 impact input

