JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
#define DIR_PIN          GPIO_PIN_5  // PB5 (Pin 28) - Motor mode: Direction output
#define DIR_PORT         GPIOB
// NOTE: PB5 is not used in AOI Inspection mode. That tool's light is the LED
// ring on CONN_LED2 (see ring_pixels[] and Update_AllLEDs_SPI_DMA).

#define TMC_ENN_PIN      GPIO_PIN_6  // PB6 - Stepper driver enable (Active Low)
#define TMC_ENN_PORT     GPIOB
#define DRILL_BRAKE_PIN GPIO_PIN_9 // PB9 - Drill's own BrakeIN line on CONN_DRILL, independent from the stepper tools' enable
#define DRILL_BRAKE_PORT GPIOB
#define LASER_SAFETY_PIN GPIO_PIN_6  // PB6 (Pin 29) - Laser mode: Physical safety interlock

// SPECIAL REASSIGNED PERIPHERALS 
#define LED_SPI_MOSI_PIN  GPIO_PIN_7  // PA7 (Pin 13) -> SPI1_MOSI (AF5) for the status/ring LED chain (see MX_SPI1_Init) - not drill or laser PWM, despite the pin's original silkscreen/net intent; that PWM moved to PA8/TIM1_CH1 once this pin took over SPI1_MOSI duty
#define DRILL_PWM_PORT GPIOA
#define LASER_PWM_PORT   GPIOA

#define TCRT_A0_ADC_PIN  GPIO_PIN_0  // PB0 (Pin 14) -> Sensor mode: Analog ADC Channel 11 input
#define TCRT_A0_ADC_PORT GPIOB

// Smart drill tool-head auxiliary wiring
#define DRILL_FGIN_PIN   GPIO_PIN_3  // PA3 (Pin 9)  -> Tachometer input (EXTI3)

// Hotend cooling fan (3D printer mode only) - CONN_FAN1, uses 2
// free pins PA5/PA6. Distinct from the layer fan (PA7/PA3): this one cools the
// hotend/heatsink itself, the layer fan cools the printed part.
#define HOTEND_FAN_PWM_PIN   GPIO_PIN_5  // PA5 (Pin 11) -> TIM2_CH1 (AF1)
#define HOTEND_FAN_PWM_PORT  GPIOA
#define HOTEND_FAN_FG_PIN    GPIO_PIN_6  // PA6 (Pin 12) -> Tachometer input (EXTI6)
#define HOTEND_FAN_FG_PORT   GPIOA
#define DRILL_FGIN_PORT  GPIOA
#define DRILL_FRIN_PIN   GPIO_PIN_4  // PA4 (Pin 10) -> BL4260 rotation direction output
#define DRILL_FRIN_PORT  GPIOA

// =============================================================================
// 2. ENUMERATIONS AND CONTROL STRUCTURES
// =============================================================================
typedef enum {
    TOOL_SOLDERING_IRON           = 0,  
    TOOL_PASTE_DISPENSER  = 1,  
    TOOL_LIQUID_DISPENSER    = 2,  
    TOOL_SCREWDRIVER     = 3,  
    TOOL_VACUUM_PICKUP            = 4,  
    TOOL_DRILL            = 5,  
    TOOL_GRIPPER_GIMBAL     = 6,  
    TOOL_GRIPPER_NEMA       = 7,  
    TOOL_AOI_INSPECTION     = 8,  
    TOOL_LASER_ENGRAVER     = 9,  
    TOOL_3D_PRINTER       = 10, 
    TOOL_SCAN_PROBE      = 11, 
    // 15-tool expansion (see 15_herramientas.txt) - IDs follow that
    // document's own tool numbering for traceability. Document tools #2
    // (Metrology Touch Probe) and #9 (Micro-Spindle) are explicitly
    // identical to TOOL_SCAN_PROBE and TOOL_DRILL respectively - no new ID,
    // they're just alternate physical end-effectors using the exact same
    // firmware profile, so they don't appear here at all.
    TOOL_SMT_PICKPLACE      = 12, // doc #1
    TOOL_ELECTROMAGNET      = 13, // doc #3
    TOOL_SPOT_WELDER        = 14, // doc #4
    TOOL_CONFORMAL_COATING  = 15, // doc #5
    TOOL_VACUUM_GRIPPER_LG  = 16, // doc #6
    TOOL_FLYING_PROBE       = 17, // doc #7  - ADS1115 (0x48-0x4B)
    TOOL_UV_CURING          = 18, // doc #8
    TOOL_HOTAIR_REWORK      = 19, // doc #10
    TOOL_PRESSFIT_INSERTER  = 20, // doc #11
    TOOL_CRIMPING_ACTUATOR  = 21, // doc #12 - expansion driver (TMC2209/5160A)
    TOOL_THERMAL_INSPECTION = 22, // doc #13 - MLX90640 (0x33)
    TOOL_PASTE_JETTING      = 23, // doc #14
    TOOL_ULTRASONIC_WELDER  = 24, // doc #15
    // The 5-bit ID scheme can read 0-31, but only 0-24 map to a real tool
    // head today. 25-31 (no jumpers matching any assigned tool - most
    // commonly unsoldered jumpers, a wiring fault, or simply an ID not yet
    // assigned to a tool) get their own explicit, deliberately inert state
    // here rather than silently mapping to any real tool - falling through
    // to an existing tool profile would make no sense: it isn't that tool,
    // and every other subsystem in the firmware would still treat it as if
    // it were one. This also leaves headroom for
    // up to 6 more tool heads to be added later without another ID-scheme
    // change (25-30 - 31 stays reserved for FREE CONFIGURATION).
    TOOL_INVALID         = 25
} ToolMode_t;

// Snapshot of parameters worth surviving a power loss, written to the
// FM24CL64B F-RAM - see SavedState_Load()/SavedState_MaybeSave() in
// section 14. __attribute__((packed)) keeps the size predictable (no
// compiler-inserted padding) since this same layout has to match on both
// the write and read side, and the size feeds directly into the checksum
// calculation.
typedef struct __attribute__((packed)) {
    uint32_t magic;              // confirms this F-RAM was actually written by this firmware, not blank/garbage
    uint8_t  struct_version;     // bumped if this layout ever changes, so old/new firmware can tell mismatched saves apart
    uint8_t  active_tool_at_save; // sanity check against the CURRENT active_tool at load time - see the load-time note
    uint16_t solder_setpoint;
    uint16_t printer_nozzle_setpoint;
    uint8_t  drill_speed;
    uint8_t  drill_direction;
    uint8_t  laser_power;
    uint8_t  laser_interlock;
    uint8_t  layer_fan_power;
    uint8_t  hotend_fan_power;
    uint8_t  status_r, status_g, status_b;
    uint8_t  ring_r, ring_g, ring_b, ring_on;
    uint8_t  oled_night_mode;
    uint8_t  had_critical_error; // was system_error_flag set at the moment of the last save, before whatever powered the board off?
    uint8_t  expansion_board_type; // 0=none, 1=basic TMC2209, 2=basic TMC5160A,
                                    // 3=advanced TMC2209+STM32F051T8, 4=advanced
                                    // TMC5160A+STM32F051T8 - see EXPANSION.TXT.
                                    // Set explicitly by the host (0x1A0/0x1A1 -
                                    // see CANBUS.TXT), not auto-detected - there's
                                    // no electrical way to sense which variant (or
                                    // none) is plugged in, so this has to be told
                                    // rather than discovered.
    uint8_t  free_tool_selection;  // Only consulted when the ID-jumper reading is
                                    // 0x1F (11111b, all 5 jumpers installed) - see
                                    // Identify_PhysicalTool()'s own id==31 branch.
                                    // 0 = no tool selected
                                    // (same safe/error state as an unrecognized ID
                                    // reading), 1-12 = one of the 12 currently
                                    // supported tool profiles (stored as id+1, not
                                    // the raw 0-11 ToolMode_t value, so 0 can
                                    // unambiguously mean "nothing chosen yet"
                                    // rather than colliding with tool 0, the
                                    // soldering iron). Set via CAN (0x1A2/0x1A3 -
                                    // see CANBUS.TXT), same reasoning as
                                    // expansion_board_type above.
    uint8_t  device_serial_number; // 0-255, default 0. Purely a host-assigned
                                    // label for telling multiple URTC boards
                                    // apart on the same CAN bus - this firmware
                                    // never reads its own value for any decision,
                                    // it's answered purely for a host/Flasher/
                                    // Tester's own bookkeeping. Set via CAN
                                    // (0x1A4/0x1A5 - see CANBUS.TXT), same
                                    // reasoning as free_tool_selection above. See
                                    // EEPROM.TXT section 6 for the full mechanism
                                    // and why this exists (multiple identically-
                                    // configured boards on one bus were otherwise
                                    // indistinguishable from each other).
    uint8_t  checksum;           // CRC-8 (polynomial 0x07, CRC-8/SMBUS) over every byte above - proportionate for "was this corrupted", not a security boundary the way the OTA update's HMAC is
} SavedState_t;
#define SAVEDSTATE_MAGIC 0x55525443UL // 'URTC' as bytes, arbitrary but distinctive - astronomically unlikely to appear by chance in an uninitialized F-RAM
#define SAVEDSTATE_VERSION 5
// Fixed hardware/firmware identity constant, not a F-RAM field - the same
// for every URTC firmware build, so there's nothing to persist or make
// configurable. 0x03 per EEPROM.TXT section 6's peripheral type
// numbering (0x04-0x05 reserved for expansion-board firmwares, which are
// a different chip - STM32F051T8 - running different firmware entirely,
// not something this codebase reports on their behalf).
#define URTC_PERIPHERAL_TYPE 0x03
#define SAVEDSTATE_FRAM_ADDR 0 // lives at the very start of the F-RAM - nothing else uses this chip yet

// Verified exactly 3 bytes with this toolchain (all-uint8_t members need
// no alignment padding), but __attribute__((packed)) makes that
// explicit rather than relying on it being true "by coincidence" -
// cheap insurance against a future compiler/platform silently adding
// padding and breaking the DMA dump's byte-for-byte protocol match.
typedef struct __attribute__((packed)) {
    uint8_t R; uint8_t G; uint8_t B;
} LED_RGB_t;

