JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// Full standard 5x7 alphanumeric character font (no clipping)
const uint8_t Font5x7[] = {
    0x00,0x00,0x00,0x00,0x00, 0x00,0x00,0x4f,0x00,0x00, 0x07,0x00,0x07,0x00,0x00,
    0x14,0x7f,0x14,0x7f,0x14, 0x24,0x2a,0x7f,0x2a,0x12, 0x23,0x13,0x08,0x64,0x62,
    0x36,0x49,0x55,0x22,0x50, 0x00,0x05,0x03,0x00,0x00, 0x00,0x1c,0x22,0x41,0x00,
    0x00,0x41,0x22,0x1c,0x00, 0x14,0x08,0x3e,0x08,0x14, 0x08,0x08,0x3e,0x08,0x08,
    0x00,0x00,0x00,0x00,0x00, 0x00,0x00,0x00,0x00,0x00, 0x00,0x60,0x60,0x00,0x00,
    0x3e,0x51,0x49,0x45,0x3e, 0x00,0x42,0x7f,0x40,0x00, 0x42,0x61,0x51,0x49,0x46,
    0x21,0x41,0x45,0x4b,0x31, 0x18,0x14,0x12,0x7f,0x10, 0x27,0x45,0x45,0x45,0x39,
    0x3c,0x4a,0x49,0x49,0x30, 0x01,0x71,0x09,0x05,0x03, 0x36,0x49,0x49,0x49,0x36,
    0x06,0x49,0x49,0x29,0x1e, 0x00,0x36,0x36,0x00,0x00, 0x00,0x56,0x36,0x00,0x00,
    0x08,0x14,0x22,0x41,0x00, 0x14,0x14,0x14,0x14,0x14, 0x00,0x41,0x22,0x14,0x08,
    0x02,0x01,0x51,0x09,0x06, 0x32,0x49,0x79,0x41,0x3e, 0x7e,0x11,0x11,0x11,0x7e,
    0x7f,0x49,0x49,0x49,0x36, 0x3e,0x41,0x41,0x41,0x22, 0x7f,0x41,0x41,0x22,0x1c,
    0x7f,0x49,0x49,0x49,0x41, 0x7f,0x09,0x09,0x09,0x01, 0x3e,0x41,0x49,0x49,0x7a,
    0x7f,0x08,0x08,0x08,0x7f, 0x00,0x41,0x7f,0x41,0x00, 0x20,0x40,0x41,0x3f,0x00,
    0x7f,0x08,0x14,0x22,0x41, 0x7f,0x40,0x40,0x40,0x40, 0x7e,0x02,0x0c,0x02,0x7e,
    0x7f,0x04,0x08,0x10,0x7f, 0x3e,0x41,0x41,0x41,0x3e, 0x7f,0x09,0x09,0x09,0x06,
    0x3e,0x41,0x51,0x21,0x5e, 0x7f,0x09,0x19,0x29,0x46, 0x46,0x49,0x49,0x49,0x31,
    0x01,0x01,0x7f,0x01,0x01, 0x3f,0x40,0x40,0x40,0x3f, 0x1f,0x20,0x40,0x20,0x1f,
    0x3f,0x40,0x38,0x40,0x3f, 0x63,0x14,0x08,0x14,0x63, 0x07,0x08,0x70,0x08,0x07,
    0x61,0x51,0x49,0x45,0x43, 0x5c,0x3a,0x2d,0x20,0x5b,
    // Extends through 95 ('_'), matching the range check below. '[', '\',
    // ']', '^' get blank glyphs, consistent with how any other character
    // outside the font's range already renders; '_' (bottom row only,
    // matching this font's bit0=top/bit6=bottom convention already visible
    // in every letter above) is the one that's actually useful - version
    // strings and similar are a natural place an underscore could show up.
    0x00,0x00,0x00,0x00,0x00, 0x00,0x00,0x00,0x00,0x00, 0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00, 0x40,0x40,0x40,0x40,0x40
};

// =============================================================================
// 3. SYSTEM GLOBAL VARIABLES (VOLATILE MULTI-THREAD)
// =============================================================================
volatile ToolMode_t active_tool;

// Parameter persistence (FM24CL64B F-RAM) - see section 14.
SavedState_t recovered_state;      // populated once at boot by SavedState_Load(); had_valid_recovered_state says whether it's meaningful
uint8_t had_valid_recovered_state = 0;
volatile uint8_t expansion_board_type = 0; // 0=none (safe default until the host
                                            // explicitly sets otherwise) - restored
                                            // from F-RAM at boot if a valid save
                                            // exists, updated by 0x1A0 at runtime
volatile uint8_t free_tool_selection = 0;  // 0=none selected (safe default) - restored
                                            // from F-RAM at boot if a valid save
                                            // exists, updated by 0x1A2 at runtime.
                                            // See the SavedState_t field's own
                                            // comment for the encoding (stored as
                                            // id+1, not the raw ToolMode_t value).
volatile uint8_t device_serial_number = 0; // 0=unassigned (default) - restored from
                                            // F-RAM at boot if a valid save exists,
                                            // updated by 0x1A4 at runtime. Purely a
                                            // host-assigned label - never consulted
                                            // by this firmware for any decision.
uint8_t raw_id_pin_value = 0xFF;           // The actual 5-bit ID-jumper reading
                                            // (0-31) from Identify_PhysicalTool(),
                                            // kept separately from active_tool so
                                            // that same function's id==31 branch can tell
                                            // "the jumpers read 0x1F" apart from
                                            // "active_tool has already been resolved
                                            // to something else since". 0xFF is not
                                            // a valid 5-bit reading - never mistaken
                                            // for a real one.
SavedState_t last_saved_state;     // mirrors what's currently written to the F-RAM, for change detection in SavedState_MaybeSave()
uint32_t last_fram_write_tick = 0;

CAN_HandleTypeDef hcan;
CAN_RxHeaderTypeDef rxHeader;
uint8_t rxData[8];

TIM_HandleTypeDef htim3;     
TIM_HandleTypeDef htim1;     // Drill/laser/layer-fan PWM (PA8, TIM1_CH1) - replaces
                              // both the old TIM3_CH2 and TIM17_CH1 usage now that
                              // PA7 carries SPI1_MOSI instead
TIM_HandleTypeDef htim2;     // Dedicated to the hotend fan's PWM (25kHz, PA5/TIM2_CH1)
SPI_HandleTypeDef hspi1;     // Drives both status LED and ring via DMA (PA7/MOSI)
DMA_HandleTypeDef hdma_spi1_tx;
I2C_HandleTypeDef hi2c2;     // Hardware I2C2 for the OLED+F-RAM (PA9/PA10 - AF4 on these pins is I2C2, not I2C1, confirmed against DS9118)
// Expansion connector's own I2C bus (PB10/PB11) is bit-banged, not a
// hardware peripheral - see MX_ExpansionI2C_Init's own note on why, and
// ExpansionI2C_Start/Stop/WriteByte/ReadByte for the implementation. No
// HAL handle needed for a bit-banged bus.
ADC_HandleTypeDef hadc;
IWDG_HandleTypeDef hiwdg;

volatile LED_RGB_t led_state_pixel;      
volatile LED_RGB_t ring_pixels[8];        

volatile uint32_t steps_remaining = 0;
// Which half of the current step pulse the ISR is in - promoted from a
// function-local static so a new move command can reset it (see the 0x120/
// 0x170 handlers): if left at 1 (high) from the tail end of a previous move,
// the very first tick of a fresh move would perform a falling edge instead
// of the intended rising edge, misaligning that first step.
volatile uint8_t step_pulse_high = 0;
volatile uint32_t total_steps_setpoint = 1; 
volatile uint16_t current_temperature = 0;
volatile uint16_t target_temperature = 0;
volatile uint16_t sensor_analog_reading = 0;
volatile uint8_t sensor_digital_reading = 0;
volatile uint8_t drill_speed = 0;       
volatile uint32_t drill_rpm_pulses = 0; 
volatile uint32_t drill_actual_rpm = 0;

// Layer fan (TOOL_3D_PRINTER mode) - reuses PA8 (PWM, TIM1_CH1) and
// PA3 (FG, EXTI3), the same pins as DRILL_PWM/DRILL_FGIN, since both
// tools are never active at the same time (one board = one physical tool).
volatile uint8_t layer_fan_duty = 0;     // 0-255 setpoint received via CAN (0x173)
volatile uint32_t layer_fan_rpm_pulses = 0;          // FG edge accumulator between telemetry cycles
volatile uint32_t layer_fan_actual_rpm = 0;          // Calculated RPM, ready for 0x177 telemetry
volatile uint8_t system_error_flag = 0; 
// Defers movement commands until the boot splash completes - TIM3 (step
// generation) and CAN are both already live during the 5s splash, so a
// 0x120/0x170 move command arriving in that window would otherwise start
// producing real step pulses immediately, moving a physical motor while
// the screen still shows the boot logo. Telemetry and lighting are
// unaffected by this flag.
volatile uint8_t boot_sequence_active = 1;
// CAN bus error indicator - separate from system_error_flag since
// a transient bus fault that AutoBusOff recovers from on its own shouldn't
// necessarily block all future commands the way a declared critical error
// does; this just drives a visible OLED indicator.
volatile uint8_t can_bus_error_flag = 0;

volatile uint8_t laser_power_setpoint = 0;
volatile uint32_t laser_last_kick_tick = 0;
volatile uint8_t  weld_pulse_active = 0;
volatile uint32_t weld_pulse_start_tick = 0;
volatile uint16_t weld_pulse_duration_ms = 0;
volatile uint32_t drill_last_kick_tick = 0;
volatile uint32_t layer_fan_last_kick_tick = 0; // Layer fan communication watchdog (does not touch PB6)

// Hotend cooling fan (3D printer mode, CONN_FAN1, PA5/PA6) - separate from the
// layer fan above. Same telemetry/watchdog pattern, own set of variables.
volatile uint8_t hotend_fan_duty = 0;
volatile uint32_t hotend_fan_rpm_pulses = 0;
volatile uint32_t hotend_fan_actual_rpm = 0;
volatile uint32_t hotend_fan_last_kick_tick = 0;
// Communication watchdog for both thermal tools (soldering iron, 3D printer
// hotend) - without it, losing CAN comms while a heater is actively on
// would leave the bang-bang loop using the last target_temperature
// forever, with nothing to cut power.
volatile uint32_t solder_iron_last_kick_tick = 0;
volatile uint32_t hotend_heater_last_kick_tick = 0;
volatile uint8_t aoi_mode = 0;
volatile uint16_t aoi_strobe_period = 0;
// Non-blocking state machine for the AOI strobe, instead of a blocking
// HAL_Delay() that would freeze the whole main loop (PID, watchdogs,
// telemetry) for up to 500ms per pulse: aoi_strobe_active marks "LEDs are
// on, waiting to turn off", aoi_strobe_off_tick records when that should happen.
volatile uint8_t aoi_strobe_active = 0;
volatile uint32_t aoi_strobe_off_tick = 0;

