JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
volatile uint8_t oled_night_mode = 0; 
volatile uint8_t oled_mode_pending_flag = 0;
volatile uint8_t oled_night_mode_cmd = 0;

volatile uint8_t update_led_ring_flag = 0;
// Ring color, set via 0x100 and persisted - AOI's continuous/strobe modes
// (0x150) reuse whatever was last set here rather than carrying their own
// separate color.
volatile uint8_t ring_color_r = 0;
volatile uint8_t ring_color_g = 0;
volatile uint8_t ring_color_b = 0;
volatile uint8_t trigger_aoi_strobe_flag = 0;
volatile uint32_t probe_impact_counter = 0; // counts impacts detected in TOOL_SCAN_PROBE mode

// Generic endstop/limit switch on PB3 (Soldering iron, Drill, Laser, AOI modes -
// tools that don't already have a dedicated meaning for this pin). Active low.
volatile uint8_t endstop_triggered = 0;

// Top yellow strip state (blinking CAN icon + tool-icon animation)
volatile uint32_t can_led_tick = 0;        // timestamp of the last RX, to turn the icon off after ~200ms
// Automatic status LED color scheme (CONN_LED1) - see Update_StatusLED_AutoColor().
// A host-sent CAN 0x100 color holds for a while (long enough to actually be
// seen) before falling back to the automatic scheme, rather than being
// silently overwritten on the very next loop iteration.
volatile uint8_t led_host_override_active = 0;
volatile uint32_t led_host_override_expire_tick = 0;
#define LED_HOST_OVERRIDE_DURATION_MS 10000
#define LED_FUNCTIONING_WINDOW_MS     1500
uint8_t animation_frame = 0;               // 0/1 - toggles the tool icon's animation frame

// Global function prototypes
void SystemClock_Config(void);
void MX_GPIO_Init_Early(void);
void MX_GPIO_Post_Init(void);
void MX_CAN_Init(void);
void MX_TIM3_Full_Init(void); 
void MX_TIM1_DrillLaserFan_Init(uint32_t period); // Drill/laser/layer-fan PWM on TIM1_CH1 (PA8)
void MX_TIM2_HotendFan_Init(void); // Dedicated 25kHz PWM for the hotend fan (PA5/AF2)
void Telemetry_HotendFan(void);
void Watchdog_Safety_HotendFan(void);
void MX_ADC_Init(uint32_t channel);

// Hardware I2C2 (PA9/PA10, AF4) and OLED driver built on top of it
void MX_I2C2_Init(void);
void MX_ExpansionI2C_Init(void);
void MX_DMA_Init(void);
void MX_SPI1_Init(void);
void OLED_WriteCmd(uint8_t cmd);
void OLED_WriteData(uint8_t *buf, uint16_t len);
void MX_I2C2_Init_Early(void);
void OLED_Init(void);
void OLED_SetCursor(uint8_t page, uint8_t col);
void OLED_ClearPage(uint8_t page);
void OLED_PrintStr(uint8_t page, uint8_t col, const char* str);
uint8_t append_str(char *dest, const char *src);
uint8_t fmt_uint(char *dest, uint32_t value, uint8_t width);
void OLED_DrawHorizontalBar(uint8_t page, uint8_t col_start, uint8_t max_width, uint8_t percent);
void OLED_DrawToolIcon(uint8_t tool);
void OLED_Render_YellowStrip(void);
void Render_SplashScreen(uint8_t arm_frame);
void Render_ToolScreen(void);
void Process_OLED_NightModeChange(void);

void Update_StatusLED_AutoColor(void);
uint8_t Update_StatusLED_SPI_DMA(void);
void Update_RingLEDs_BitBang(void);
uint8_t ExpansionSPI_TransferByte(uint8_t tx_byte);
void ExpansionI2C_Start(void);
void ExpansionI2C_Stop(void);
uint8_t ExpansionI2C_WriteByte(uint8_t byte);
uint8_t ExpansionI2C_ReadByte(uint8_t send_ack);
uint8_t ExpansionI2C_HadTimeout(void);
void MX_ExpansionSPI_Init(void);
uint8_t FRAM_WriteBytes(uint16_t addr, const uint8_t *data, uint16_t len);
uint8_t FRAM_ReadBytes(uint16_t addr, uint8_t *data, uint16_t len);
static uint8_t SavedState_Checksum(const SavedState_t *s);
void SavedState_Load(void);
void SavedState_MaybeSave(void);
void Control_SolderingIron_PID(void);
void Control_3D_Hotend_PID(void);
void Control_SensorTelemetry(void);
void Control_EndstopTelemetry(void);
void Telemetry_Drill(void);
void Telemetry_LayerFan(void);
void Watchdog_Safety_Laser(void);
void WeldPulse_Tick(void);
void Watchdog_Safety_Drill(void);
void Watchdog_Safety_LayerFan(void);
void Watchdog_Safety_SolderIron(void);
void Watchdog_Safety_HotendHeater(void);

// =============================================================================
// 4. LOW-LEVEL OLED GRAPHICS SUBSYSTEM (HARDWARE I2C2)
// =============================================================================
// Init for the OLED's hardware I2C2 bus (PA9/PA10, AF4). Timing register value
// is derived (not guessed) from ST's official AN4235 100kHz-Standard-Mode
// reference figures, scaled from 48MHz down to this chip's actual 8MHz I2C
// kernel clock (both I2C1 and I2C2 are explicitly HSI-sourced - see
// PeriphClkInit.I2c1ClockSelection/I2c2ClockSelection in SystemClock_Config
// - so this same timing value is valid for either peripheral) - getting
// this wrong means the OLED silently doesn't respond with no obvious
// error to debug.
void MX_I2C2_Init(void) {
    __HAL_RCC_I2C2_CLK_ENABLE();

    hi2c2.Instance = I2C2;
    hi2c2.Init.Timing = 0x0010232A; // ~100kHz @ 8MHz I2CCLK (this chip's I2C2
    // kernel clock is HSI-sourced directly at 8MHz, independent of the
    // 64MHz system clock - see SystemClock_Config). Derived by scaling the
    // AN4235 100kHz@48MHz reference timing targets down to 8MHz; worth
    // confirming on a scope/logic analyzer before relying on it in the field.
    hi2c2.Init.OwnAddress1 = 0;
    hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c2.Init.OwnAddress2 = 0;
    hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    HAL_I2C_Init(&hi2c2);
}

// Expansion connector's own I2C bus. Kept electrically separate from I2C2/the OLED for the
// reason noted on hi2c2's declaration above. Reuses I2C2's exact timing
// value rather than deriving a new one, since both are configured to the
// same HSI 8MHz kernel clock source here.
// Bit-banged I2C master for CONN_EXPANSION's own bus (PB10=SCL, PB11=SDA).
// Not a hardware I2C peripheral: confirmed against DS9118 Tables 14/15
// that neither pin actually offers an I2C alternate function on this
// chip (the only 3 real hardware-I2C1 pin-pairs - PA14/15, PB6/7, PB8/9 -
// are all already committed to other functions on this design, with no
// free pins to relocate anything to). Bit-banging sidesteps the
// alternate-function requirement entirely - these pins just need to be
// plain open-drain GPIO, which every pin supports regardless of AF
// capability. Same electrical requirements as any I2C bus either way:
// R44/R48 (4.7k pull-ups to +3.3V) are already populated on both lines.
//
// Standard Mode timing (~100kHz, matching this project's hardware I2C2
// bus for the OLED/F-RAM) - roughly 5us per half-bit-period. Not
// cycle-counted precisely (unlike the WS2812B driver, which is
// time-triggered against a protocol-defined bit period); I2C is
// edge-triggered from the slave's perspective, so a plain small delay
// between edges is sufficient and correct, same reasoning as the
// expansion SPI driver above. 320 iterations, not 40: confirmed
// (compiled to assembly and compared instruction-for-instruction, not
// just estimated) that this loop's own per-iteration cost is identical
// to the T12 thermal loop's 640-iteration/~10us delay elsewhere in this
// firmware - 40 iterations here was actually producing ~0.625us, not
// ~5us, pushing this bus toward ~800kHz instead of the intended
// 100kHz. 320 (640 * 5/10) targets the actual documented ~5us.
static void ExpansionI2C_Delay(void) {
    for (volatile uint32_t d = 0; d < 320; d++);
}

