JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// Open-drain "write": SET releases the line (pulled high externally by
// R44/R48), RESET actively pulls it low. Never actually drives high -
// matches real I2C's wired-AND requirement, where two devices pulling
// opposite directions on the same line at once would short the bus if
// either one drove a real high/low push-pull output instead.
static void ExpansionI2C_SetSCL(uint8_t high) {
    HAL_GPIO_WritePin(EXP_I2C2_SCL_PORT, EXP_I2C2_SCL_PIN, high ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static uint8_t ExpansionI2C_ReadSCL(void) {
    return (HAL_GPIO_ReadPin(EXP_I2C2_SCL_PORT, EXP_I2C2_SCL_PIN) == GPIO_PIN_SET) ? 1 : 0;
}
// Set by ExpansionI2C_SetSCL_WaitHigh() whenever it times out, cleared at
// the start of every transaction - not yet consumed by any caller (this
// whole API isn't wired to a CAN command yet, unlike the expansion SPI's
// own 0x180/0x181 passthrough), but every high-level function below was
// silently ignoring this function's own return value, meaning a stuck-low
// SCL (a shorted bus, or a slave stretching indefinitely) would have gone
// completely unnoticed - the master would sample/drive SDA as if the
// clock edge had genuinely happened, on a bus that was never actually
// ready. Whenever this API is wired to something, check this flag after
// the transaction completes rather than trusting the data unconditionally.
static uint8_t expansion_i2c_scl_timeout = 0;
uint8_t ExpansionI2C_HadTimeout(void) {
    return expansion_i2c_scl_timeout;
}

// Releases SCL high, then waits (bounded) for it to actually read high
// before returning - a real I2C slave is allowed to hold SCL low itself
// to pause the transaction (clock stretching, a standard part of the I2C
// spec, not an error condition). Skipping this wait and assuming SCL
// went high the instant it's released would let this master sample/
// change SDA while a stretching slave still has the clock held down,
// corrupting the transfer. ~2000 loop iterations at this delay's own
// per-iteration granularity is generously above any I2C device's realistic
// stretch duration without risking a true bus-stuck condition hanging
// forever.
static uint8_t ExpansionI2C_SetSCL_WaitHigh(void) {
    ExpansionI2C_SetSCL(1);
    for (uint16_t timeout = 0; timeout < 2000; timeout++) {
        if (ExpansionI2C_ReadSCL()) return 1;
    }
    expansion_i2c_scl_timeout = 1; // SCL never actually went high - a stuck slave or a wiring fault
    return 0;
}
static void ExpansionI2C_SetSDA(uint8_t high) {
    HAL_GPIO_WritePin(EXP_I2C2_SDA_PORT, EXP_I2C2_SDA_PIN, high ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static uint8_t ExpansionI2C_ReadSDA(void) {
    return (HAL_GPIO_ReadPin(EXP_I2C2_SDA_PORT, EXP_I2C2_SDA_PIN) == GPIO_PIN_SET) ? 1 : 0;
}

// START condition: SDA falls while SCL is high. Caller's responsibility
// to have both lines idling high beforehand (the reset/idle state).
void ExpansionI2C_Start(void) {
    expansion_i2c_scl_timeout = 0; // fresh transaction, fresh timeout state
    ExpansionI2C_SetSDA(1);
    ExpansionI2C_SetSCL_WaitHigh();
    ExpansionI2C_Delay();
    ExpansionI2C_SetSDA(0);
    ExpansionI2C_Delay();
    ExpansionI2C_SetSCL(0);
    ExpansionI2C_Delay();
}

// STOP condition: SDA rises while SCL is high.
void ExpansionI2C_Stop(void) {
    ExpansionI2C_SetSDA(0);
    ExpansionI2C_Delay();
    ExpansionI2C_SetSCL_WaitHigh();
    ExpansionI2C_Delay();
    ExpansionI2C_SetSDA(1);
    ExpansionI2C_Delay();
}

// Clocks out 8 bits (MSB first) then reads the 9th (ACK/NACK) bit.
// Returns 1 if the slave ACKed (pulled SDA low), 0 for NACK/no response -
// matching how a real hardware I2C peripheral's status flag would read.
uint8_t ExpansionI2C_WriteByte(uint8_t byte) {
    for (int8_t i = 7; i >= 0; i--) {
        ExpansionI2C_SetSDA((byte >> i) & 0x01);
        ExpansionI2C_Delay();
        ExpansionI2C_SetSCL_WaitHigh();
        ExpansionI2C_Delay();
        ExpansionI2C_SetSCL(0);
        ExpansionI2C_Delay();
    }
    // Release SDA so the slave can drive it for the ACK bit.
    ExpansionI2C_SetSDA(1);
    ExpansionI2C_Delay();
    ExpansionI2C_SetSCL_WaitHigh();
    ExpansionI2C_Delay();
    uint8_t ack = (ExpansionI2C_ReadSDA() == 0) ? 1 : 0;
    ExpansionI2C_SetSCL(0);
    ExpansionI2C_Delay();
    return ack;
}

// Clocks in 8 bits (MSB first), then sends ACK (send_ack=1, more bytes
// to follow) or NACK (send_ack=0, this is the last byte being read).
uint8_t ExpansionI2C_ReadByte(uint8_t send_ack) {
    uint8_t byte = 0;
    ExpansionI2C_SetSDA(1); // release - let the slave drive each data bit
    for (uint8_t i = 0; i < 8; i++) {
        ExpansionI2C_Delay();
        ExpansionI2C_SetSCL_WaitHigh();
        ExpansionI2C_Delay();
        byte = (byte << 1) | ExpansionI2C_ReadSDA();
        ExpansionI2C_SetSCL(0);
    }
    ExpansionI2C_SetSDA(send_ack ? 0 : 1);
    ExpansionI2C_Delay();
    ExpansionI2C_SetSCL_WaitHigh();
    ExpansionI2C_Delay();
    ExpansionI2C_SetSCL(0);
    ExpansionI2C_SetSDA(1); // release again for whatever comes next
    ExpansionI2C_Delay();
    return byte;
}

void MX_ExpansionI2C_Init(void) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitTypeDef gpio = {0};
    gpio.Pin = GPIO_PIN_10 | GPIO_PIN_11;
    gpio.Mode = GPIO_MODE_OUTPUT_OD; // open-drain, matching I2C's wired-AND bus
    gpio.Pull = GPIO_NOPULL; // R44/R48 already provide the real pull-ups externally
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &gpio);
    // Idle state: both lines released high.
    ExpansionI2C_SetSCL_WaitHigh();
    ExpansionI2C_SetSDA(1);
}

// DMA1_Channel3 is this chip's default (unremapped) SPI1_TX request line -
// confirmed via SYSCFG_CFGR3's SPI1_TX_DMA_RMP field, which defaults to 00
// (no remap) on reset; this firmware never touches that register, so it
// stays at the default mapping. Must be initialized before MX_SPI1_Init
// links it to hspi1.hdmatx.
void MX_DMA_Init(void) {
    __HAL_RCC_DMA1_CLK_ENABLE();

    hdma_spi1_tx.Instance = DMA1_Channel3;
    hdma_spi1_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_spi1_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_spi1_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_spi1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_spi1_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_spi1_tx.Init.Mode = DMA_NORMAL;
    hdma_spi1_tx.Init.Priority = DMA_PRIORITY_LOW;
    HAL_DMA_Init(&hdma_spi1_tx);
    HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);

    __HAL_LINKDMA(&hspi1, hdmatx, hdma_spi1_tx);
}

// SPI1 configured purely as a WS2812B-via-SPI bit-pattern generator: only
// MOSI (PA7) carries a meaningful signal, so SCK/MISO/NSS are left
// unconfigured (still their GPIO reset defaults) and software NSS management
// is used so the peripheral doesn't wait on a hardware NSS pin that isn't
// wired to anything. 2MHz clock (64MHz APB2 / 32) - see the ws2812_lut
// comment for why this specific rate.
void MX_SPI1_Init(void) {
    __HAL_RCC_SPI1_CLK_ENABLE();
    // PA7's SPI1_MOSI/AF5 config lives in MX_GPIO_Post_Init (unconditional,
    // alongside the rest of this board's universal pin setup) - not repeated here.

    hspi1.Instance = SPI1;
    hspi1.Init.Mode = SPI_MODE_MASTER;
    hspi1.Init.Direction = SPI_DIRECTION_2LINES; // MISO unused but this is the standard/simplest mode
    hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
    hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
    hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi1.Init.NSS = SPI_NSS_SOFT; // no physical NSS pin wired - avoid waiting on one
    hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32; // 64MHz/32 = 2MHz
    hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB; // matches the ws2812_lut generation
    hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
    hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    hspi1.Init.CRCPolynomial = 7;
    HAL_SPI_Init(&hspi1);
}

// Set once by OLED_Init(); every OLED write function checks this first
// and returns immediately if the display never responded, rather than
// paying a real I2C timeout on every single command for the rest of the
// session. A missing/disconnected display should never be able to stack
// repeated 50ms timeouts against the 20ms PID loop and the other
// real-time work sharing this same main loop. The 50ms timeouts below
// stay as a second, independent layer for the case this flag can't catch:
// a display that responded fine at init but fails mid-session (a
// damaged cable, a connector working loose) - the reasoning in each
// comment for why 50ms specifically was chosen is unchanged.
uint8_t oled_present = 1;

// Wraps every I2C2 transmit on this bus (OLED + F-RAM both use it) with
// error detection: if a transmission times out or errors, hi2c2 can be
// left in HAL_I2C_STATE_BUSY/ERROR with nothing else in this firmware to
// detect or recover it, silently breaking every subsequent transaction
// on this bus (both the display AND the F-RAM, since they share it) for
// the rest of runtime. One HAL_I2C_DeInit()+MX_I2C2_Init() re-init
// attempt on failure is cheap insurance against a transient glitch
// (electrical noise, a momentary bus contention) leaving the peripheral
// stuck rather than genuinely disconnected hardware, which would just
// fail again next time and get caught by oled_present's own probe.
static uint8_t I2C2_TransmitWithRecovery(uint16_t addr, uint8_t *data, uint16_t len) {
    if (HAL_I2C_Master_Transmit(&hi2c2, addr, data, len, 50) == HAL_OK) return 1;
    HAL_I2C_DeInit(&hi2c2);
    MX_I2C2_Init();
    return (HAL_I2C_Master_Transmit(&hi2c2, addr, data, len, 50) == HAL_OK) ? 1 : 0;
}

void OLED_WriteCmd(uint8_t cmd) {
    if (!oled_present) return;
    uint8_t frame[2] = {0x00, cmd}; // control byte 0x00 = command stream
    I2C2_TransmitWithRecovery(OLED_I2C_ADDR, frame, 2);
}

void OLED_WriteData(uint8_t *buf, uint16_t len) {
    if (!oled_present) return;
    if (len == 0) return; // a control-byte-only transaction with no data
                           // bytes following desyncs some SSD1306 clone
                           // controllers - nothing to actually write anyway.
    // Control byte and pixel data must go out in a single I2C transaction -
    // per the SSD1306 protocol, every transaction needs its own control
    // byte, so sending them as two separate transactions would make the
    // display read the data's first byte as a malformed control byte.
    if (len > 128) len = 128; // defensive clamp - every real call site today
                              // is verified within this bound, but this
                              // costs nothing and protects against a future
                              // caller passing an oversized len.
    uint8_t frame[129];
    frame[0] = 0x40;
    memcpy(&frame[1], buf, len);
    I2C2_TransmitWithRecovery(OLED_I2C_ADDR, frame, len + 1);
}

void OLED_SetCursor(uint8_t page, uint8_t col) {
    if (!oled_present) return;
    // Combined into one transaction rather than 3 separate OLED_WriteCmd
    // calls - the SSD1306 protocol allows any number of command bytes to
    // follow a single 0x00 control byte, so there's no need to repeat the
    // START/address/control/STOP overhead for each of the 3 commands here.
    uint8_t frame[4] = {0x00, (uint8_t)(0xB0 + page), (uint8_t)(0x00 + (col & 0x0F)), (uint8_t)(0x10 + ((col >> 4) & 0x0F))};
    I2C2_TransmitWithRecovery(OLED_I2C_ADDR, frame, 4);
}

// Split out from OLED_Init() below - just the I2C2 peripheral+pin setup,
// with none of the OLED-specific probing/commands that follow it there.
// Called early in main(), before Identify_PhysicalTool(), specifically so
// that function can read the F-RAM directly when the ID-jumper reading is
// 0x1F (11111b, "free configuration" - see EEPROM.TXT) - the F-RAM shares
// this same I2C2 bus with the OLED (see FRAM_I2C_ADDR's own comment), and
// without this split, I2C2 wouldn't be usable until OLED_Init() runs,
// which happens much later in boot (after MX_GPIO_Post_Init() has already
// configured tool-dependent pins/timers/ADC based on whatever
// active_tool was at that point). OLED_Init() below also calls this
// function rather than keeping its own copy of this setup, same as
// everything else that needs I2C2 up before using it.
void MX_I2C2_Init_Early(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitStruct.Pin = OLED_SCL_PIN | OLED_SDA_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD; // Open-drain: I2C is wired-AND, matches R33/R34's external pull-ups
    GPIO_InitStruct.Pull = GPIO_PULLUP;     // Belt-and-suspenders alongside R33/R34
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C2;
    HAL_GPIO_Init(OLED_PORT, &GPIO_InitStruct);

