JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
    MX_I2C2_Init();
}

void OLED_Init(void) {
    MX_I2C2_Init_Early();
    
    HAL_Delay(50);
    // A single, cheap probe decides whether this session touches the
    // display at all - one bounded transaction instead of every
    // subsequent command individually risking a timeout against a
    // display that was never going to answer (never populated, a
    // damaged cable, etc. - all indistinguishable from here, and all
    // handled the same way: skip the rest of this function, and every
    // OLED_WriteCmd/WriteData call for the rest of the session).
    oled_present = (HAL_I2C_IsDeviceReady(&hi2c2, OLED_I2C_ADDR, 2, 5) == HAL_OK) ? 1 : 0;
    if (!oled_present) return;
    // Verified compatible with both SSD1306 and SSD1315 (a newer, drop-in
    // replacement controller that many "SSD1306" modules actually ship
    // with today without the silkscreen/listing changing) - Solomon
    // Systech's own SSD1315 datasheet documents an identical command
    // register set to the SSD1306, and this full sequence (as opposed to a
    // truncated one) is what community reports confirm as most reliable
    // across both. One SSD1315-specific quirk exists in the wild: some
    // units emit an audible high-frequency squeak with the standard 0xD5
    // 0x80 oscillator setting, fixed by using 0xD5 0xF0 instead - cosmetic
    // only (doesn't affect what's shown), so left at the SSD1306-standard
    // 0x80 here rather than changing a working parameter on unverified
    // hardware; if a squeak shows up on the actual board, that's the
    // specific value to try.
    OLED_WriteCmd(0xAE); 
    OLED_WriteCmd(0xD5); OLED_WriteCmd(0x80);
    OLED_WriteCmd(0xA8); OLED_WriteCmd(0x3F); 
    OLED_WriteCmd(0xD3); OLED_WriteCmd(0x00);
    OLED_WriteCmd(0x40); 
    OLED_WriteCmd(0x8D); OLED_WriteCmd(0x14); 
    OLED_WriteCmd(0x20); OLED_WriteCmd(0x02); 
    OLED_WriteCmd(0xA1); 
    OLED_WriteCmd(0xC8); 
    OLED_WriteCmd(0xDA); OLED_WriteCmd(0x12);
    OLED_WriteCmd(0x81); OLED_WriteCmd(0xCF); 
    OLED_WriteCmd(0xD9); OLED_WriteCmd(0xF1);
    OLED_WriteCmd(0xDB); OLED_WriteCmd(0x40);
    OLED_WriteCmd(0xA4); OLED_WriteCmd(0xA6); 
    OLED_WriteCmd(0xAF); 
}

// FLASH OPTIMIZATION: replaces sprintf() for all OLED text. sprintf/printf's
// format-string parser plus its float-formatting support pulled in roughly
// 2KB of C library code that this firmware never needed the full generality
// of - every call here only ever builds simple "label + padded number" text.
// These two tiny helpers do the same job at a fraction of the size.

// Copies a null-terminated string, returns how many characters were written
// (not counting the terminator) so the caller can chain calls at the right
// offset without needing strlen().
uint8_t append_str(char *dest, const char *src) {
    uint8_t i = 0;
    while (src[i]) { dest[i] = src[i]; i++; }
    return i;
}

// Writes an unsigned integer in decimal, right-aligned and space-padded to
// at least 'width' characters (writes more if the value needs it - never
// truncates). Does NOT null-terminate; the caller terminates once after the
// last piece, same pattern as append_str.
uint8_t fmt_uint(char *dest, uint32_t value, uint8_t width) {
    char tmp[10]; // max uint32_t is 10 digits
    // Every current call site passes a fixed literal (3/4/5), so this
    // isn't reachable today - but width has no relationship to dest's
    // actual capacity otherwise, and the caller's buffer is sized for
    // one OLED line (see OLED_PrintStr's own 21-character note), so
    // capping here protects any future caller that computes width
    // dynamically instead of using a literal.
    if (width > 21) width = 21;
    uint8_t n = 0;
    do {
        tmp[n++] = '0' + (value % 10);
        value /= 10;
    } while (value > 0);
    uint8_t pad = (n < width) ? (width - n) : 0;
    uint8_t pos = 0;
    while (pad-- > 0) dest[pos++] = ' ';
    while (n > 0) dest[pos++] = tmp[--n];
    return pos;
}

void OLED_PrintStr(uint8_t page, uint8_t col, const char* str) {
    OLED_SetCursor(page, col);
    // Builds the whole string's pixel data locally, then sends it in one
    // I2C transaction rather than one transaction per character - each
    // transaction carries full protocol overhead (START, address, control
    // byte, data, STOP), so batching matters for a 15-20 character line.
    // Capped at 21 characters (126 columns): as many as fit in the
    // 128-column frame OLED_WriteData already caps itself at.
    uint8_t line_buf[126];
    uint8_t len = 0;
    while (*str && len < 21) {
        char c = *str++;
        if (c >= 'a' && c <= 'z') c -= 32; // Font5x7 only has glyphs 32-91 (no lowercase):
                                            // without this, "v1.0" or "__DATE__" (e.g. "Jul") would
                                            // come out with blank gaps where each lowercase letter was.
        if (c >= 32 && c <= 95) {
            uint16_t idx = (c - 32) * 5;
            for (uint8_t i = 0; i < 5; i++) line_buf[len*6 + i] = Font5x7[idx+i];
        } else {
            for (uint8_t i = 0; i < 5; i++) line_buf[len*6 + i] = 0x00;
        }
        line_buf[len*6 + 5] = 0x00; // 1px inter-character spacing
        len++;
    }
    OLED_WriteData(line_buf, len * 6);
}

void OLED_ClearPage(uint8_t page) {
    OLED_SetCursor(page, 0);
    // One 128-byte transaction rather than 8 separate 16-byte ones - same
    // reasoning as OLED_SetCursor's own fix above: each transaction
    // carries its own START/address/control/STOP overhead, and
    // OLED_WriteData's own frame buffer already supports the full 128
    // bytes a page needs in a single call.
    static const uint8_t vacio[128] = {0};
    OLED_WriteData((uint8_t *)vacio, 128);
}

void OLED_DrawHorizontalBar(uint8_t page, uint8_t col_start, uint8_t max_width, uint8_t percent) {
    if (percent > 100) percent = 100;
    if (max_width > 128) max_width = 128; // matches OLED_WriteData's own frame buffer cap
    // Every current call site uses col_start=5, max_width=85 (well within
    // the 128-column display), so this isn't reachable today - but
    // nothing else here checks the combination, and a future caller with
    // a different col_start could push filled pixels past column 127,
    // wrapping onto the start of the same page instead of simply running
    // off the edge.
    if (col_start < 128 && (uint16_t)col_start + max_width > 128) {
        max_width = 128 - col_start;
    }
    uint8_t filled_pixels = (max_width * percent) / 100;

    // Builds the whole bar locally and sends it in one I2C transaction,
    // rather than one transaction per column - each carries full protocol
    // overhead, and this loop runs on the same thread as the 20ms PID loop.
    uint8_t bar_buffer[128];
    for(uint8_t i = 0; i < max_width; i++) {
        if(i == 0 || i == (max_width - 1)) {
            bar_buffer[i] = 0x7E;
        } else if(i <= filled_pixels) {
            bar_buffer[i] = 0x5E;
        } else {
            bar_buffer[i] = 0x42;
        }
    }

