JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
    OLED_SetCursor(page, col_start);
    OLED_WriteData(bar_buffer, max_width);
}

// 16x16 monochrome icon table, one per each of the 12 tools.
// SSD1306 format: 2 pages (top/bottom) x 16 columns, bit0 = the page's
// top row (same convention as Font5x7). Generated from simple silhouettes
// recognizable at this very small size.
static const uint8_t ToolIcons[12][4][2][16] = {
    // 0 TOOL_SOLDERING_IRON
    {
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0xF0,0xF8,0x7C,0x3A,0x14,0x08}, {0x00,0x80,0x60,0x18,0x04,0x0E,0x1F,0x0F,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0xF4,0xFA,0x7D,0x38,0x14,0x08}, {0x00,0x80,0x60,0x18,0x04,0x0E,0x1F,0x0F,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0xF4,0xFA,0x7D,0x38,0x11,0x06}, {0x00,0x80,0x60,0x18,0x04,0x0E,0x1F,0x0F,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0xF0,0xF8,0x7C,0x3A,0x11,0x06}, {0x00,0x80,0x60,0x18,0x04,0x0E,0x1F,0x0F,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00}}
    },
    // 1 TOOL_PASTE_DISPENSER
    {
       {{0x00,0x00,0x00,0x00,0xF8,0x09,0x09,0x0F,0x0F,0x09,0x09,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0xCE,0xFE,0xFE,0xCE,0x02,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x0A,0x0A,0x0E,0x0F,0x09,0x09,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0xE2,0xEE,0xFE,0xFE,0xCE,0x02,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x0A,0x0A,0x0E,0x0E,0x0A,0x0A,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0xE2,0xEE,0xFE,0xFE,0xEE,0xE2,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x09,0x09,0x0F,0x0E,0x0A,0x0A,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0xCE,0xFE,0xFE,0xEE,0xE2,0x03,0x00,0x00,0x00,0x00}}
    },
    // 2 TOOL_LIQUID_DISPENSER
    {
       {{0x00,0x00,0x00,0x00,0xF8,0x09,0x09,0x0F,0x0F,0x09,0x09,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0x4E,0xFE,0xFE,0x4E,0x02,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x0A,0x0A,0x0E,0x0F,0x09,0x09,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0x8E,0xDE,0xFE,0x4E,0x02,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x0A,0x0A,0x0E,0x0E,0x0A,0x0A,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0x8E,0xDE,0x9E,0x0E,0x02,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0xF8,0x09,0x09,0x0F,0x0E,0x0A,0x0A,0xF8,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x02,0x4E,0xFE,0x9E,0x0E,0x02,0x03,0x00,0x00,0x00,0x00}}
    },
    // 3 TOOL_SCREWDRIVER
    {
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0x7C,0x22,0x41,0x41,0x41,0x22,0x1C}, {0x40,0xA0,0x58,0x3C,0x0E,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0x7C,0x22,0x41,0x41,0x41,0x22,0x1C}, {0xA0,0x60,0x58,0x3C,0x0E,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0x7C,0x22,0x41,0xC1,0x41,0x22,0x1C}, {0xA0,0x60,0x68,0x5C,0x0E,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC0,0xE0,0x7C,0x22,0x41,0xC1,0x41,0x22,0x1C}, {0x40,0xA0,0x68,0x5C,0x0E,0x07,0x03,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}}
    },
    // 4 TOOL_VACUUM_PICKUP
    {
       {{0x00,0x00,0x00,0xC0,0xC0,0xC0,0xC0,0xFF,0xFF,0xC0,0xC0,0xC0,0xC0,0x00,0x00,0x00}, {0x00,0x00,0x00,0x01,0x0F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x0F,0x01,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x80,0x80,0x80,0xFF,0xFF,0x80,0x80,0x80,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x03,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x07,0x1F,0x1F,0x1F,0x1F,0x07,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00}}
    },
    // 5 TOOL_DRILL
    {
       {{0x00,0x00,0xFE,0xC2,0xC2,0xC2,0xC2,0xC2,0xC2,0x42,0x42,0x7E,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x04,0xC8,0x10,0x20,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0xFE,0xC2,0xC2,0xC2,0xC2,0xC2,0xC2,0x42,0x42,0x7E,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x00,0x20,0x10,0xC8,0x04,0x02,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0xFE,0xC2,0xC2,0xC2,0xC2,0xC2,0xC2,0x42,0x42,0x7E,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x04,0xC8,0x10,0x20,0x00,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0xFE,0xC2,0xC2,0xC2,0xC2,0xC2,0xC2,0x42,0x42,0x7E,0x00,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x00,0x20,0x10,0xC8,0x04,0x02,0x00,0x00,0x00,0x00,0x00}}
    },
    // 6 TOOL_GRIPPER_GIMBAL - a solid ring with a fixed center
    // pivot and a marker rotating around the OUTSIDE edge of the ring -
    // placed there rather than on the ring itself, where it would be
    // redundant with pixels the ring already sets and wouldn't actually
    // change anything between angles (verified by rendering all 4 frames
    // before committing).
    {
       {{0x00,0xC0,0xF0,0x18,0x0C,0x04,0xC6,0xC6,0xC6,0xC6,0x04,0x0C,0x18,0xF0,0xC0,0x00}, {0x00,0x03,0x0F,0x18,0x30,0x20,0x63,0x63,0x63,0x63,0x20,0x30,0x18,0x0F,0x03,0x01}},
       {{0x00,0xC0,0xF0,0x18,0x0C,0x04,0xC6,0xC6,0xC6,0xC6,0x04,0x0C,0x18,0xF0,0xC0,0x00}, {0x00,0x03,0x0F,0x18,0x30,0x20,0x63,0x63,0xE3,0x63,0x20,0x30,0x18,0x0F,0x03,0x00}},
       {{0x00,0xC0,0xF0,0x18,0x0C,0x04,0xC6,0xC6,0xC6,0xC6,0x04,0x0C,0x18,0xF0,0xC0,0x00}, {0x01,0x03,0x0F,0x18,0x30,0x20,0x63,0x63,0x63,0x63,0x20,0x30,0x18,0x0F,0x03,0x00}},
       {{0x00,0xC0,0xF0,0x18,0x0C,0x04,0xC6,0xC7,0xC6,0xC6,0x04,0x0C,0x18,0xF0,0xC0,0x00}, {0x00,0x03,0x0F,0x18,0x30,0x20,0x63,0x63,0x63,0x63,0x20,0x30,0x18,0x0F,0x03,0x00}}
    },
    // 7 TOOL_GRIPPER_NEMA
    {
       {{0x00,0xC0,0xC0,0xC0,0xC0,0x80,0xBF,0xA1,0xA1,0xBF,0x80,0xC0,0xC0,0xC0,0xC0,0x00}, {0x00,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x00}},
       {{0x00,0x00,0x00,0xC0,0xC0,0xC0,0xFF,0xA1,0xA1,0xBF,0x80,0xC0,0xC0,0xC0,0xC0,0x00}, {0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x78,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x00}},
       {{0x00,0x00,0x00,0xC0,0xC0,0xC0,0xFF,0xA1,0xA1,0xFF,0xC0,0xC0,0xC0,0x00,0x00,0x00}, {0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x78,0x78,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00}},
       {{0x00,0xC0,0xC0,0xC0,0xC0,0x80,0xBF,0xA1,0xA1,0xFF,0xC0,0xC0,0xC0,0x00,0x00,0x00}, {0x00,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x78,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00}}
    },
    // 8 TOOL_AOI_INSPECTION
    {
       {{0x00,0x80,0x40,0x24,0x28,0x90,0x50,0xB0,0xB0,0x50,0x90,0x28,0x24,0x40,0x80,0x00}, {0x00,0x01,0x02,0x04,0x04,0x09,0x0A,0x0D,0x0D,0x0A,0x09,0x04,0x04,0x02,0x01,0x00}},
       {{0x80,0x80,0xC2,0x24,0x28,0x90,0xD0,0xF0,0xB0,0x50,0x90,0x28,0x24,0x40,0x80,0x00}, {0x00,0x01,0x02,0x04,0x04,0x09,0x0B,0x0F,0x0D,0x0A,0x09,0x04,0x04,0x02,0x01,0x00}},
       {{0x80,0x80,0xC2,0x24,0x28,0x90,0xD0,0xF0,0xF0,0xD0,0x90,0x28,0x24,0xC2,0x80,0x80}, {0x00,0x01,0x02,0x04,0x04,0x09,0x0B,0x0F,0x0F,0x0B,0x09,0x04,0x04,0x02,0x01,0x00}},
       {{0x00,0x80,0x40,0x24,0x28,0x90,0x50,0xB0,0xF0,0xD0,0x90,0x28,0x24,0xC2,0x80,0x80}, {0x00,0x01,0x02,0x04,0x04,0x09,0x0A,0x0D,0x0F,0x0B,0x09,0x04,0x04,0x02,0x01,0x00}}
    },
    // 9 TOOL_LASER_ENGRAVER
    {
       {{0x00,0x00,0x00,0x00,0x80,0x60,0x10,0x0C,0x82,0x0C,0x10,0x60,0x80,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x03,0x84,0x58,0xE0,0x58,0x84,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x80,0x60,0xD0,0xEC,0xE2,0x0C,0x10,0x60,0x80,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x80,0x83,0x45,0x5B,0xE0,0x58,0x84,0x03,0x00,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x80,0x60,0xD0,0xEC,0xE2,0xEC,0xD0,0x60,0x80,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x80,0x83,0x45,0x5B,0xE3,0x5B,0x45,0x83,0x80,0x00,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x80,0x60,0x10,0x0C,0x82,0xEC,0xD0,0x60,0x80,0x00,0x00,0x00}, {0x00,0x00,0x00,0x00,0x00,0x03,0x84,0x58,0xE3,0x5B,0x45,0x83,0x80,0x00,0x00,0x00}}
    },
    // 10 TOOL_3D_PRINTER
    {
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x7F,0x7F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00}, {0x00,0x00,0x02,0x8A,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0x8A,0x02,0x00,0x00}},
       {{0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x1F,0x00,0x00,0x00,0x00,0x00,0x00}, {0x00,0x00,0x02,0x8A,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0x8A,0x02,0x00,0x00}},
       {{0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x9F,0xFF,0xFF,0x9F,0x80,0x00,0x00}, {0x00,0x00,0x02,0x8A,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0x8A,0x02,0x00,0x00}},
       {{0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x7F,0xFF,0x9F,0xFF,0xFF,0x9F,0x80,0x00,0x00}, {0x00,0x00,0x02,0x8A,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0x8A,0x02,0x00,0x00}}
    },
    // 11 TOOL_SCAN_PROBE
    {
       {{0x80,0x80,0x80,0xC0,0x20,0x10,0x88,0xCF,0xCF,0x88,0x10,0x20,0xC0,0x80,0x80,0x80}, {0x01,0x01,0x01,0x03,0x04,0x08,0x11,0xF3,0xF3,0x11,0x08,0x04,0x03,0x01,0x01,0x01}},
       {{0x80,0x80,0xC0,0xB0,0x08,0x08,0x84,0xCF,0xCF,0x88,0x10,0x20,0xC0,0x80,0x80,0x80}, {0x01,0x01,0x03,0x0D,0x10,0x10,0x21,0xF3,0xF3,0x11,0x08,0x04,0x03,0x01,0x01,0x01}},
       {{0x80,0x80,0xC0,0xB0,0x08,0x08,0x84,0xCF,0xCF,0x84,0x08,0x08,0xB0,0xC0,0x80,0x80}, {0x01,0x01,0x03,0x0D,0x10,0x10,0x21,0xF3,0xF3,0x21,0x10,0x10,0x0D,0x03,0x01,0x01}},
       {{0x80,0x80,0x80,0xC0,0x20,0x10,0x88,0xCF,0xCF,0x84,0x08,0x08,0xB0,0xC0,0x80,0x80}, {0x01,0x01,0x01,0x03,0x04,0x08,0x11,0xF3,0xF3,0x21,0x10,0x10,0x0D,0x03,0x01,0x01}}
    },
};

