JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// 8x8 CAN activity icon (a single page), blinks in the yellow strip
// every time a new frame arrives on the bus.
static const uint8_t CANIcon[8] = {0x00,0x04,0x14,0xD5,0xD5,0x14,0x04,0x00};

// Large "ERROR" wordmark for the invalid-tool-ID state (TOOL_INVALID),
// built from simple rectangular block letters (E, R, O), 128 columns wide
// x 5 pages (40px) tall, generated programmatically and verified by
// rendering before being embedded here.
static const uint8_t CheckIdJumpersText[2][128] = {
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF8,0x06,0x06,0x06,0x06,0x00,0xFE,0x80,0x80,0x80,0xFE,0x00,0xFE,0x86,0x86,0x86,0x06,0x00,0xF8,0x06,0x06,0x06,0x06,0x00,0xFE,0x80,0x60,0x18,0x06,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x06,0x06,0xFE,0x06,0x06,0x00,0xFE,0x06,0x06,0x06,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x06,0xFE,0x06,0x00,0xFE,0x00,0x00,0x00,0xFE,0x00,0xFE,0x18,0xE0,0x18,0xFE,0x00,0xFE,0x86,0x86,0x86,0x78,0x00,0xFE,0x86,0x86,0x86,0x06,0x00,0xFE,0x86,0x86,0x86,0x78,0x00,0x78,0x86,0x86,0x86,0x06,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x60,0x60,0x60,0x60,0x00,0x7F,0x01,0x01,0x01,0x7F,0x00,0x7F,0x61,0x61,0x61,0x60,0x00,0x1F,0x60,0x60,0x60,0x60,0x00,0x7F,0x01,0x06,0x18,0x60,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x60,0x60,0x7F,0x60,0x60,0x00,0x7F,0x60,0x60,0x60,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x60,0x60,0x1F,0x00,0x00,0x1F,0x60,0x60,0x60,0x1F,0x00,0x7F,0x00,0x01,0x00,0x7F,0x00,0x7F,0x01,0x01,0x01,0x00,0x00,0x7F,0x61,0x61,0x61,0x60,0x00,0x7F,0x01,0x07,0x19,0x60,0x00,0x60,0x61,0x61,0x61,0x1E,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
};

static const uint8_t SplashYellowText[2][128] = {
    {0x00,0x00,0xFE,0xFE,0xFE,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFE,0xFE,0xFE,0x00,0x00,0x00,0xFE,0xFE,0xFE,0x86,0x86,0x86,0x86,0x86,0x86,0x86,0x86,0x86,0x78,0x78,0x78,0x00,0x00,0x00,0x06,0x06,0x06,0x06,0x06,0x06,0xFE,0xFE,0xFE,0x06,0x06,0x06,0x06,0x06,0x06,0x00,0x00,0x00,0xF8,0xF8,0xF8,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x06,0x00,0x00,0x00,0xE0,0x00,0x00,0x00,0x00,0xE0,0xE0,0x00,0x00,0x10,0xF8,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x10,0xF8,0xF8,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0xF0,0x08,0x08,0x08,0x08,0x08,0x10,0x00,0xF8,0x08,0x08,0x08,0x08,0x00},
    {0x00,0x00,0x1F,0x1F,0x1F,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x01,0x01,0x01,0x07,0x07,0x07,0x19,0x19,0x19,0x60,0x60,0x60,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x60,0x00,0x00,0x00,0x03,0x04,0x08,0x08,0x04,0x03,0x03,0x00,0x00,0x08,0x0F,0x0F,0x08,0x00,0x00,0x00,0x00,0x0C,0x0C,0x0C,0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x0F,0x0F,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x08,0x08,0x08,0x08,0x08,0x04,0x00,0x0F,0x08,0x08,0x08,0x0F,0x00},
};

static const uint8_t ErrorText[5][128] = {
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x80,0x80,0x80,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x80,0x80,0x80,0x00,0x00,0x00,0x80,0x80,0x80,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x80,0x80,0x80,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x7C,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x3E,0x3E,0x3E,0x3E,0x3E,0x3E,0x3E,0x3E,0x3E,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x3E,0x3E,0x3E,0xFE,0xFE,0xFE,0x3E,0x3E,0x3E,0x01,0x01,0x01,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x3E,0x3E,0x3E,0xFE,0xFE,0xFE,0x3E,0x3E,0x3E,0x01,0x01,0x01,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x3E,0x3E,0x3E,0xFE,0xFE,0xFE,0x3E,0x3E,0x3E,0x01,0x01,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x07,0x07,0x07,0xF8,0xF8,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x07,0x07,0x07,0xF8,0xF8,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x07,0x07,0x07,0xF8,0xF8,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
};

