JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// WS2812B-via-SPI byte expansion table. Each WS2812B color byte becomes 3
// SPI-transmitted bytes (24 SPI bits): a WS '1' bit -> SPI pattern 110
// (~66% high), a WS '0' bit -> SPI pattern 100 (~33% high), MSB-first,
// matching the standard WS2812B-over-SPI technique. At 2MHz SPI (64MHz/32),
// each SPI bit is 500ns, so each WS bit is 1.5us total - comfortably within
// the WS2812B's tolerance. Generated and verified programmatically (0x00
// and 0xFF spot-checked bit-by-bit) rather than hand-computed, since a single
// wrong bit here would show up as literally every LED color being slightly
// wrong in a way that's hard to trace back to this table.
static const uint8_t ws2812_lut[256][3] = {
    {0x92,0x49,0x24}, {0x92,0x49,0x26}, {0x92,0x49,0x34}, {0x92,0x49,0x36}, {0x92,0x49,0xA4}, {0x92,0x49,0xA6}, {0x92,0x49,0xB4}, {0x92,0x49,0xB6},
    {0x92,0x4D,0x24}, {0x92,0x4D,0x26}, {0x92,0x4D,0x34}, {0x92,0x4D,0x36}, {0x92,0x4D,0xA4}, {0x92,0x4D,0xA6}, {0x92,0x4D,0xB4}, {0x92,0x4D,0xB6},
    {0x92,0x69,0x24}, {0x92,0x69,0x26}, {0x92,0x69,0x34}, {0x92,0x69,0x36}, {0x92,0x69,0xA4}, {0x92,0x69,0xA6}, {0x92,0x69,0xB4}, {0x92,0x69,0xB6},
    {0x92,0x6D,0x24}, {0x92,0x6D,0x26}, {0x92,0x6D,0x34}, {0x92,0x6D,0x36}, {0x92,0x6D,0xA4}, {0x92,0x6D,0xA6}, {0x92,0x6D,0xB4}, {0x92,0x6D,0xB6},
    {0x93,0x49,0x24}, {0x93,0x49,0x26}, {0x93,0x49,0x34}, {0x93,0x49,0x36}, {0x93,0x49,0xA4}, {0x93,0x49,0xA6}, {0x93,0x49,0xB4}, {0x93,0x49,0xB6},
    {0x93,0x4D,0x24}, {0x93,0x4D,0x26}, {0x93,0x4D,0x34}, {0x93,0x4D,0x36}, {0x93,0x4D,0xA4}, {0x93,0x4D,0xA6}, {0x93,0x4D,0xB4}, {0x93,0x4D,0xB6},
    {0x93,0x69,0x24}, {0x93,0x69,0x26}, {0x93,0x69,0x34}, {0x93,0x69,0x36}, {0x93,0x69,0xA4}, {0x93,0x69,0xA6}, {0x93,0x69,0xB4}, {0x93,0x69,0xB6},
    {0x93,0x6D,0x24}, {0x93,0x6D,0x26}, {0x93,0x6D,0x34}, {0x93,0x6D,0x36}, {0x93,0x6D,0xA4}, {0x93,0x6D,0xA6}, {0x93,0x6D,0xB4}, {0x93,0x6D,0xB6},
    {0x9A,0x49,0x24}, {0x9A,0x49,0x26}, {0x9A,0x49,0x34}, {0x9A,0x49,0x36}, {0x9A,0x49,0xA4}, {0x9A,0x49,0xA6}, {0x9A,0x49,0xB4}, {0x9A,0x49,0xB6},
    {0x9A,0x4D,0x24}, {0x9A,0x4D,0x26}, {0x9A,0x4D,0x34}, {0x9A,0x4D,0x36}, {0x9A,0x4D,0xA4}, {0x9A,0x4D,0xA6}, {0x9A,0x4D,0xB4}, {0x9A,0x4D,0xB6},
    {0x9A,0x69,0x24}, {0x9A,0x69,0x26}, {0x9A,0x69,0x34}, {0x9A,0x69,0x36}, {0x9A,0x69,0xA4}, {0x9A,0x69,0xA6}, {0x9A,0x69,0xB4}, {0x9A,0x69,0xB6},
    {0x9A,0x6D,0x24}, {0x9A,0x6D,0x26}, {0x9A,0x6D,0x34}, {0x9A,0x6D,0x36}, {0x9A,0x6D,0xA4}, {0x9A,0x6D,0xA6}, {0x9A,0x6D,0xB4}, {0x9A,0x6D,0xB6},
    {0x9B,0x49,0x24}, {0x9B,0x49,0x26}, {0x9B,0x49,0x34}, {0x9B,0x49,0x36}, {0x9B,0x49,0xA4}, {0x9B,0x49,0xA6}, {0x9B,0x49,0xB4}, {0x9B,0x49,0xB6},
    {0x9B,0x4D,0x24}, {0x9B,0x4D,0x26}, {0x9B,0x4D,0x34}, {0x9B,0x4D,0x36}, {0x9B,0x4D,0xA4}, {0x9B,0x4D,0xA6}, {0x9B,0x4D,0xB4}, {0x9B,0x4D,0xB6},
    {0x9B,0x69,0x24}, {0x9B,0x69,0x26}, {0x9B,0x69,0x34}, {0x9B,0x69,0x36}, {0x9B,0x69,0xA4}, {0x9B,0x69,0xA6}, {0x9B,0x69,0xB4}, {0x9B,0x69,0xB6},
    {0x9B,0x6D,0x24}, {0x9B,0x6D,0x26}, {0x9B,0x6D,0x34}, {0x9B,0x6D,0x36}, {0x9B,0x6D,0xA4}, {0x9B,0x6D,0xA6}, {0x9B,0x6D,0xB4}, {0x9B,0x6D,0xB6},
    {0xD2,0x49,0x24}, {0xD2,0x49,0x26}, {0xD2,0x49,0x34}, {0xD2,0x49,0x36}, {0xD2,0x49,0xA4}, {0xD2,0x49,0xA6}, {0xD2,0x49,0xB4}, {0xD2,0x49,0xB6},
    {0xD2,0x4D,0x24}, {0xD2,0x4D,0x26}, {0xD2,0x4D,0x34}, {0xD2,0x4D,0x36}, {0xD2,0x4D,0xA4}, {0xD2,0x4D,0xA6}, {0xD2,0x4D,0xB4}, {0xD2,0x4D,0xB6},
    {0xD2,0x69,0x24}, {0xD2,0x69,0x26}, {0xD2,0x69,0x34}, {0xD2,0x69,0x36}, {0xD2,0x69,0xA4}, {0xD2,0x69,0xA6}, {0xD2,0x69,0xB4}, {0xD2,0x69,0xB6},
    {0xD2,0x6D,0x24}, {0xD2,0x6D,0x26}, {0xD2,0x6D,0x34}, {0xD2,0x6D,0x36}, {0xD2,0x6D,0xA4}, {0xD2,0x6D,0xA6}, {0xD2,0x6D,0xB4}, {0xD2,0x6D,0xB6},
    {0xD3,0x49,0x24}, {0xD3,0x49,0x26}, {0xD3,0x49,0x34}, {0xD3,0x49,0x36}, {0xD3,0x49,0xA4}, {0xD3,0x49,0xA6}, {0xD3,0x49,0xB4}, {0xD3,0x49,0xB6},
    {0xD3,0x4D,0x24}, {0xD3,0x4D,0x26}, {0xD3,0x4D,0x34}, {0xD3,0x4D,0x36}, {0xD3,0x4D,0xA4}, {0xD3,0x4D,0xA6}, {0xD3,0x4D,0xB4}, {0xD3,0x4D,0xB6},
    {0xD3,0x69,0x24}, {0xD3,0x69,0x26}, {0xD3,0x69,0x34}, {0xD3,0x69,0x36}, {0xD3,0x69,0xA4}, {0xD3,0x69,0xA6}, {0xD3,0x69,0xB4}, {0xD3,0x69,0xB6},
    {0xD3,0x6D,0x24}, {0xD3,0x6D,0x26}, {0xD3,0x6D,0x34}, {0xD3,0x6D,0x36}, {0xD3,0x6D,0xA4}, {0xD3,0x6D,0xA6}, {0xD3,0x6D,0xB4}, {0xD3,0x6D,0xB6},
    {0xDA,0x49,0x24}, {0xDA,0x49,0x26}, {0xDA,0x49,0x34}, {0xDA,0x49,0x36}, {0xDA,0x49,0xA4}, {0xDA,0x49,0xA6}, {0xDA,0x49,0xB4}, {0xDA,0x49,0xB6},
    {0xDA,0x4D,0x24}, {0xDA,0x4D,0x26}, {0xDA,0x4D,0x34}, {0xDA,0x4D,0x36}, {0xDA,0x4D,0xA4}, {0xDA,0x4D,0xA6}, {0xDA,0x4D,0xB4}, {0xDA,0x4D,0xB6},
    {0xDA,0x69,0x24}, {0xDA,0x69,0x26}, {0xDA,0x69,0x34}, {0xDA,0x69,0x36}, {0xDA,0x69,0xA4}, {0xDA,0x69,0xA6}, {0xDA,0x69,0xB4}, {0xDA,0x69,0xB6},
    {0xDA,0x6D,0x24}, {0xDA,0x6D,0x26}, {0xDA,0x6D,0x34}, {0xDA,0x6D,0x36}, {0xDA,0x6D,0xA4}, {0xDA,0x6D,0xA6}, {0xDA,0x6D,0xB4}, {0xDA,0x6D,0xB6},
    {0xDB,0x49,0x24}, {0xDB,0x49,0x26}, {0xDB,0x49,0x34}, {0xDB,0x49,0x36}, {0xDB,0x49,0xA4}, {0xDB,0x49,0xA6}, {0xDB,0x49,0xB4}, {0xDB,0x49,0xB6},
    {0xDB,0x4D,0x24}, {0xDB,0x4D,0x26}, {0xDB,0x4D,0x34}, {0xDB,0x4D,0x36}, {0xDB,0x4D,0xA4}, {0xDB,0x4D,0xA6}, {0xDB,0x4D,0xB4}, {0xDB,0x4D,0xB6},
    {0xDB,0x69,0x24}, {0xDB,0x69,0x26}, {0xDB,0x69,0x34}, {0xDB,0x69,0x36}, {0xDB,0x69,0xA4}, {0xDB,0x69,0xA6}, {0xDB,0x69,0xB4}, {0xDB,0x69,0xB6},
    {0xDB,0x6D,0x24}, {0xDB,0x6D,0x26}, {0xDB,0x6D,0x34}, {0xDB,0x6D,0x36}, {0xDB,0x6D,0xA4}, {0xDB,0x6D,0xA6}, {0xDB,0x6D,0xB4}, {0xDB,0x6D,0xB6}
};

// Draws the ANIMATED 16x16 icon (4 frames, cycled via 'animation_frame')
// of the active tool in the top-right corner of the white area
// (pages 5-6, column 108), without overwriting the telemetry text that
// always lives starting at column 5.
void OLED_DrawToolIcon(uint8_t tool) {
    // ToolIcons[] below only has bitmap art for the original 12 tools
    // (indices 0-11) - none of the 13 new tools (12-24) have their own
    // dedicated animated icon yet, so anything above TOOL_SCAN_PROBE
    // falls back to the soldering iron's icon rather than reading out of
    // bounds. Update this once real icon art exists for the new tools -
    // this is a placeholder, not a bug.
    if (tool > TOOL_SCAN_PROBE) tool = TOOL_SOLDERING_IRON;
    uint8_t buf[16];

