JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
    memcpy(buf, ToolIcons[tool][animation_frame][0], 16);
    OLED_SetCursor(5, 108);
    OLED_WriteData(buf, 16);

    memcpy(buf, ToolIcons[tool][animation_frame][1], 16);
    OLED_SetCursor(6, 108);
    OLED_WriteData(buf, 16);
}

// Top yellow strip (pages 0-1, physical rows 0-15 of the two-tone panel).
// Page 0: CAN activity icon (blinks ~200ms after each RX) + English
// status message. Page 1: live "hero" variable depending on the active
// tool (RPM, temperature, power...). Called on every refresh, even
// during a critical error, so the operator keeps seeing live data.
void OLED_Render_YellowStrip(void) {
    uint8_t buf8[8];
    if (HAL_GetTick() - can_led_tick < 200) {
        memcpy(buf8, CANIcon, 8);
    } else {
        memset(buf8, 0, 8);
    }
    OLED_SetCursor(0, 0);
    OLED_WriteData(buf8, 8);

    const char* status_text;
    switch (active_tool) {
        case TOOL_SOLDERING_IRON:
            status_text = (target_temperature > 0 && current_temperature < target_temperature) ? "HEATING...   " : "READY        ";
            break;
        case TOOL_PASTE_DISPENSER:
        case TOOL_LIQUID_DISPENSER:
            status_text = (steps_remaining > 0) ? "DISPENSING   " : "READY        ";
            break;
        case TOOL_SCREWDRIVER:
            status_text = (steps_remaining > 0) ? "DRIVING      " : "READY        ";
            break;
        case TOOL_SMT_PICKPLACE:
            status_text = (steps_remaining > 0) ? "ROTATING     " : "READY        ";
            break;
        case TOOL_VACUUM_PICKUP:
            status_text = sensor_digital_reading ? "PART PICKED  " : "SEARCHING    ";
            break;
        case TOOL_DRILL:
            status_text = (drill_speed > 0) ? "DRILLING     " : "IDLE         ";
            break;
        case TOOL_GRIPPER_GIMBAL:
        case TOOL_GRIPPER_NEMA:
        case TOOL_VACUUM_GRIPPER_LG:
            status_text = (steps_remaining > 0) ? "GRIPPING     " : "READY        ";
            break;
        case TOOL_AOI_INSPECTION:
            status_text = (aoi_mode == 0x02) ? "SCANNING     " : (aoi_mode == 0x01) ? "LIGHT ON     " : "STANDBY      ";
            break;
        case TOOL_LASER_ENGRAVER:
            status_text = (laser_power_setpoint > 0) ? "ENGRAVING    " : "STANDBY      ";
            break;
        case TOOL_3D_PRINTER:
            status_text = (target_temperature > 0 && current_temperature < target_temperature) ? "HEATING...   " :
                         (steps_remaining > 0) ? "PRINTING     " : "READY        ";
            break;
        case TOOL_SCAN_PROBE:
            status_text = "ARMED        ";
            break;
        default:
            status_text = "STANDBY      ";
            break;
    }
    OLED_PrintStr(0, 10, status_text);

    char hero[24];
    uint8_t hp;
    switch (active_tool) {
        case TOOL_SOLDERING_IRON:
            hp = append_str(hero, "TEMP: ");
            hp += fmt_uint(hero+hp, current_temperature, 3);
            hp += append_str(hero+hp, " C        ");
            hero[hp] = 0;
            break;
        case TOOL_DRILL:
            hp = append_str(hero, "RPM: ");
            hp += fmt_uint(hero+hp, drill_actual_rpm, 5);
            hp += append_str(hero+hp, "          ");
            hero[hp] = 0;
            break;
        case TOOL_LASER_ENGRAVER:
            hp = append_str(hero, "LASER PWR: ");
            hp += fmt_uint(hero+hp, (laser_power_setpoint * 100) / 255, 3);
            hp += append_str(hero+hp, " %     ");
            hero[hp] = 0;
            break;
        case TOOL_3D_PRINTER:
            hp = append_str(hero, "HOTEND: ");
            hp += fmt_uint(hero+hp, current_temperature, 3);
            hp += append_str(hero+hp, " C      ");
            hero[hp] = 0;
            break;
        case TOOL_VACUUM_PICKUP:
            hp = append_str(hero, "VACUUM: ");
            hp += fmt_uint(hero+hp, sensor_analog_reading, 4);
            hp += append_str(hero+hp, "       ");
            hero[hp] = 0;
            break;
        case TOOL_AOI_INSPECTION:
            hp = append_str(hero, "STROBE: ");
            hp += fmt_uint(hero+hp, aoi_strobe_period, 4);
            hp += append_str(hero+hp, "       ");
            hero[hp] = 0;
            break;
        case TOOL_SCAN_PROBE:
            hp = append_str(hero, "HITS: ");
            // Display-only clamp: probe_impact_counter is a uint32_t with no
            // cap anywhere. At 10 digits, "HITS: " (6) + 10 + the 9 trailing
            // spaces below = 25 bytes into this 24-byte buffer - writing the
            // null terminator out of bounds. The real counter is untouched.
            hp += fmt_uint(hero+hp, (probe_impact_counter > 99999) ? 99999 : probe_impact_counter, 5);
            hp += append_str(hero+hp, "         ");
            hero[hp] = 0;
            break;
        default:
            hp = append_str(hero, "STEPS: ");
            hp += fmt_uint(hero+hp, (steps_remaining > 99999) ? 99999 : steps_remaining, 5);
            hp += append_str(hero+hp, "        ");
            hero[hp] = 0;
            break;
    }
    OLED_PrintStr(1, 0, hero);
}

// JuanenBOT boot logo + emblem + "U R T C", 128x40 (pages 0-4).
// Simple 4-frame robot-arm silhouette (base + articulated forearm + small
// gripper), animated during the splash screen (page 5, between the logo
// above and the version/date text below). Purely geometric/original -
// not based on any specific existing robot design.
// 4-frame animated JuanenBOT face (antenna wobble, blinking eyes, talking
// mouth) alongside the "JuanenBOT" wordmark, both living entirely in the
// white area of the OLED (below the yellow strip) - simple geometric shapes
// for the face, and the same "JuanenBOT" typography already used elsewhere
// in this file, just re-cropped and repositioned. 5 pages x 128 columns per
// frame, matching this screen's white region exactly (pages 2-6).
static const uint8_t SplashFace[4][5][128] = {
    { // frame 0
        {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x7F,0x7F,0x0F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0xFC,0xFC,0xFC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x00,0xE0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x30,0x30,0xF0,0xF0,0xF0,0x30,0x30,0x30,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0xFF,0xFF,0xFF,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x9E,0xDF,0xDF,0x63,0x63,0x23,0xFF,0xFF,0xFE,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFE,0xFF,0xFF,0x33,0x33,0xBF,0xBF,0xBE,0x00,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFF,0xFF,0xFF,0x18,0x18,0xFF,0xFF,0xE7,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xE0,0xE0,0xE0,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE0,0xE0,0xE0,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x07,0x0F,0x0F,0x0C,0x04,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x04,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x00,0x00},
    },
    { // frame 1
        {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x7F,0x7F,0x0F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0xFC,0xFC,0xFC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x00,0xE0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x30,0x30,0xF0,0xF0,0xF0,0x30,0x30,0x30,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0xFF,0xFF,0xFF,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x9E,0xDF,0xDF,0x63,0x63,0x23,0xFF,0xFF,0xFE,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFE,0xFF,0xFF,0x33,0x33,0xBF,0xBF,0xBE,0x00,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFF,0xFF,0xFF,0x18,0x18,0xFF,0xFF,0xE7,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xE0,0xE0,0xE0,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE0,0xE0,0xE0,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x07,0x0F,0x0F,0x0C,0x04,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x04,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x00,0x00},
    },
    { // frame 2
        {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x7F,0x7F,0x0F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0xFC,0xFC,0xFC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x00,0x00,0x00,0x00,0x00,0x00,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x00,0xE0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x30,0x30,0xF0,0xF0,0xF0,0x30,0x30,0x30,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0xFF,0xFF,0xFF,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x9E,0xDF,0xDF,0x63,0x63,0x23,0xFF,0xFF,0xFE,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFE,0xFF,0xFF,0x33,0x33,0xBF,0xBF,0xBE,0x00,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFF,0xFF,0xFF,0x18,0x18,0xFF,0xFF,0xE7,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xE0,0xE0,0xE0,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE1,0xE0,0xE0,0xE0,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x07,0x0F,0x0F,0x0C,0x04,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x04,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x00,0x00},
    },
    { // frame 3
        {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x7F,0x7F,0x0F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0xFC,0xFC,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0xFC,0xFC,0xFC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x7F,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x00,0xE0,0xF0,0xF0,0x30,0x30,0xF0,0xF0,0xE0,0x00,0x30,0x30,0xF0,0xF0,0xF0,0x30,0x30,0x30,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0xFF,0xFF,0xFF,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x9E,0xDF,0xDF,0x63,0x63,0x23,0xFF,0xFF,0xFE,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFE,0xFF,0xFF,0x33,0x33,0xBF,0xBF,0xBE,0x00,0xFF,0xFF,0xFF,0x02,0x03,0xFF,0xFF,0xFE,0x00,0x00,0xFF,0xFF,0xFF,0x18,0x18,0xFF,0xFF,0xE7,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00},
        {0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xE0,0xE0,0xE0,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE3,0xE0,0xE0,0xE0,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x07,0x0F,0x0F,0x0C,0x04,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x04,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x0F,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x07,0x0F,0x0F,0x0C,0x0C,0x0F,0x0F,0x07,0x00,0x00,0x00,0x0F,0x0F,0x0F,0x00,0x00,0x00,0x00},
    },
};;


