JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
void Render_SplashScreen(uint8_t face_frame) {
    uint8_t buf[128];
    for(uint8_t p=0; p<8; p++) OLED_ClearPage(p);

    // Yellow strip (pages 0-1, 16px): URTC big and centered, firmware
    // version smaller alongside it - both baked into one bitmap so they sit
    // together cleanly rather than as separate small OLED_PrintStr calls.
    for (uint8_t p = 0; p < 2; p++) {
        memcpy(buf, SplashYellowText[p], 128);
        OLED_SetCursor(p, 0);
        OLED_WriteData(buf, 128);
    }

    // White area (pages 2-6, 40px): animated JuanenBOT face on the left,
    // the "JuanenBOT" wordmark on the right - both live entirely within the
    // white region now. Page 7 is left blank as a small bottom margin.
    if (face_frame > 3) face_frame = 0;
    for (uint8_t p = 0; p < 5; p++) {
        memcpy(buf, SplashFace[face_frame][p], 128);
        OLED_SetCursor(p + 2, 0);
        OLED_WriteData(buf, 128);
    }
}

void Process_OLED_NightModeChange(void) {
    oled_mode_pending_flag = 0;
    oled_night_mode = oled_night_mode_cmd;
    if (oled_night_mode == 0x01) {
        // Explicitly wakes the display (0xAF) before setting contrast -
        // contrast alone has no effect if the display is currently asleep
        // (put there via 0x0F, which sends only 0xAE). Harmless when
        // already on; the SSD1306 tolerates a redundant 0xAF.
        OLED_WriteCmd(0xAF);
        OLED_WriteCmd(0x81); OLED_WriteCmd(0x0F); 
    }
    else if (oled_night_mode == 0x0F) {
        OLED_WriteCmd(0xAE); 
    }
    else {
        OLED_WriteCmd(0xAE);
        OLED_WriteCmd(0x81); OLED_WriteCmd(0xCF); 
        OLED_WriteCmd(0xAF); 
    }
}

void Render_ToolScreen(void) {
    char txt[24];

    // Dedicated path for "no recognized tool head" (IDs 12-15) - checked
    // before the generic error message and before the normal yellow strip,
    // since there's no live CAN/tool data to show for this state, and it
    // deserves its own clear identity rather than looking like a generic
    // fault on a tool that IS actually connected.
    if (active_tool == TOOL_INVALID) {
        // Yellow strip (pages 0-1): just the big "CHECK ID JUMPERS" text,
        // filling the strip - dropped the "URTC - NO TOOL" line per feedback.
        for (uint8_t p = 0; p < 2; p++) {
            uint8_t ybuf[128];
            memcpy(ybuf, CheckIdJumpersText[p], 128);
            OLED_SetCursor(p, 0);
            OLED_WriteData(ybuf, 128);
        }
        for (uint8_t page = 2; page < 8; page++) OLED_ClearPage(page);
        // White area: nothing but the big blinking ERROR wordmark. Blink:
        // alternate on/off using the same animation_frame the tool icons
        // use (0-3) - checking evenness keeps a clean on/off blink (2 frames
        // on, 2 frames off, ~900ms per half-cycle) rather than a 3-on/1-off skew.
        for (uint8_t page = 2; page <= 6; page++) {
            uint8_t buf[128];
            if (animation_frame % 2 == 0) {
                memcpy(buf, ErrorText[page - 2], 128);
            } else {
                memset(buf, 0, 128);
            }
            OLED_SetCursor(page, 0);
            OLED_WriteData(buf, 128);
        }
        OLED_PrintStr(7, 4, "CHECK ID JUMPERS");
        return;
    }

    OLED_Render_YellowStrip(); // yellow strip (CAN + hero) always refreshes

    if (system_error_flag) {
        OLED_PrintStr(2, 10, "[ CRITICAL ERROR ]");
        OLED_PrintStr(3, 10, " SYSTEM BLOCKED ");
        return;
    }
    
    switch(active_tool) {
        case TOOL_SOLDERING_IRON:           OLED_PrintStr(2, 16, "T12 SOLDER IRON"); break;
        case TOOL_PASTE_DISPENSER:  OLED_PrintStr(2, 16, "PASTE DISPENSER"); break;
        case TOOL_LIQUID_DISPENSER:    OLED_PrintStr(2, 16, "LIQUID DISPENSR"); break;
        case TOOL_SCREWDRIVER:     OLED_PrintStr(2, 16, "SCREWDRIVER    "); break;
        case TOOL_VACUUM_PICKUP:            OLED_PrintStr(2, 16, "VACUUM PICKUP  "); break;
        case TOOL_DRILL:            OLED_PrintStr(2, 16, "DRILL BL4260   "); break;
        case TOOL_GRIPPER_GIMBAL:     OLED_PrintStr(2, 16, "GRIPPER GIMBAL "); break;
        case TOOL_GRIPPER_NEMA:       OLED_PrintStr(2, 16, "GRIPPER NEMA 14"); break;
        case TOOL_VACUUM_GRIPPER_LG:  OLED_PrintStr(2, 16, "VACUUM GRIP LG "); break;
        case TOOL_SMT_PICKPLACE:      OLED_PrintStr(2, 16, "SMT PICK&PLACE "); break;
        case TOOL_AOI_INSPECTION:     OLED_PrintStr(2, 16, "AOI INSPECTION "); break;
        case TOOL_LASER_ENGRAVER:     OLED_PrintStr(2, 16, "LASER DIODE 10W"); break;
        case TOOL_3D_PRINTER:       OLED_PrintStr(2, 16, "3D PRINTER  V4 "); break;
        case TOOL_SCAN_PROBE:      OLED_PrintStr(2, 16, "SCAN PROBE     "); break;
        default: break; // TOOL_INVALID never reaches here - caught by the early return above
    }
    
    OLED_PrintStr(3, 0, "--------------------");
    
    uint8_t tp;
    switch(active_tool) {
        case TOOL_SOLDERING_IRON: {
            // Same defensive display-only clamp as the 3D printer's
            // identical NOZZLE: line below - target_temperature is a
            // uint16_t set directly from CAN bytes (0x130), and this
            // doesn't touch the real value (Control_SolderingIron_PID's
            // own 450C safety ceiling already corrects that within 20ms).
            uint16_t display_target_temp = (target_temperature > 999) ? 999 : target_temperature;
            tp = append_str(txt, "TEMP: ");
            tp += fmt_uint(txt+tp, current_temperature, 3);
            tp += append_str(txt+tp, "/");
            tp += fmt_uint(txt+tp, display_target_temp, 3);
            tp += append_str(txt+tp, " C");
            txt[tp] = 0;
            OLED_PrintStr(5, 5, txt);
            OLED_PrintStr(6, 5, endstop_triggered ? "ENDSTOP: HIT  " : "ENDSTOP: OPEN ");
            OLED_DrawHorizontalBar(7, 5, 85, (current_temperature * 100) / 450);
            OLED_DrawToolIcon(TOOL_SOLDERING_IRON);
            break;
        }
        case TOOL_PASTE_DISPENSER:
        case TOOL_LIQUID_DISPENSER:
        case TOOL_SCREWDRIVER:
        case TOOL_GRIPPER_GIMBAL:
        case TOOL_GRIPPER_NEMA:
        case TOOL_SMT_PICKPLACE:
        case TOOL_VACUUM_GRIPPER_LG: {
            __disable_irq();
            uint32_t steps_rem_snapshot = steps_remaining;
            uint32_t steps_total_snapshot = total_steps_setpoint;
            __enable_irq();
            if (steps_rem_snapshot > 0) {
                // Display-only clamp: steps_remaining comes straight from an
                // unvalidated 32-bit CAN payload with nothing capping it. A
                // very large value (up to 10 digits) would overflow this
                // line's ~17-character budget before the icon column at
                // pixel 108, corrupting it. Only the displayed copy is
                // clamped - the real steps_remaining below (used by the step
                // ISR) is untouched, so a genuinely long move still runs correctly.
                uint32_t steps_display = (steps_rem_snapshot > 99999) ? 99999 : steps_rem_snapshot;
                tp = append_str(txt, "STEPS REM: ");
                tp += fmt_uint(txt+tp, steps_display, 5);
                txt[tp] = 0;
                OLED_PrintStr(5, 5, txt);
                uint8_t pct = (steps_total_snapshot > 0)
                    ? 100 - (uint8_t)(((uint64_t)steps_rem_snapshot * 100) / steps_total_snapshot)
                    : 0; // defensive: steps_total_snapshot and steps_rem_snapshot are only ever
                         // set together by the same command handler, so this shouldn't be
                         // reachable, but a zero-cost guard removes any doubt rather than relying on that.
                OLED_DrawHorizontalBar(7, 5, 85, pct);
            } else {
                OLED_PrintStr(5, 5, "STATUS: READY");
                OLED_DrawHorizontalBar(7, 5, 85, 100);
            }
            OLED_DrawToolIcon(active_tool); // each of the 5 tools' own icon
            break;
        }
        case TOOL_VACUUM_PICKUP:
            tp = append_str(txt, "VACUUM ADC: ");
            tp += fmt_uint(txt+tp, sensor_analog_reading, 3);
            txt[tp] = 0;
            OLED_PrintStr(5, 5, txt);
            tp = append_str(txt, "OBJ: ");
            tp += append_str(txt+tp, (sensor_digital_reading) ? "OK" : "FILL");
            txt[tp] = 0;
            OLED_PrintStr(7, 5, txt);
            OLED_DrawToolIcon(TOOL_VACUUM_PICKUP);
            break;
        case TOOL_DRILL:
            tp = append_str(txt, "REAL RPM: ");
            tp += fmt_uint(txt+tp, drill_actual_rpm, 5);
            txt[tp] = 0;
            OLED_PrintStr(5, 5, txt);
            OLED_PrintStr(6, 5, endstop_triggered ? "ENDSTOP: HIT  " : "ENDSTOP: OPEN ");
            tp = append_str(txt, "SETPOINT: ");
            tp += fmt_uint(txt+tp, drill_speed, 3);
            tp += append_str(txt+tp, "%");
            txt[tp] = 0;
            OLED_PrintStr(7, 5, txt);
            OLED_DrawToolIcon(TOOL_DRILL);
            break;
        case TOOL_LASER_ENGRAVER:
            tp = append_str(txt, "POWER:    ");
            tp += fmt_uint(txt+tp, laser_power_setpoint, 3);
            tp += append_str(txt+tp, "%");
            txt[tp] = 0;
            OLED_PrintStr(5, 5, txt);
            OLED_PrintStr(6, 5, endstop_triggered ? "ENDSTOP: HIT  " : "ENDSTOP: OPEN ");
            OLED_DrawHorizontalBar(7, 5, 85, (laser_power_setpoint * 100) / 255);
            OLED_DrawToolIcon(TOOL_LASER_ENGRAVER);
            break;
        case TOOL_3D_PRINTER: {
            // Defensive clamp for display purposes only - doesn't touch
            // the real target_temperature (Control_SolderingIron_PID's own
            // 450C safety ceiling already corrects that within 20ms of a
            // bad value arriving). This just protects THIS fixed-width
            // line from the brief window before that correction lands,
            // since target_temperature is a uint16_t set directly from
            // CAN bytes and could otherwise be far more than 3 digits.
            uint16_t display_target_temp = (target_temperature > 999) ? 999 : target_temperature;
            tp = append_str(txt, "NOZZLE:");
            tp += fmt_uint(txt+tp, current_temperature, 3);
            tp += append_str(txt+tp, "/");
            tp += fmt_uint(txt+tp, display_target_temp, 3);
            tp += append_str(txt+tp, "C");
            txt[tp] = 0;
            OLED_PrintStr(5, 5, txt);
            tp = append_str(txt, "LFAN:");
            tp += fmt_uint(txt+tp, (layer_fan_duty * 100) / 255, 3);
            tp += append_str(txt+tp, "%");
            tp += fmt_uint(txt+tp, layer_fan_actual_rpm, 4);
            tp += append_str(txt+tp, "RPM");
            txt[tp] = 0;
            OLED_PrintStr(6, 5, txt);
            tp = append_str(txt, "HFAN:");
            tp += fmt_uint(txt+tp, (hotend_fan_duty * 100) / 255, 3);
            tp += append_str(txt+tp, "%");
            tp += fmt_uint(txt+tp, hotend_fan_actual_rpm, 4);
            tp += append_str(txt+tp, "RPM");
            txt[tp] = 0;
            OLED_PrintStr(7, 5, txt);
            OLED_DrawToolIcon(TOOL_3D_PRINTER);
            break;
        }
        case TOOL_AOI_INSPECTION: {
            const char* mode_text = (aoi_mode == 0x01) ? "LIGHT: FIXED  " :
                                   (aoi_mode == 0x02) ? "LIGHT: STROBE " :
                                                         "LIGHT: OFF    ";
            OLED_PrintStr(5, 5, mode_text);
            OLED_PrintStr(6, 5, endstop_triggered ? "ENDSTOP: HIT  " : "ENDSTOP: OPEN ");
            tp = append_str(txt, "PERIOD: ");
            tp += fmt_uint(txt+tp, aoi_strobe_period, 4);
            txt[tp] = 0;
            OLED_PrintStr(7, 5, txt);
            OLED_DrawToolIcon(TOOL_AOI_INSPECTION);
            break;
        }
        case TOOL_SCAN_PROBE:
            OLED_PrintStr(5, 5, "STATUS: ARMED ");
            tp = append_str(txt, "IMPACTS:  ");
            // Display-only clamp, same reasoning as the other
            // probe_impact_counter display above: a uint32_t with no cap
            // anywhere could otherwise write more digits than this
            // 24-byte buffer has room for. The real counter is untouched.
            tp += fmt_uint(txt+tp, (probe_impact_counter > 99999) ? 99999 : probe_impact_counter, 5);
            txt[tp] = 0;
            OLED_PrintStr(7, 5, txt);
            OLED_DrawToolIcon(TOOL_SCAN_PROBE);
            break;
        default:
            OLED_PrintStr(5, 10, "BUS CAN ONLINE");
            break;
    }
}

