JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// =============================================================================
// 5. WS2812B LED EMULATION DRIVER (STATUS LED DMA / RING LED BIT-BANG)
// =============================================================================
// 5. WS2812B LED DRIVER (SPI1 + DMA, PA7/MOSI) - drives BOTH the status LED
//    and the ring in a single transfer, replacing the previous bit-banged
//    approach entirely now that PA7 is free to carry SPI1 instead of PWM.
// =============================================================================
uint8_t led_spi_buffer[200];

// CONN_LED1 (status, 1 pixel) via SPI1+DMA on PA7 - kept independent from the
// ring below rather than combined into one chain, specifically so CONN_LED1
// and CONN_LED2 don't need a new PCB trace joining them in series. This
// pixel's data volume is tiny (9 SPI bytes + reset), so there's little to
// gain from moving it into a shared transfer anyway.
// Automatic status LED coloring (CONN_LED1) - runs every main loop
// iteration, just before the color actually gets sent out. Three-way
// priority: a hardware fault always wins over everything else; a recent
// host-sent CAN 0x100 color takes the next priority and is left alone;
// otherwise the board colors itself blue (CAN traffic within the last
// 1.5s - "actively functioning/communicating") or green (nothing that
// recent - "idle, waiting for commands").
void Update_StatusLED_AutoColor(void) {
    uint8_t prev_r = led_state_pixel.R, prev_g = led_state_pixel.G, prev_b = led_state_pixel.B;

    if (system_error_flag) {
        led_state_pixel.R = 255; led_state_pixel.G = 0; led_state_pixel.B = 0;
        led_host_override_active = 0; // a fault clearing shouldn't snap back
                                       // to a stale host color from before it
    } else if (led_host_override_active &&
               (int32_t)(HAL_GetTick() - led_host_override_expire_tick) < 0) {
        // still within the held window - leave the host's color alone
    } else {
        led_host_override_active = 0; // expired, or was never active
        if (HAL_GetTick() - can_led_tick < LED_FUNCTIONING_WINDOW_MS) {
            led_state_pixel.R = 0; led_state_pixel.G = 0; led_state_pixel.B = 255;
        } else {
            led_state_pixel.R = 0; led_state_pixel.G = 255; led_state_pixel.B = 0;
        }
    }

    // Only ask for an actual SPI transmission if the color genuinely
    // changed - this runs every main loop iteration (it has to, since the
    // blue/green split depends on elapsed time), but re-sending the same
    // three bytes every iteration would be pointless traffic on the SPI/DMA
    // link and could fight with the busy-check in Update_StatusLED_SPI_DMA.
    if (led_state_pixel.R != prev_r || led_state_pixel.G != prev_g || led_state_pixel.B != prev_b) {
        update_led_ring_flag = 1;
    }
}

uint8_t Update_StatusLED_SPI_DMA(void) {
    if (HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY) return 0;

    uint32_t idx = 0;
    memcpy(&led_spi_buffer[idx], ws2812_lut[led_state_pixel.G], 3); idx += 3;
    memcpy(&led_spi_buffer[idx], ws2812_lut[led_state_pixel.R], 3); idx += 3;
    memcpy(&led_spi_buffer[idx], ws2812_lut[led_state_pixel.B], 3); idx += 3;
    memset(&led_spi_buffer[idx], 0x00, 100); // reset/latch, same reasoning as before
    idx += 100;

    HAL_SPI_Transmit_DMA(&hspi1, led_spi_buffer, idx);
    return 1;
}

// CONN_LED2 (ring, 8 pixels) - back to bit-banging on PB1, independent of
// CONN_LED1/PA7. Same technique used throughout this project before the
// SPI/DMA redesign: NOPs tuned for this core's 64MHz clock (15.625ns/cycle),
// LOW-phase NOPs and the trailing latch delay both included from the start
// this time (rather than as later patches), and the color captured once,
// atomically, before the pixel loop.
void Update_RingLEDs_BitBang(void) {
    __disable_irq();
    for (uint8_t p = 0; p < 8; p++) {
        uint8_t g = ring_pixels[p].G, r = ring_pixels[p].R, b = ring_pixels[p].B;
        for (int8_t i = 7; i >= 0; i--) {
            if (g & (1 << i)) {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            } else {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            }
        }
        for (int8_t i = 7; i >= 0; i--) {
            if (r & (1 << i)) {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            } else {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            }
        }
        for (int8_t i = 7; i >= 0; i--) {
            if (b & (1 << i)) {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            } else {
                GPIOB->BSRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
                GPIOB->BRR = LED_RING_PIN;
                __asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");__asm__("nop");
            }
        }
    }
    // Reset/latch delay, re-enabled before it since the electrical hold
    // doesn't need cycle-precise timing the way bit transmission does -
    // matches the reasoning already used elsewhere in this file.
    __enable_irq();
    for (volatile uint32_t w = 0; w < 4000; w++);
}

// Bit-banged SPI transfer for CONN_EXPANSION's EXP_SPI_* pins - see the pin
// definitions above and PINOUT_CONNECTORS.TXT's CONN_EXPANSION note for why
// this is software-timed rather than a hardware SPI peripheral.
//
// Implements SPI Mode 3 (CPOL=1, CPHA=1) specifically - confirmed against
// the TMC5160/TMC5160A datasheet's own SPI Interface section (section 4.2:
// "the node latching the data from SDI on the rising edge of SCK and
// driving data to SDO following the falling edge... Hint: Usually this SPI
// timing is referred to as SPI MODE 3"), not assumed. Getting this wrong
// wouldn't cause a hard fault or an obviously broken symptom - it would
// just silently fail to communicate, or read back garbage that looks
// plausible enough to be confusing. Clock idles HIGH between transfers,
// matching Mode 3 - the caller is responsible for asserting EXP_SPI_CS_PIN
// low before the first byte of a transaction and releasing it high after
// the last one; this function only handles the 8-bit shift itself.
//
// Timing is intentionally not cycle-counted the way the WS2812B driver
// above is - unlike WS2812B's protocol-defined bit timing, SPI is
// edge-triggered rather than time-triggered: the slave samples relative to
// the clock edges this function generates, not against a wall-clock
// deadline, so a plain small delay between edges (not a precise one) is
// sufficient and correct.
static void ExpansionSPI_Delay(void) {
    for (volatile uint32_t d = 0; d < 20; d++);
}

