JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
uint8_t ExpansionSPI_TransferByte(uint8_t tx_byte) {
    uint8_t rx_byte = 0;
    for (int8_t i = 7; i >= 0; i--) {
        // Setup: drive the next output bit while SCK is still high (idle)
        // from the previous iteration (or CS assertion, for the first bit) -
        // matches Mode 3's "data changes on the falling edge" by having the
        // new value already stable before that edge happens below.
        if (tx_byte & (1 << i)) {
            HAL_GPIO_WritePin(EXP_SPI_MOSI_PORT, EXP_SPI_MOSI_PIN, GPIO_PIN_SET);
        } else {
            HAL_GPIO_WritePin(EXP_SPI_MOSI_PORT, EXP_SPI_MOSI_PIN, GPIO_PIN_RESET);
        }
        HAL_GPIO_WritePin(EXP_SPI_SCK_PORT, EXP_SPI_SCK_PIN, GPIO_PIN_RESET); // falling edge
        ExpansionSPI_Delay();
        HAL_GPIO_WritePin(EXP_SPI_SCK_PORT, EXP_SPI_SCK_PIN, GPIO_PIN_SET); // rising edge - sample here
        rx_byte <<= 1;
        if (HAL_GPIO_ReadPin(EXP_SPI_MISO_PORT, EXP_SPI_MISO_PIN) == GPIO_PIN_SET) {
            rx_byte |= 0x01;
        }
        ExpansionSPI_Delay();
    }
    return rx_byte;
}

void MX_ExpansionSPI_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // CS idles high (deselected) - set before configuring as output so
    // there's never a glitch low, even momentarily, during setup.
    HAL_GPIO_WritePin(EXP_SPI_CS_PORT, EXP_SPI_CS_PIN, GPIO_PIN_SET);
    // SCK idles high, matching Mode 3.
    HAL_GPIO_WritePin(EXP_SPI_SCK_PORT, EXP_SPI_SCK_PIN, GPIO_PIN_SET);

    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    GPIO_InitStruct.Pin = EXP_SPI_CS_PIN;
    HAL_GPIO_Init(EXP_SPI_CS_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = EXP_SPI_SCK_PIN;
    HAL_GPIO_Init(EXP_SPI_SCK_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = EXP_SPI_MOSI_PIN;
    HAL_GPIO_Init(EXP_SPI_MOSI_PORT, &GPIO_InitStruct);

    // MISO is the only input of the four - pulled up so an expansion board
    // that isn't actually populated yet (or a chip in reset/unpowered)
    // reads back a stable, known 0xFF pattern rather than a floating,
    // noise-sensitive line.
    GPIO_InitStruct.Pin = EXP_SPI_MISO_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(EXP_SPI_MISO_PORT, &GPIO_InitStruct);

    // TMC_DIAG0 - plain input, no internal pull. The board now has a real
    // external pull-down (R50, 10K) as part of the diode-OR combining this
    // with the onboard TMC2209's own DIAG - enabling the MCU's internal
    // pull-up here as well would fight that external pull-down and leave
    // the idle level ambiguous instead of a clean, unambiguous low. See
    // this pin's own #define comment for the full topology.
    GPIO_InitStruct.Pin = TMC_DIAG0_PIN;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(TMC_DIAG0_PORT, &GPIO_InitStruct);
}


// =============================================================================
// 6. SAFE PID THERMAL CONTROL LOOPS (PHYSICAL LIMIT INCLUDED)
// =============================================================================
void Control_SolderingIron_PID(void) {
    if (active_tool != TOOL_SOLDERING_IRON && active_tool != TOOL_HOTAIR_REWORK) return;

    // The T12 cartridge routes its heater current and its internal
    // thermocouple through the same two conductors. Force the heater off
    // and give the line a brief settling window before sampling - reading
    // while it's still on (e.g. left on from the previous 20ms cycle's
    // decision) would sample the 24V switching transient instead of the
    // thermocouple's real microvolt-level signal. The bang-bang decision
    // below turns it back on immediately if still needed; the tip's own
    // thermal mass is large relative to this brief window.
    HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET);
    for (volatile uint32_t settle = 0; settle < 640; settle++); // ~10us @ 64MHz

    // AD8605 thermocouple ADC reading
    HAL_ADC_Start(&hadc);
    // 2ms timeout, not 10ms: a healthy conversion completes in
    // microseconds at any reasonable clock config, so this only ever
    // actually waits the full duration when something's already wrong -
    // bounding it tighter limits how long a stuck ADC can stall the rest
    // of this 20ms-cyclic block (watchdogs included) before either
    // succeeding or falling through to the fault handling below.
    if (HAL_ADC_PollForConversion(&hadc, 2) == HAL_OK) {
        uint32_t adc_val = HAL_ADC_GetValue(&hadc);
        // Same fault-detection philosophy as the hotend NTC below: a failed
        // amplifier or an open/shorted thermocouple typically pins the ADC
        // reading near one rail (~0 or ~4095), not somewhere in the middle
        // of the working range. Catch that instead of computing and trusting
        // a bogus temperature from it.
        if (adc_val > 15 && adc_val < 4090) { // see the hotend NTC section below for why 4090, not 4080
            current_temperature = (uint16_t)(((adc_val * 450) + 2047) / 4095); // Mapped to 450C max, rounded to nearest degree
        } else {
            system_error_flag = 1;
        }
    } else {
        // A conversion that can't complete even within this 2ms budget is
        // exactly as untrustworthy as one that comes back out of range -
        // raising the fault here (rather than leaving current_temperature
        // frozen at its last value) keeps the heater from running off a
        // stale reading with no indication anything's wrong.
        system_error_flag = 1;
    }
    HAL_ADC_Stop(&hadc);

    // Strict independent safety ceiling to mitigate catastrophic thermal-runaway risk.
    // 445, not 450: the ADC range guard above caps current_temperature's own
    // max representable value at 449 (adc_val must stay below 4090 to be
    // trusted at all - see that guard's own comment). The bang-bang shutoff
    // below only fires once current_temperature exceeds target_temperature+2,
    // so a target sitting right at 450 would leave that condition
    // (449 > 452) permanently unsatisfiable - the heater reaching its own
    // measurable ceiling with no way to command itself off. 445 leaves the
    // shutoff condition (up to 447) comfortably below what can actually be
    // measured.
    if (target_temperature > 445) {
        target_temperature = 0;
        system_error_flag = 1;
    }

    if (system_error_flag) {
        HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET);
        return;
    }

    // Stuck-heater detection: a MOSFET or SSR that's fused/shorted from
    // thermal stress keeps conducting regardless of what this GPIO
    // commands - a real, known power-semiconductor failure mode. If the
    // output's been continuously off for 3s yet temperature keeps rising
    // instead of leveling off or falling, that's consistent with exactly
    // that, well before the absolute 450C ceiling below would catch it.
    // This adds earlier warning on top of that ceiling, not instead of it -
    // if the power stage is genuinely fused, cutting this signal can't
    // actually help either way; a real fix needs an independent hardware
    // cutoff downstream of this GPIO, which this alone can't provide.
    static uint8_t heater_on = 0;
    static uint32_t t12_pwm_off_since = 0;
    static uint16_t t12_temp_at_off = 0;
    if (heater_on) {
        t12_pwm_off_since = 0;
    } else {
        if (t12_pwm_off_since == 0) {
            t12_pwm_off_since = HAL_GetTick();
            t12_temp_at_off = current_temperature;
        } else if (HAL_GetTick() - t12_pwm_off_since > 3000 &&
                   current_temperature > t12_temp_at_off + 5) {
            system_error_flag = 1;
            HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET);
            return;
        }
    }

