JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// =============================================================================
// 7. SECONDARY DYNAMIC TELEMETRY AND SENSING SUBSYSTEM
// =============================================================================
void Control_SensorTelemetry(void) {
    if (active_tool != TOOL_VACUUM_PICKUP) return;
    
    // TCRT5000 analog phototransistor reading on Channel 11 (PB0). 2ms
    // timeout, matching the same shared ADC's own soldering-iron read
    // elsewhere in this firmware - a healthy conversion completes in
    // microseconds, so this only ever actually waits the full duration
    // when something's already wrong.
    HAL_ADC_Start(&hadc);
    if(HAL_ADC_PollForConversion(&hadc, 2) == HAL_OK) {
        sensor_analog_reading = HAL_ADC_GetValue(&hadc);
    }
    HAL_ADC_Stop(&hadc);
    
    // LM393 digital input on PB3
    sensor_digital_reading = HAL_GPIO_ReadPin(GPIOB, TCRT_D0_DIG_PIN);
}

// Generic endstop/limit switch, active low. Shares PB3 with the tools
// above, but only makes sense for the 4 that don't already use that pin for
// something else - reconfigured as a plain input for exactly these 4 in main().
void Control_EndstopTelemetry(void) {
    if (active_tool != TOOL_SOLDERING_IRON && active_tool != TOOL_DRILL &&
        active_tool != TOOL_LASER_ENGRAVER && active_tool != TOOL_AOI_INSPECTION) return;

    // Debounced the same way the scan probe's own EXTI handler already is
    // (see HAL_GPIO_EXTI_Callback above) - a mechanical limit switch
    // genuinely bounces, and this is a periodically-polled telemetry
    // value rather than an interrupt, so the equivalent protection here
    // is requiring 2 consecutive matching reads before committing to a
    // new state, rather than a time-based suppression window. This
    // function runs often enough that the extra read adds negligible
    // lag to a telemetry-only value - nothing here gates an actual
    // safety cutoff on this debounce.
    static uint8_t last_raw_reading = 0xFF;  // sentinel - never a valid 0/1 reading, guarantees the first call never matches
    uint8_t raw_reading = (HAL_GPIO_ReadPin(GPIOB, TOUCH_IN_PIN) == GPIO_PIN_RESET) ? 1 : 0;
    if (raw_reading == last_raw_reading) {
        endstop_triggered = raw_reading;
    }
    last_raw_reading = raw_reading;
}

void Telemetry_Drill(void) {
    if(active_tool != TOOL_DRILL) return;
    // RPM conversion assumes 1 FG pulse per revolution and this function's
    // 150ms telemetry window (60000/150=400) - verify against the BL4260's
    // actual FG spec if it turns out to give more than 1 pulse/rev, same
    // as the fan assumptions.
    __disable_irq();
    uint32_t drill_pulses_captured = drill_rpm_pulses;
    drill_rpm_pulses = 0;
    __enable_irq();
    drill_actual_rpm = drill_pulses_captured * 400; 
    // Sanity clamp: a single stray noise-triggered pulse count can produce a
    // physically impossible RPM figure. Beyond protecting the CAN telemetry
    // from reporting nonsense, this also keeps the 5-digit case from ever
    // reaching the OLED, where it would overflow into the tool icon's column.
    if (drill_actual_rpm > 9999) drill_actual_rpm = 9999;
}

void Telemetry_LayerFan(void) {
    if (active_tool != TOOL_3D_PRINTER) return;
    // Assumes standard 4-wire fan convention (2 FG pulses per revolution).
    // 150ms window -> RPM = pulses * (60000/150) / 2 = pulses * 200.
    // If your specific fan gives 1 pulse/revolution, change *200 to *400.
    __disable_irq();
    uint32_t layer_pulses_captured = layer_fan_rpm_pulses;
    layer_fan_rpm_pulses = 0;
    __enable_irq();
    layer_fan_actual_rpm = layer_pulses_captured * 200;
    if (layer_fan_actual_rpm > 9999) layer_fan_actual_rpm = 9999; // see drill_actual_rpm above
}

void Watchdog_Safety_Laser(void) {
    if (active_tool != TOOL_LASER_ENGRAVER) return;
    
    // If power is active but the master doesn't refresh the watchdog within 250ms, full shutdown
    if (laser_power_setpoint > 0 && (HAL_GetTick() - laser_last_kick_tick > 250)) {
        laser_power_setpoint = 0;
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
        // Per CANBUS.TXT's documented polarity (PB6 LOW = safe/locked, PB6
        // HIGH = armed), a safety timeout must drive this LOW to lock the
        // interlock, not HIGH - see the POLARITY WARNING on the RX handler
        // above, which applies here too and still needs physical verification.
        HAL_GPIO_WritePin(TMC_ENN_PORT, LASER_SAFETY_PIN, GPIO_PIN_RESET); // Lock interlock (safe)
        system_error_flag = 1;
    }
}

// Ends an active spot-welder/ultrasonic-welder pulse once its declared
// duration has elapsed - see this function's own note in the partitioned
// form (firmware_can_weldpulse.c) on the ~20ms real resolution limit
// this polled approach has, since T12_PWM_PIN has no hardware timer
// behind it.
void WeldPulse_Tick(void) {
    if (!weld_pulse_active) return;
    if (HAL_GetTick() - weld_pulse_start_tick >= weld_pulse_duration_ms) {
        HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET);
        weld_pulse_active = 0;
    }
}

// Drill communication watchdog - the laser, layer fan, and hotend fan all
// have one, but a lost-comms drill would have
// spun at whatever speed was last commanded indefinitely). Same 250ms
// threshold and shutdown pattern as the laser above, but also actively
// brakes (PB6 LOW) rather than just cutting PWM - coasting a cutting bit
// down under its own momentum isn't good enough for a safety timeout.
void Watchdog_Safety_Drill(void) {
    if (active_tool != TOOL_DRILL) return;

    if (drill_speed > 0 && (HAL_GetTick() - drill_last_kick_tick > 250)) {
        drill_speed = 0;
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
        HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_RESET); // Brake (LOW, per this tool's polarity)
        system_error_flag = 1;
    }
}

// Communication watchdog for a thermal tool - a lost umbilical while a
// heater is actively on would otherwise leave the bang-bang loop happily
// driving toward the last known target_temperature forever. Setting
// target_temperature=0 alongside system_error_flag reuses the existing,
// already-verified shutdown path each control function takes for a
// declared error, rather than duplicating pin-level logic here.
void Watchdog_Safety_SolderIron(void) {
    if (active_tool != TOOL_SOLDERING_IRON && active_tool != TOOL_HOTAIR_REWORK) return;

    if (target_temperature > 0 && (HAL_GetTick() - solder_iron_last_kick_tick > 250)) {
        target_temperature = 0;
        system_error_flag = 1;
    }
}

