JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
void Watchdog_Safety_HotendHeater(void) {
    if (active_tool != TOOL_3D_PRINTER) return;

    if (target_temperature > 0 && (HAL_GetTick() - hotend_heater_last_kick_tick > 250)) {
        target_temperature = 0;
        system_error_flag = 1;
    }
}

// Layer fan communication watchdog. Replaces the original idea
// of "emergency stop on PB6": that pin is already the extruder's TMC_ENN in this
// same tool mode, and forcing it here would have cut the driver mid-way
// through a print every time the fan dropped to 0%. This is the real,
// conflict-free emergency stop: if the master stops refreshing 0x173
// while the fan is at >0% for 1s, the PWM is shut off
// autonomously (same philosophy as the laser, just without touching PB6).
// Protocol note: as with the laser, the master must resend 0x173
// periodically even if the setpoint doesn't change, to keep this watchdog alive.
void Watchdog_Safety_LayerFan(void) {
    if (active_tool != TOOL_3D_PRINTER) return;

    if (layer_fan_duty > 0 && (HAL_GetTick() - layer_fan_last_kick_tick > 1000)) {
        layer_fan_duty = 0;
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
        system_error_flag = 1;
    }
}

void Telemetry_HotendFan(void) {
    if (active_tool != TOOL_3D_PRINTER) return;
    // Same 2-pulses/revolution assumption as the layer fan - adjust if this
    // fan's actual FG spec differs.
    __disable_irq();
    uint32_t hotend_pulses_captured = hotend_fan_rpm_pulses;
    hotend_fan_rpm_pulses = 0;
    __enable_irq();
    hotend_fan_actual_rpm = hotend_pulses_captured * 200;
    if (hotend_fan_actual_rpm > 9999) hotend_fan_actual_rpm = 9999; // see drill_actual_rpm above
}

// Deliberately NOT a comm-loss watchdog like the layer fan's. This fan cools
// the heat break/heatsink, not the printed part - if the master ever goes
// silent, leaving it RUNNING is the safer failure mode (protects against heat
// creep), not shutting it off. So instead this is a STALL detector: if duty
// is commanded >0 but the tachometer reads exactly 0 RPM 3s after starting
// (enough time to spin up), the fan has physically failed, and that's worth
// flagging regardless of what the master is doing.
void Watchdog_Safety_HotendFan(void) {
    if (active_tool != TOOL_3D_PRINTER) return;

    static uint32_t stall_start_tick = 0;

    // Minimum duty before arming: below this, many small DC fans can't
    // physically overcome static friction to start spinning at all - that's
    // not a fault, it's an intentionally very low commanded speed. Arming
    // the stall detector for any nonzero duty would false-trip on exactly
    // that case and abort an otherwise-fine print over a fan that was never
    // asked to actually turn.
    if (hotend_fan_duty > 10) {
        if (hotend_fan_actual_rpm > 0) {
            // Fan is genuinely turning - keep the stall timer reset
            stall_start_tick = HAL_GetTick();
        } else if (HAL_GetTick() - stall_start_tick > 3000) {
            // RPM has read exactly 0 for 3 continuous seconds while duty > 0
            system_error_flag = 1;
        }
    } else {
        stall_start_tick = HAL_GetTick();
    }
}

// =============================================================================
// 8. AUTOMATIC MUTANT IDENTIFICATION (TOOL ECOSYSTEM HARDWARE READOUT)
// =============================================================================
void Identify_PhysicalTool(void) {
    // Read multiple times with a short settling delay between each,
    // requiring 3 consecutive identical readings before accepting one.
    // This runs exactly once, here at boot, never again during operation
    // (active_tool is a fixed, per-board hardware property, not something
    // re-read mid-session) - so this isn't guarding against vibration
    // during a move the way a continuously-read input would need to. What
    // it does guard against: a single noisy or unsettled reading right at
    // power-up latching the wrong tool for the entire session, since nothing
    // else ever gets a chance to correct it before the next power cycle.
    uint8_t id = 0;
    uint8_t stable_count = 0;
    uint8_t last_id = 0xFF; // sentinel - never a valid 5-bit reading, guarantees the first pass never matches
    for (uint8_t attempt = 0; attempt < 10 && stable_count < 3; attempt++) {
        id = 0;
        if (HAL_GPIO_ReadPin(ID0_PORT, ID0_PIN) == GPIO_PIN_RESET) id |= 0x01;
        if (HAL_GPIO_ReadPin(ID1_PORT, ID1_PIN) == GPIO_PIN_RESET) id |= 0x02;
        if (HAL_GPIO_ReadPin(ID2_PORT, ID2_PIN) == GPIO_PIN_RESET) id |= 0x04;
        if (HAL_GPIO_ReadPin(ID3_PORT, ID3_PIN) == GPIO_PIN_RESET) id |= 0x08;
        if (HAL_GPIO_ReadPin(ID4_PORT, ID4_PIN) == GPIO_PIN_RESET) id |= 0x10;
        if (id == last_id) {
            stable_count++;
        } else {
            stable_count = 1;
            last_id = id;
        }
        if (stable_count < 3) {
            HAL_Delay(2);
        }
    }
    // Falls through with whatever the last reading was even if 10 attempts
    // never produced 3 matching in a row (a genuinely floating/unconnected
    // jumper bank could oscillate indefinitely) - the id<=11 validity check
    // right below still applies exactly as before, so an unstable reading
    // most likely just lands on TOOL_INVALID rather than a wrong-but-valid
    // tool, which is the safe direction for this to fail in.
    
    raw_id_pin_value = id; // kept for the id==31 branch just below, which
                            // runs later (once the F-RAM is actually
                            // readable) and needs to know whether this
                            // boot's reading was specifically 0x1F/11111b,
                            // not just whatever active_tool ends up as here.

    if (id <= 24) {
        active_tool = (ToolMode_t)id;
    } else if (id == 31) {
        // 0x1F/11111b - every jumper installed - is the "free
        // configuration" address (see EEPROM.TXT/CANBUS.TXT): rather than
        // a fixed tool, the actual selection lives in the F-RAM's
        // free_tool_selection register, set ahead of time via CAN
        // (0x1A2, see CANBUS.TXT) - normally through the Tester, since
        // the Flasher is the one that can actually write it. Read
        // directly here (not through SavedState_Load(), which hasn't run
        // yet and reads the same F-RAM this same way, but for the wider
        // set of restorable settings) - only this one register matters
        // for this decision, and MX_I2C2_Init_Early() just above made
        // that read possible this early in boot.
        SavedState_t fram_check;
        uint8_t selection = 0; // 0 = no tool selected, same fail-safe default as an invalid reading
        if (FRAM_ReadBytes(SAVEDSTATE_FRAM_ADDR, (uint8_t *)&fram_check, sizeof(fram_check))
            && fram_check.magic == SAVEDSTATE_MAGIC
            && fram_check.struct_version == SAVEDSTATE_VERSION
            && SavedState_Checksum(&fram_check) == fram_check.checksum) {
            selection = fram_check.free_tool_selection;
        }
        if (selection >= 1 && selection <= 25) {
            active_tool = (ToolMode_t)(selection - 1);
        } else {
            active_tool = TOOL_INVALID;
            system_error_flag = 1;
            HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_SET);   // steppers disabled
            HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_RESET); // drill brake engaged
            HAL_GPIO_WritePin(TMC_ENN_PORT, LASER_SAFETY_PIN, GPIO_PIN_RESET); // laser interlock locked
            HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET); // heater off
        }
    } else {
        active_tool = TOOL_INVALID;
        system_error_flag = 1;
        // Explicit, redundant safety: force every actuator output to its
        // inert state right now, rather than trusting that no other code
        // path will ever touch them for a tool ID nothing else recognizes.
        HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_SET);   // steppers disabled
        HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_RESET); // drill brake engaged
        HAL_GPIO_WritePin(TMC_ENN_PORT, LASER_SAFETY_PIN, GPIO_PIN_RESET); // laser interlock locked
        HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_RESET); // heater off
    }
}

