JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
        // Blocks every incoming command except 0x100 (lighting) while a
        // critical error is active - nothing here is safe to let through
        // otherwise. A master that didn't notice the fault (or was itself
        // the cause of it) could keep driving motors or firing the laser
        // while the OLED reads SYSTEM BLOCKED. Lighting/night-mode above
        // still works since neither is hazardous either way.
        if (system_error_flag) {
            return;
        }

        switch(active_tool) {
            case TOOL_SOLDERING_IRON:
                if (rxHeader.StdId == 0x130 && rxHeader.DLC >= 2) {
                    // Big-endian reconstruction (MSB | LSB)
                    target_temperature = (rxData[0] << 8) | rxData[1];
                    solder_iron_last_kick_tick = HAL_GetTick();
                }
                break;

            case TOOL_PASTE_DISPENSER:
            case TOOL_LIQUID_DISPENSER:
            case TOOL_SCREWDRIVER:
            case TOOL_GRIPPER_GIMBAL:
            case TOOL_GRIPPER_NEMA:
            case TOOL_SMT_PICKPLACE:     // doc #1 - rotary A-axis, plain NEMA8 stepper
            case TOOL_VACUUM_GRIPPER_LG: // doc #6 - open/close, plain stepper
                if (rxHeader.StdId == 0x120 && rxHeader.DLC >= 5 && !boot_sequence_active) {
                    __disable_irq();
                    // Clears any steps left over from the previous command
                    // before a direction change takes effect - not a
                    // physical pause before reversing (the DIR pin and the
                    // new step count both change together, in this same
                    // critical section, with no STEP pulse generated
                    // between them, so the actual motion is an instant
                    // reversal, not stop-then-reverse). What this prevents
                    // is stale steps queued under the old direction
                    // running under the new one instead - without this,
                    // a command that both reverses direction and asks for
                    // fewer steps than were still queued would execute
                    // some of that leftover count in the wrong direction.
                    GPIO_PinState new_dir = (rxData[0] == 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET;
                    if (HAL_GPIO_ReadPin(DIR_PORT, DIR_PIN) != new_dir) {
                        steps_remaining = 0;
                    }
                    HAL_GPIO_WritePin(DIR_PORT, DIR_PIN, new_dir);
                    
                    // 32-bit motor steps, big-endian (MSB to LSB)
                    uint32_t steps = ((uint32_t)rxData[1] << 24) | 
                                     ((uint32_t)rxData[2] << 16) | 
                                     ((uint32_t)rxData[3] << 8)  | 
                                     rxData[4];
                    if (steps > 0) {
                        total_steps_setpoint = steps;
                        steps_remaining = steps;
                        // Fresh move: force the step ISR to start with a
                        // rising edge. Left at 1 from the tail end of a
                        // previous move, the first tick of this new move
                        // would perform a falling edge instead, misaligning
                        // the very first step.
                        step_pulse_high = 0;
                        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_RESET); // force the physical pin low too, not just the flag above
                        HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_RESET); // Enable TMC2209
                    } else {
                        // steps==0 is a stop request - the direction-change
                        // branch above already clears steps_remaining when
                        // direction flips, but a stop sent with the same
                        // direction as an already-in-progress move needs
                        // this too, or that move would otherwise run to
                        // completion unaffected by a command that asked
                        // for zero steps.
                        steps_remaining = 0;
                    }
                    __enable_irq();
                }
                break;

            case TOOL_DRILL:
                if (rxHeader.StdId == 0x140 && rxHeader.DLC >= 2 && !boot_sequence_active) {
                    drill_speed = rxData[0];
                    drill_last_kick_tick = HAL_GetTick();
                    HAL_GPIO_WritePin(DRILL_FRIN_PORT, DRILL_FRIN_PIN, (rxData[1] == 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET);
                    
                    // drill_speed is 0-255 (full byte) per CANBUS.TXT,
                    // not a 0-100 percentage. Scaled the same way as the laser to cover the full range.
                    uint32_t duty = (drill_speed * 3199) / 255; // scaled for TIM1's 20kHz period
                    __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, duty);
                    
                    if (drill_speed > 0) {
                        HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_SET); // Release brake
                    } else {
                        HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_RESET); // Brake
                    }
                }
                break;

            case TOOL_AOI_INSPECTION:
                if (rxHeader.StdId == 0x150 && rxHeader.DLC >= 3) {
                    aoi_mode = rxData[0];
                    // Strobe period, big-endian
                    aoi_strobe_period = (rxData[1] << 8) | rxData[2];
                    if (aoi_mode == 0x01) {
                        // Strobe: handled in the main loop's pulse trigger
                        trigger_aoi_strobe_flag = 1;
                    } else if (aoi_mode == 0x02) {
                        // Continuous: ring solid on at the stored color.
                        // Same atomic-capture reasoning as the 0x150 handler.
                        __disable_irq();
                        uint8_t cr2 = ring_color_r, cg2 = ring_color_g, cb2 = ring_color_b;
                        __enable_irq();
                        for (int i = 0; i < 8; i++) {
                            ring_pixels[i].R = cr2;
                            ring_pixels[i].G = cg2;
                            ring_pixels[i].B = cb2;
                        }
                        update_led_ring_flag = 1;
                    } else {
                        // Off
                        for (int i = 0; i < 8; i++) {
                            ring_pixels[i].R = 0;
                            ring_pixels[i].G = 0;
                            ring_pixels[i].B = 0;
                        }
                        update_led_ring_flag = 1;
                    }
                }
                break;

            case TOOL_LASER_ENGRAVER:
                if (rxHeader.StdId == 0x160 && rxHeader.DLC >= 2 && !boot_sequence_active) {
                    laser_power_setpoint = rxData[0];
                    laser_last_kick_tick = HAL_GetTick();

                    // Duty forced to 0 unless the interlock is explicitly
                    // armed (rxData[1]==0x01) - a software floor beneath the
                    // physical interlock pin below, not a replacement for it.
                    // Without this, the PWM itself was generated purely from
                    // the power setpoint, with zero dependency on the
                    // interlock state - a host sending a nonzero power byte
                    // while leaving the interlock at 0x00 (locked) would
                    // still get real PWM out of TIM1, relying entirely on
                    // the external interlock circuit to physically cut the
                    // beam. This way, an interlock left unarmed - or a
                    // stray/malformed frame with rxData[1] anything other
                    // than exactly 0x01 - can't produce laser PWM even if
                    // that external circuit is slow, miswired, or absent.
                    uint32_t laser_duty = (rxData[1] == 0x01)
                        ? (laser_power_setpoint * 3199) / 255 // scaled for TIM1's 20kHz period
                        : 0;
                    __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, laser_duty);
                    
