JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
                    // rxData[1] is the master's explicit interlock/safety
                    // command, independent of the power setpoint above -
                    // follows CANBUS.TXT literally: 0x01=armed=PB6 HIGH,
                    // 0x00=safe/locked=PB6 LOW.
                    // POLARITY WARNING: this pin is physically shared with
                    // TMC_ENN (active-low ENABLE on the stepper driver, in
                    // other tool modes). If the laser's actual interlock relay
                    // was wired assuming that same active-low-enable sense,
                    // PB6 LOW here would mean "enabled" - the OPPOSITE of what
                    // CANBUS.TXT documents (PB6 LOW = safe/locked). Verify
                    // against the real interlock circuit before relying on
                    // this with the laser powered - getting this backwards
                    // means the laser could fire when you expect it locked.
                    HAL_GPIO_WritePin(TMC_ENN_PORT, LASER_SAFETY_PIN,
                        (rxData[1] == 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET);
                }
                break;

            case TOOL_ELECTROMAGNET: // doc #3 - CONN_T12 as plain on/off,
                                      // not a hardware PWM channel (see
                                      // firmware_can_electromagnet.c's own
                                      // note in the partitioned form)
                if (rxHeader.StdId == 0x1B0 && rxHeader.DLC >= 1 && !boot_sequence_active) {
                    HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN,
                        (rxData[0] != 0x00) ? GPIO_PIN_SET : GPIO_PIN_RESET);
                }
                break;

            case TOOL_UV_CURING: // doc #8 - real hardware PWM, TIM1_CH1
                                  // shared with drill/laser/layer fan
                if (rxHeader.StdId == 0x1D0 && rxHeader.DLC >= 1 && !boot_sequence_active) {
                    uint32_t uv_duty = (rxData[0] * 3199) / 255;
                    __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, uv_duty);
                }
                break;

            case TOOL_SPOT_WELDER:       // doc #4
            case TOOL_ULTRASONIC_WELDER: // doc #15 - shares this case with
                                          // doc #4 since both are a timed
                                          // T12 pulse (see
                                          // firmware_can_weldpulse.c's own
                                          // note on the ~20ms real
                                          // resolution limit and why only
                                          // doc #4 gates on the contact
                                          // sensor)
                if (!weld_pulse_active) {
                    if (rxHeader.StdId == 0x1C0 && rxHeader.DLC >= 3 && !boot_sequence_active
                        && active_tool == TOOL_SPOT_WELDER && rxData[0] == 0x01
                        && HAL_GPIO_ReadPin(GPIOB, TCRT_D0_DIG_PIN) == GPIO_PIN_SET) {
                        weld_pulse_duration_ms = ((uint16_t)rxData[1] << 8) | rxData[2];
                        weld_pulse_start_tick = HAL_GetTick();
                        weld_pulse_active = 1;
                        HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_SET);
                    } else if (rxHeader.StdId == 0x200 && rxHeader.DLC >= 3 && !boot_sequence_active
                               && active_tool == TOOL_ULTRASONIC_WELDER && rxData[0] == 0x01) {
                        weld_pulse_duration_ms = ((uint16_t)rxData[1] << 8) | rxData[2];
                        weld_pulse_start_tick = HAL_GetTick();
                        weld_pulse_active = 1;
                        HAL_GPIO_WritePin(T12_PWM_PORT, T12_PWM_PIN, GPIO_PIN_SET);
                    }
                }
                break;

            case TOOL_HOTAIR_REWORK: // doc #10 - target_temperature shared
                                      // with the soldering iron's own
                                      // thermal loop (see
                                      // Control_SolderingIron_PID's own
                                      // extended active_tool check above),
                                      // blower on the same TIM1_CH1 as
                                      // drill/laser/UV-curing
                if (rxHeader.StdId == 0x1E0 && rxHeader.DLC >= 3 && !boot_sequence_active) {
                    target_temperature = ((uint16_t)rxData[0] << 8) | rxData[1];
                    solder_iron_last_kick_tick = HAL_GetTick();
                    uint32_t blower_duty = (rxData[2] * 3199) / 255;
                    __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, blower_duty);
                }
                break;

            case TOOL_3D_PRINTER:
                if (rxHeader.StdId == 0x170 && rxHeader.DLC >= 6) {
                    // Hotend temperature, big-endian (MSB | LSB)
                    // Not gated on boot_sequence_active - starting the heater
                    // pre-warming during the splash is fine (no physical
                    // motion involved); only the extruder steps below need
                    // to wait for the splash to finish.
                    target_temperature = (rxData[0] << 8) | rxData[1];
                    hotend_heater_last_kick_tick = HAL_GetTick();
                    if (!boot_sequence_active) {
                    __disable_irq();
                    // Clear residual queued steps before a direction change - same reasoning as the 0x120 handler above
                    GPIO_PinState new_dir = (rxData[2] == 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET;
                    if (HAL_GPIO_ReadPin(DIR_PORT, DIR_PIN) != new_dir) {
                        steps_remaining = 0;
                    }
                    HAL_GPIO_WritePin(DIR_PORT, DIR_PIN, new_dir);
                    
                    // Extruder steps, big-endian (Bytes 3, 4, and 5)
                    uint32_t extruder_steps = ((uint32_t)rxData[3] << 16) | 
                                         ((uint32_t)rxData[4] << 8)  | 
                                         rxData[5];
                    if (extruder_steps > 0) {
                        total_steps_setpoint = extruder_steps;
                        steps_remaining = extruder_steps;
                        step_pulse_high = 0; // see the 0x120 handler above
                        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_RESET); // physical pin low too, not just the flag
                        HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_RESET);
                    } else {
                        steps_remaining = 0; // stop request - see the 0x120 handler above
                    }
                    __enable_irq();
                    }
                }
                // Layer fan (0x173): duty 0-255 towards TIM1_CH1/PA8 at 25kHz,
                // sharing the same channel as drill/laser (reconfigured to
                // this tool's exact rate in main()) - independent from TIM3.
                else if (rxHeader.StdId == 0x173 && rxHeader.DLC >= 1) {
                    layer_fan_duty = rxData[0];
                    uint32_t fan_duty = (layer_fan_duty * 2559) / 255;
                    __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, fan_duty);
                    layer_fan_last_kick_tick = HAL_GetTick();
                }
                // Hotend fan (0x178): duty 0-255 towards TIM2_CH1/PA5 at
                // 25kHz. Separate from the layer fan - cools the heatsink/heat
                // break, not the printed part.
                else if (rxHeader.StdId == 0x178 && rxHeader.DLC >= 1) {
                    hotend_fan_duty = rxData[0];
                    uint32_t hfan_duty = (hotend_fan_duty * 2559) / 255;
                    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, hfan_duty);
                    hotend_fan_last_kick_tick = HAL_GetTick();
                }
                break;
                
            default:
                break;
        }
    }
}

