JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// =============================================================================
// 10. ASSOCIATED INTERRUPTS AND VECTOR HANDLERS (ISR)
// =============================================================================
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == TOUCH_IN_PIN) {
        if (active_tool == TOOL_SCAN_PROBE) {
            // Debounces the probe: a mechanical contact genuinely bounces
            // (unlike the tachometer inputs elsewhere, which are about
            // electrical noise) - 30-40 bounces within a millisecond would
            // each fire this whole handler, flooding the bus with duplicate
            // critical-priority messages. This doesn't delay the genuine
            // first impact (it always passes immediately, since nothing
            // recent precedes it) - it only suppresses the bounce-induced
            // duplicates that follow within 2ms.
            static uint32_t last_probe_tick = 0;
            uint32_t now_probe = HAL_GetTick();
            if (now_probe - last_probe_tick < 2) {
                return;
            }
            last_probe_tick = now_probe;
            // Collision frame with critical-priority ID (0x095), injected immediately
            CAN_TxHeaderTypeDef txHead;
            uint8_t txDataLocal[1] = {0x01};
            uint32_t mailbox;
            
            txHead.StdId = 0x095;
            txHead.RTR = CAN_RTR_DATA;
            txHead.IDE = CAN_ID_STD;
            txHead.DLC = 1;
            txHead.TransmitGlobalTime = DISABLE;

            // This is the one message documented as never allowed to fail - if
            // all 3 hardware mailboxes are occupied, clear them out rather than
            // risk AddTxMessage silently dropping the impact report.
            if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) == 0) {
                HAL_CAN_AbortTxRequest(&hcan, CAN_TX_MAILBOX0);
                HAL_CAN_AbortTxRequest(&hcan, CAN_TX_MAILBOX1);
                HAL_CAN_AbortTxRequest(&hcan, CAN_TX_MAILBOX2);
                // HAL_CAN_AbortTxRequest only sets the hardware's abort-request
                // bit and returns immediately - it doesn't wait for the
                // hardware to actually finish releasing the mailbox, so a
                // short poll here (not a fixed delay) confirms it's really
                // free before trusting the send below to succeed. Bounded
                // iteration count, not a real-time wait, so this can't hang.
                for (uint16_t wait = 0; wait < 1000 && HAL_CAN_GetTxMailboxesFreeLevel(&hcan) == 0; wait++);
            }

            HAL_CAN_AddTxMessage(&hcan, &txHead, txDataLocal, &mailbox);
            probe_impact_counter++; // to show it live on the OLED
        }
        else if (active_tool == TOOL_DRILL) {
            // BL4260 motor tachometer pulse count. Debounced the same way as
            // the hotend fan (2ms minimum spacing) - a good general defense
            // for any tachometer input even without a specific known noise
            // source, and it's free.
            static uint32_t last_drill_pulse_tick = 0;
            uint32_t now_drill = HAL_GetTick();
            if (now_drill - last_drill_pulse_tick >= 2) {
                drill_rpm_pulses++;
                last_drill_pulse_tick = now_drill;
            }
        }
        else if (active_tool == TOOL_3D_PRINTER) {
            // Layer fan FG pulse count (same PA3 pin, same EXTI3). Same 2ms
            // debounce as above.
            static uint32_t last_layerfan_pulse_tick = 0;
            uint32_t now_layerfan = HAL_GetTick();
            if (now_layerfan - last_layerfan_pulse_tick >= 2) {
                layer_fan_rpm_pulses++;
                last_layerfan_pulse_tick = now_layerfan;
            }
        }
    }
    else if (GPIO_Pin == HOTEND_FAN_FG_PIN) {
        // Hotend fan FG pulse count (PA6, EXTI6 - its own line, no sharing/routing
        // needed unlike EXTI3). Debounced: PA5 (this fan's own PWM output) sits
        // on the adjacent pin and switches at 25kHz - capacitive crosstalk
        // between closely-routed traces on this package could inject noise
        // edges into PA6 that look like real tachometer pulses, which would
        // mask a genuine stall right when the stall detector needs to catch
        // it. 2ms is a clean separation: even an unrealistically fast small
        // fan (15,000+ RPM at 2 pulses/rev) doesn't produce genuine pulses
        // faster than that, while 25kHz noise (40us period) is two orders of
        // magnitude quicker and gets rejected.
        static uint32_t last_hotend_fan_pulse_tick = 0;
        if (active_tool == TOOL_3D_PRINTER) {
            uint32_t now = HAL_GetTick();
            if (now - last_hotend_fan_pulse_tick >= 2) {
                hotend_fan_rpm_pulses++;
                last_hotend_fan_pulse_tick = now;
            }
        }
    }
}

// Overrides the startup file's default weak HardFault_Handler (an empty
// infinite loop). If a memory fault or illegal instruction ever lands here,
// none of the PWM timers or software watchdogs get a chance to react on
// their own - whatever was last commanded (heater, laser, motor) would
// otherwise stay latched on indefinitely. First action: force every pin on
// GPIOA and GPIOB low, physically cutting every actuator this board drives,
// before anything else - including before any debug/reset attempt.
void HardFault_Handler(void) {
    // BRR only affects pins currently in GPIO output mode - a pin in
    // Alternate Function mode is driven by that peripheral's own output
    // logic instead, completely bypassing ODR/BSRR/BRR. PA8 (TIM1_CH1 -
    // the laser/drill/layer-fan PWM) is exactly such a pin, so writing to
    // BRR alone wouldn't touch it - a HardFault while the 10W laser was
    // firing would leave it firing indefinitely. Forcing MODER to
    // all-analog (0b11 per pin) electrically disconnects every pin from
    // both the GPIO driver and any AF peripheral - the only state that's
    // safe regardless of whatever mode each pin was in at the moment of
    // the fault.
    // EXCEPTION: PA13/PA14 (SWDIO/SWCLK) are deliberately spared and forced
    // to AF mode (0b10) instead of analog - blanking Port A entirely would
    // cut the debugger connection at exactly the moment someone would most
    // want to read the fault status registers and call stack to find out
    // why this handler was even entered.
    GPIOA->MODER = 0xEBFFFFFF; // all Port A analog except PA13/PA14 -> AF
    GPIOB->MODER = 0xFFFFFFFF;
    while (1) { }
}

// Required for HAL_SPI_Transmit_DMA's completion callback to ever fire -
// without this, HAL_SPI_GetState never transitions back to READY after the
// first transfer, and Update_AllLEDs_SPI_DMA's busy-check would silently
// skip every subsequent call forever.
void DMA1_Channel3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_spi1_tx);
}

// Fires on any CAN error (including bus-off) and sets a flag the OLED can
// show - AutoBusOff recovery already handles the electrical side, this
// just makes sure a fault is visible to whoever's standing at the machine
// instead of it going silent with no explanation.
void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan_e) {
    can_bus_error_flag = 1;
}

// Advances the millisecond tick HAL_GetTick() reads. Without this handler
// calling HAL_IncTick(), HAL_GetTick() would always return 0 and every
// HAL_Delay() call in this file would spin forever, since its exit
// condition compares HAL_GetTick() against a start value that's also 0.
void SysTick_Handler(void) {
    HAL_IncTick();
}

void CAN_RX0_IRQHandler(void) {
    HAL_CAN_IRQHandler(&hcan);
}

// Drives the stepper motors: every 1ms it toggles STEP once, so a full
// pulse (high+low edge, what nearly every TMC/generic driver counts as
// "one step") takes 2 ticks = 2ms -> max ~500 steps/second. Enough for
// dispensers/screwdriver/grippers; if the 3D extruder needs a higher
// print speed, this is the place to speed up (shorter TIM3 period).
void TIM3_IRQHandler(void) {
    HAL_TIM_IRQHandler(&htim3);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance != TIM3) return;

    // Blocking new CAN commands during system_error_flag alone does
    // nothing to stop a motion already in progress. A long extrusion or
    // dispense move started before a thermal fault or fan stall tripped
    // the flag would keep running to completion - potentially tens of
    // seconds of a motor driven blind while the OLED already reads SYSTEM
    // BLOCKED. An emergency stop needs to halt physical motion the instant
    // the fault is detected, not just refuse new instructions.
    if (system_error_flag) {
        steps_remaining = 0;
        HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_SET); // stepper tools disabled
        // Cutting stepper current does nothing for the laser/drill PWM
        // channel or the two fan PWMs - force every PWM output to 0 too.
        // Guarded: htim1/htim2 are only initialized for certain tools (see
        // main()) - their .Instance is NULL otherwise.
        if (htim1.Instance != NULL) {
            __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0); // drill/laser/layer-fan PWM
        }
        // The hotend fan is a cooling fan, not an actuator that can cause
        // harm by continuing to run - left running (htim2 intentionally not
        // zeroed) so it can keep dissipating residual heat.
        if (active_tool == TOOL_LASER_ENGRAVER) {
            HAL_GPIO_WritePin(TMC_ENN_PORT, LASER_SAFETY_PIN, GPIO_PIN_RESET); // interlock locked
        }
        // PWM=0 alone doesn't stop a spinning drill bit - it coasts freely.
        // DRILL_ENN's polarity is LOW=brake, HIGH=spin. Its own pin now, so
        // this can't interact with the stepper ENN write above regardless
        // of ordering.
        if (active_tool == TOOL_DRILL) {
            HAL_GPIO_WritePin(DRILL_BRAKE_PORT, DRILL_BRAKE_PIN, GPIO_PIN_RESET);
        }
        return;
    }

    // Explicitly tracks which half of the pulse we're in, rather than a
    // plain TogglePin: stepper drivers (TMC2209 included) only count a
    // step on the rising edge, so steps_remaining decrements once per real
    // step (matching the OLED display and the CAN protocol) - still 2
    // ticks (2ms) per real step, ~500 steps/sec ceiling.

    if (steps_remaining > 0) {
        if (!step_pulse_high) {
            HAL_GPIO_WritePin(GPIOB, STEP_PIN, GPIO_PIN_SET); // rising edge = the actual step
            step_pulse_high = 1;
        } else {
            HAL_GPIO_WritePin(GPIOB, STEP_PIN, GPIO_PIN_RESET);
            step_pulse_high = 0;
            // CONCURRENCY FIX (separate from the one below): steps_remaining--
            // is a non-atomic read-modify-write. The higher-priority CAN
            // interrupt can preempt right in the middle of it with a fresh
            // move command (a new nonzero steps_remaining), and this ISR
            // resuming afterward would overwrite that fresh value with its
            // own stale decremented one - silently erasing the new command.
            __disable_irq();
            steps_remaining--;
            __enable_irq();
            if (steps_remaining == 0) {
                // A higher-priority CAN interrupt can
                // preempt this ISR right here, process a new move command
                // (fresh nonzero steps_remaining, driver re-enabled), then
                // return control back to this exact point. Without a fresh
                // re-check, the code below would still see the earlier
                // (now stale) "just reached zero" result and disable the
                // driver it was just re-enabled for - the new move would
                // count down doing nothing, since no current reaches the
                // motor. Re-reading right before acting catches that.
                if (steps_remaining != 0) {
                    return;
                }
                // Cutting power unconditionally here would release
                // holding torque even for tools that need to keep gripping or
                // resisting backpressure after the move finishes - the NEMA
                // and gimbal grippers would relax their jaws and could drop
                // whatever they just grasped, and the 3D printer's extruder
                // would let molten filament pressure push the gear backward
                // between moves. Only cut power for the tools where holding
                // torque genuinely isn't needed once idle.
                if (active_tool != TOOL_GRIPPER_NEMA && active_tool != TOOL_GRIPPER_GIMBAL &&
                    active_tool != TOOL_3D_PRINTER) {
                    HAL_GPIO_WritePin(TMC_ENN_PORT, TMC_ENN_PIN, GPIO_PIN_SET); // Cut power once finished
                }
            }
        }
    }
}

// EXTI3 - the touch scan probe and the drill/3D-printer tachometer share
// this line (see PB3's shared usage elsewhere), routed to Port B in
// MX_GPIO_Post_Init.
void EXTI3_IRQHandler(void) {
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_3);
}

// Hotend fan FG tachometer (PA6, EXTI6) - falls in this chip's combined
// 5-9 vector.
void EXTI9_5_IRQHandler(void) {
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_6);
}

