JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
    // Secondary drill pins (PA3 as EXTI, PA4 as rotation direction)
    HAL_GPIO_WritePin(DRILL_FRIN_PORT, DRILL_FRIN_PIN, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin = DRILL_FRIN_PIN;
    HAL_GPIO_Init(DRILL_FRIN_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = DRILL_FGIN_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(DRILL_FGIN_PORT, &GPIO_InitStruct);

    // EXTI vector interrupt enable
    HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(EXTI3_IRQn);
    HAL_NVIC_SetPriority(EXTI9_5_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
}

void MX_CAN_Init(void) {
    CAN_FilterTypeDef sFilterConfig;
    __HAL_RCC_CAN1_CLK_ENABLE();

    // CAN_RX/CAN_TX (PA11/PA12) alternate-function configuration. Without
    // this, the pins stay at their reset-default state and the bus signals
    // never actually reach the physical pins, regardless of how the CAN
    // peripheral itself is configured below.
    GPIO_InitTypeDef GPIO_CAN = {0};
    GPIO_CAN.Pin = CAN_RX_PIN | CAN_TX_PIN;
    GPIO_CAN.Mode = GPIO_MODE_AF_PP;
    GPIO_CAN.Pull = GPIO_PULLUP;
    GPIO_CAN.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_CAN.Alternate = GPIO_AF9_CAN;
    HAL_GPIO_Init(CAN_GPIO_PORT, &GPIO_CAN);

    hcan.Instance = CAN;
    // Bit timing for 500 Kbps: CAN sits on APB1 (32MHz on this chip - see
    // SystemClock_Config). Prescaler=4, 16 total time quanta (1 SYNC_SEG +
    // 13 BS1 + 2 BS2): 32,000,000 / 4 / 16 = 500,000 exactly, at the
    // standard 87.5% sample point. SJW=2TQ (up from 1TQ) for better
    // tolerance of clock drift - this tool head sits near a 260C hotend, a
    // T12 iron, and TMC driver heatsinks, any of which can shift a
    // crystal/resonator's frequency over time. SJW is physically bounded by
    // BS2, so getting a real 2TQ jump width meant widening BS2 to 2TQ too
    // (was 1TQ) rather than just changing this one field - baud rate and
    // sample point land in the exact same place either way, just with finer
    // time-quantum resolution now (16 total instead of 8).
    hcan.Init.Prescaler = 4;
    hcan.Init.Mode = CAN_MODE_NORMAL;
    hcan.Init.SyncJumpWidth = CAN_SJW_2TQ;
    hcan.Init.TimeSeg1 = CAN_BS1_13TQ;
    hcan.Init.TimeSeg2 = CAN_BS2_2TQ;
    hcan.Init.TimeTriggeredMode = DISABLE;
    hcan.Init.AutoBusOff = ENABLE;
    hcan.Init.AutoWakeUp = DISABLE;
    hcan.Init.AutoRetransmission = ENABLE;
    hcan.Init.ReceiveFifoLocked = DISABLE;
    hcan.Init.TransmitFifoPriority = ENABLE;
    HAL_CAN_Init(&hcan);

    // Open filters to capture every mapped setpoint ID range
    sFilterConfig.FilterBank = 0;
    sFilterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
    sFilterConfig.FilterScale = CAN_FILTERSCALE_32BIT;
    sFilterConfig.FilterIdHigh = 0x0000;
    sFilterConfig.FilterIdLow = 0x0000;
    sFilterConfig.FilterMaskIdHigh = 0x0000;
    sFilterConfig.FilterMaskIdLow = 0x0000;
    sFilterConfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    sFilterConfig.FilterActivation = ENABLE;
    HAL_CAN_ConfigFilter(&hcan, &sFilterConfig);

    HAL_CAN_Start(&hcan);
    HAL_CAN_ActivateNotification(&hcan, CAN_IT_RX_FIFO0_MSG_PENDING);
    // Error/bus-off notifications: AutoBusOff recovery is already enabled,
    // but without this, a bus fault (electrically plausible next to a BLDC
    // drill) would silence the transceiver with zero visibility that
    // anything had gone wrong. See HAL_CAN_ErrorCallback below.
    HAL_CAN_ActivateNotification(&hcan, CAN_IT_ERROR | CAN_IT_BUSOFF);

    // NVIC vector for CAN RX - without this, HAL_CAN_RxFifo0MsgPendingCallback
    // never runs: the hardware flags a pending message, but the CPU never
    // services the interrupt, and the board never responds to a command.
    HAL_NVIC_SetPriority(CAN_RX0_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(CAN_RX0_IRQn);
    // Error/bus-off interrupts route through the separate CAN_SCE vector,
    // not CAN_RX0 - this is needed in addition to the notification above
    // for HAL_CAN_ErrorCallback to ever actually fire.
    HAL_NVIC_SetPriority(CAN_SCE_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(CAN_SCE_IRQn);
}

void MX_TIM3_Full_Init(void) {
    // A pure time-base - the drill/laser/layer-fan PWM lives on
    // TIM1/PA8 instead, so TIM3 doesn't need to double as a PWM source and
    // isn't constrained to a period that also has to work as a
    // usable PWM base for those tools.
    __HAL_RCC_TIM3_CLK_ENABLE();
    htim3.Instance = TIM3;
    htim3.Init.Prescaler = 63; // 64MHz/64 = 1MHz tick, same resolution as before
    htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim3.Init.Period = 1000;  // Fine step resolution (0.1%)
    htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_Base_Init(&htim3);

    // NVIC vector for TIM3's update interrupt - this is what actually
    // drives HAL_TIM_PeriodElapsedCallback, which consumes steps_remaining
    // (set via CAN) to move the 6 stepper-motor tools.
    HAL_NVIC_SetPriority(TIM3_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(TIM3_IRQn);
    HAL_TIM_Base_Start_IT(&htim3);
}

// Drill/laser/layer-fan PWM on TIM1_CH1 (PA8), a fully independent timer
// from TIM3's step-tick duty. Takes the target period so each tool gets
// an appropriate rate: the layer fan needs its documented exact 25kHz
// (EFB0424VHD-CP0, see PINOUT_CONNECTORS.TXT), drill/laser run at ~20kHz.
// HAL_TIM_PWM_Start
// automatically enables TIM1's Master Output Enable (MOE) bit for
// break-capable advanced timers like this one - no extra step needed beyond
// the standard PWM start call.
void MX_TIM1_DrillLaserFan_Init(uint32_t period) {
    TIM_OC_InitTypeDef sConfigOC = {0};
    __HAL_RCC_TIM1_CLK_ENABLE();

    htim1.Instance = TIM1;
    htim1.Init.Prescaler = 0;
    htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim1.Init.Period = period;
    htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.RepetitionCounter = 0;
    HAL_TIM_PWM_Init(&htim1);

    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    // Belt-and-suspenders: HAL_TIM_PWM_Start already enables MOE automatically
    // for break-capable advanced timers like this one (confirmed in this
    // exact HAL version's source), but that behavior isn't part of the
    // documented public contract - an explicit call costs nothing and
    // survives a future HAL version changing that internal detail.
    __HAL_TIM_MOE_ENABLE(&htim1);
}

