JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// Hotend fan PWM (CONN_FAN1, PA5). Same 25kHz target as the layer fan, on its
// own timer (TIM2, confirmed free - AF2 on PA5, verified against ST's official
// datasheet Table 14) so it doesn't interfere with TIM3's stepper tick or the
// layer fan's TIM17.
void MX_TIM2_HotendFan_Init(void) {
    TIM_OC_InitTypeDef sConfigOC = {0};
    __HAL_RCC_TIM2_CLK_ENABLE();

    htim2.Instance = TIM2;
    htim2.Init.Prescaler = 0;
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = 2559; // 64MHz / 2560 = 25.000 kHz exactly
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_PWM_Init(&htim2);

    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
}

void MX_ADC_Init(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    __HAL_RCC_ADC12_CLK_ENABLE();
    hadc.Instance = ADC1;
    // Synchronous clock derived directly from AHB (64MHz/2=32MHz) - simpler
    // than routing through the shared ADC12 PLL clock block, and comfortably
    // under this chip's ADC clock ceiling.
    hadc.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
    hadc.Init.Resolution = ADC_RESOLUTION_12B;
    hadc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc.Init.ScanConvMode = ADC_SCAN_DISABLE;
    hadc.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    hadc.Init.LowPowerAutoWait = DISABLE;
    hadc.Init.ContinuousConvMode = DISABLE;
    hadc.Init.NbrOfConversion = 1;
    hadc.Init.DiscontinuousConvMode = DISABLE;
    hadc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc.Init.DMAContinuousRequests = DISABLE;
    hadc.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
    HAL_ADC_Init(&hadc);

    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    // This chip's sampling-time steps are entirely different from the F0
    // equivalent (no 41.5-cycle option exists here) - 61.5 cycles is the
    // nearest available step that still errs toward more settling time
    // rather than less, for a resistive-divider/thermocouple-amplifier
    // source that doesn't need fast conversions anyway.
    sConfig.SamplingTime = ADC_SAMPLETIME_61CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;
    HAL_ADC_ConfigChannel(&hadc, &sConfig);

    // This chip's calibration call takes an explicit single-ended/differential
    // parameter that F0's equivalent didn't need.
    HAL_ADCEx_Calibration_Start(&hadc, ADC_SINGLE_ENDED);
}

// =============================================================================
// 13. MAIN ENTRY POINT AND REASSIGNABLE STATE-MACHINE LOOP
// =============================================================================
int main(void) {
    // This application lives at 0x08008000, not 0x08000000 (see
    // STM32F303CCTx_APP.ld) - a bootloader and its metadata page occupy
    // the space ahead of it. The vector table moved with it, so the core
    // needs to be told where to find it before anything can rely on an
    // interrupt firing correctly.
    SCB->VTOR = 0x08008000;

    uint32_t tick_heartbeat = 0;
    uint32_t tick_screen = 0;
    uint32_t tick_pid = 0;
    uint32_t tick_fram_check = 0;
    
    HAL_Init();
    SystemClock_Config();

    MX_GPIO_Init_Early();

    // I2C2 (shared by the OLED and the F-RAM - see MX_I2C2_Init_Early's
    // own comment) needs to be up before Identify_PhysicalTool() below,
    // specifically for the case where the ID-jumper reading is 0x1F -
    // that function needs to read the F-RAM's free-configuration
    // register to resolve a real tool in that case, and this is the
    // earliest point in boot it can do that from.
    MX_I2C2_Init_Early();

    // Tool identification happens here - right after the ID-jumper pins are
    // configured, before Post_Init - so the laser's safe PB6 default can be
    // set correctly on the very first write; see MX_GPIO_Post_Init.
    Identify_PhysicalTool();

    MX_GPIO_Post_Init();
    MX_CAN_Init();
    MX_TIM3_Full_Init();
    MX_DMA_Init();  // must come before MX_SPI1_Init, which links the two
    MX_SPI1_Init();

    // Specific ADC channel mapping based on the ID that was read
    // Explicit ANALOG mode for whichever pin is in use - the reset-default
    // state happens to already be analog on this chip, but leaving it
    // implicit is fragile (anything upstream that touches this port, now or
    // in a future revision, could leave it as a digital input/pull-up
    // instead, silently loading down the NTC/thermocouple divider).
    GPIO_InitTypeDef GPIO_AdcPin = {0};
    GPIO_AdcPin.Mode = GPIO_MODE_ANALOG;
    GPIO_AdcPin.Pull = GPIO_NOPULL;
    if (active_tool == TOOL_SOLDERING_IRON) {
        GPIO_AdcPin.Pin = T12_ADC_PIN;
        HAL_GPIO_Init(GPIOA, &GPIO_AdcPin);
        MX_ADC_Init(ADC_CHANNEL_1); // PA0 = ADC1_IN1 on this chip, for the T12 thermocouple only
    } else if (active_tool == TOOL_VACUUM_PICKUP || active_tool == TOOL_3D_PRINTER) {
        // The 3D printer's hotend NTC is wired to PB0/CONN_SEN (with R40's
        // 4.7k pull-up), not PA0/CONN_T12 - shares the vacuum pickup's ADC
        // channel since neither tool ever runs at the same time as the other.
        GPIO_AdcPin.Pin = TCRT_A0_ADC_PIN;
        HAL_GPIO_Init(GPIOB, &GPIO_AdcPin);
        MX_ADC_Init(ADC_CHANNEL_11); // PB0 = ADC1_IN11 on this chip, for vacuum pickup sensing and 3D hotend NTC
    } else {
        GPIO_AdcPin.Pin = T12_ADC_PIN;
        HAL_GPIO_Init(GPIOA, &GPIO_AdcPin);
        MX_ADC_Init(ADC_CHANNEL_1); // PA0 = ADC1_IN1 on this chip
    }

    // Drill/laser/layer-fan PWM is consolidated onto TIM1_CH1 (PA8), fully
    // independent of the step-tick timer. The layer fan
    // needs its documented exact 25kHz; drill/laser get the same independence -
    // there's no reason not to give them a proper PWM rate too.
    if (active_tool == TOOL_3D_PRINTER) {
        MX_TIM1_DrillLaserFan_Init(2559); // 64MHz/2560 = 25.000kHz exactly

        // Hotend fan: PA5 as TIM2_CH1/AF1 PWM output, PA6 as an EXTI6
        // falling-edge input for its tachometer. Both pins are only ever used
        // in 3D printer mode via CONN_FAN1 - genuinely free otherwise.
        GPIO_InitTypeDef GPIO_HotendFanPWM = {0};
        GPIO_HotendFanPWM.Pin = HOTEND_FAN_PWM_PIN;
        GPIO_HotendFanPWM.Mode = GPIO_MODE_AF_PP;
        GPIO_HotendFanPWM.Pull = GPIO_NOPULL;
        GPIO_HotendFanPWM.Speed = GPIO_SPEED_FREQ_HIGH;
        GPIO_HotendFanPWM.Alternate = GPIO_AF1_TIM2;
        HAL_GPIO_Init(HOTEND_FAN_PWM_PORT, &GPIO_HotendFanPWM);
        MX_TIM2_HotendFan_Init();

