JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
        // No dedicated external pull-up populated for FAN_FG in the current BOM
        // (R41/R42 are series protection, not pull-ups) - using the MCU's
        // internal pull-up for this open-collector FG line. Fine for a short
        // on-board/short-harness run; if the fan cable ends up long, consider
        // adding a proper external 4.7k-10k pull-up like DRILL_FGIN's R16.
        GPIO_InitTypeDef GPIO_HotendFanFG = {0};
        GPIO_HotendFanFG.Pin = HOTEND_FAN_FG_PIN;
        GPIO_HotendFanFG.Mode = GPIO_MODE_IT_FALLING;
        GPIO_HotendFanFG.Pull = GPIO_PULLUP;
        HAL_GPIO_Init(HOTEND_FAN_FG_PORT, &GPIO_HotendFanFG);
        // NVIC enable for EXTI9_5_IRQn already happens unconditionally in
        // MX_GPIO_Post_Init, alongside EXTI3_IRQn - no need to repeat it here.
    } else if (active_tool == TOOL_DRILL || active_tool == TOOL_LASER_ENGRAVER ||
               active_tool == TOOL_UV_CURING || active_tool == TOOL_HOTAIR_REWORK) {
        // UV Curing (doc #8) and Hot Air Rework's own blower (doc #10)
        // both share this same TIM1_CH1 channel at the drill/laser's
        // 20kHz rate - see the partitioned form's own note
        // (STM32F303CC_main.c) on why this condition had to be extended.
        MX_TIM1_DrillLaserFan_Init(3199); // 64MHz/3200 = 20kHz - was 1kHz when
                                            // this shared TIM3's step tick
    }

    // PB3 reconfiguration: only just configured as a push-pull STEP
    // output above, and only for the 6 stepper-based tools. Every other
    // tool - including TOOL_SCAN_PROBE and the vacuum/endstop group below -
    // reaches this point with PB3 exactly as it was left by
    // MX_GPIO_Init_Early(), i.e. untouched, so this is the only place
    // their mode ever gets set:
    if (active_tool == TOOL_SCAN_PROBE) {
        // Touch probe: EXTI3 falling edge. This is also what actually routes
        // EXTI3 to Port B - the unconditional DRILL_FGIN_PIN config elsewhere
        // wires EXTI3 to Port A (PA3) for the drill/3D-printer tachometer, and
        // only one port can feed EXTI line 3 at a time, so this must run for
        // every OTHER tool to claim it back for PB3.
        GPIO_InitTypeDef GPIO_Probe = {0};
        GPIO_Probe.Pin = TOUCH_IN_PIN;
        GPIO_Probe.Mode = GPIO_MODE_IT_FALLING;
        GPIO_Probe.Pull = GPIO_PULLUP;
        HAL_GPIO_Init(GPIOB, &GPIO_Probe);
    } else if (active_tool != TOOL_PASTE_DISPENSER && active_tool != TOOL_LIQUID_DISPENSER &&
               active_tool != TOOL_SCREWDRIVER && active_tool != TOOL_GRIPPER_GIMBAL &&
               active_tool != TOOL_GRIPPER_NEMA && active_tool != TOOL_3D_PRINTER &&
               active_tool != TOOL_SMT_PICKPLACE && active_tool != TOOL_VACUUM_GRIPPER_LG) {
        // Plain polled digital input: vacuum pickup's LM393 comparator, and the
        // new generic endstop/limit-switch input (Soldering iron, Drill, Laser,
        // AOI - NEW). Active low, so the internal pull-up gives a clean idle-high.
        GPIO_InitTypeDef GPIO_Endstop = {0};
        GPIO_Endstop.Pin = TOUCH_IN_PIN;
        GPIO_Endstop.Mode = GPIO_MODE_INPUT;
        GPIO_Endstop.Pull = GPIO_PULLUP;
        HAL_GPIO_Init(GPIOB, &GPIO_Endstop);
    }

    // Hardware independent watchdog (IWDG): this was entirely absent before.
    // Software watchdogs (Watchdog_Safety_Laser etc.) only work if the main
    // loop is still running at all - if the CPU genuinely hangs (I2C bus
    // lockup, a memory fault, an infinite loop), those never get a chance to
    // fire, and every PWM output stays latched at whatever it was last set
    // to: a heater, a 10W laser, a motor - powered until someone manually
    // cuts power. LSI-clocked (independent of the main clock tree, so it
    // still runs even if HSI/PLL fails), ~800ms timeout. Started here, before
    // OLED_Init, rather than after the splash - I2C is notoriously
    // ESD-sensitive, and starting the watchdog before OLED_Init's first
    // transactions means a bus lockup right there can't hang the
    // board forever with no recovery.
    hiwdg.Instance = IWDG;
    hiwdg.Init.Prescaler = IWDG_PRESCALER_32;
    hiwdg.Init.Reload = 999; // (999+1) * 32 / 40000 ~= 800ms @ ~40kHz LSI
    HAL_IWDG_Init(&hiwdg);

    // Graphics subsystem init via hardware I2C2 - initializes the I2C2
    // peripheral itself as part of its own setup, before its first
    // transactions.
    OLED_Init();
    // Parameter-persistence F-RAM shares I2C2 with the OLED above - see
    // the FRAM_I2C_ADDR comment for why. Loads (but doesn't act on)
    // whatever was saved before the last shutdown - see SavedState_Load's
    // own comment for the safety reasoning.
    SavedState_Load();
    // Expansion connector's bit-banged SPI bus - see the function's own
    // comment and PINOUT_CONNECTORS.TXT for why this isn't a hardware
    // SPI peripheral.
    MX_ExpansionSPI_Init();
    // Expansion connector's bit-banged I2C bus - see the function's own
    // comment for why this isn't a hardware I2C peripheral either.
    MX_ExpansionI2C_Init();
    Render_SplashScreen(0);
    // Big JuanenBOT/URTC splash, 5s total (CAN already active, no frames are
    // lost) - broken into small chunks with a refresh in between instead of
    // one HAL_Delay(5000), since that would trip the watchdog above on its own.
    // The face (pages 2-6, the white area) is redrawn every ~800ms to
    // animate without the overhead/flicker of redrawing the whole splash
    // each step - the yellow strip (URTC + version) never changes, so it's
    // never touched again after the first draw.
    for (uint8_t i = 0; i < 50; i++) {
        HAL_IWDG_Refresh(&hiwdg);
        if (i > 0 && i % 8 == 0) {
            uint8_t face_buf[128];
            uint8_t frame = (i / 8) % 4;
            for (uint8_t p = 0; p < 5; p++) {
                memcpy(face_buf, SplashFace[frame][p], 128);
                OLED_SetCursor(p + 2, 0);
                OLED_WriteData(face_buf, 128);
            }
        }
        // CAN is already live during this delay, so a laser/heater command
        // arriving right after boot would start actuating with none of the
        // safety watchdogs below running yet - they only get called from
        // the main loop, which hasn't started. Mirroring the
        // safety-critical subset here closes that window.
        Watchdog_Safety_Laser();
        Watchdog_Safety_Drill();
        Watchdog_Safety_LayerFan();
        Watchdog_Safety_SolderIron();
        Watchdog_Safety_HotendHeater();
        Control_SolderingIron_PID();
        Control_3D_Hotend_PID();
        HAL_Delay(100);
    }

    boot_sequence_active = 0; // splash is done - movement commands are now safe to act on
    for(uint8_t page=0; page<8; page++) OLED_ClearPage(page);

    while (1) {
        HAL_IWDG_Refresh(&hiwdg);

