JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
        // CAN bus-off recovery - can_bus_error_flag is set by
        // HAL_CAN_ErrorCallback and consumed here to actually restart the
        // peripheral, not just report the condition via the 0x110 status
        // response. A genuine bus-off condition (realistic in this
        // environment, given the EMI nearby motor drivers can put on the
        // bus) would otherwise leave this tool permanently disconnected
        // until a power cycle. Restarting is a low-risk, self-retrying
        // attempt - if the bus is still bad, the error callback just
        // fires again and this tries once more next loop iteration.
        if (can_bus_error_flag) {
            can_bus_error_flag = 0;
            HAL_CAN_Start(&hcan);
        }

        // Visual heartbeat and hardware alert-state indicator (PA15)
        if (HAL_GetTick() - tick_heartbeat >= (system_error_flag ? 100 : 500)) {
            tick_heartbeat = HAL_GetTick();
            HAL_GPIO_TogglePin(LED_DIAG_PORT, LED_DIAG_PIN);
        }

        // Cyclic safe thermal control loop (every 20ms)
        if (HAL_GetTick() - tick_pid >= 20) {
            tick_pid = HAL_GetTick();
            Control_SolderingIron_PID();
            Control_3D_Hotend_PID();
            Watchdog_Safety_Laser();
            Watchdog_Safety_Drill();
            Watchdog_Safety_LayerFan();
            Watchdog_Safety_HotendFan();
            Watchdog_Safety_SolderIron();
            Watchdog_Safety_HotendHeater();
            WeldPulse_Tick();
        }

        // Parameter-persistence check (every 500ms) - cheap when nothing's
        // changed (a memcmp), the actual F-RAM write is separately
        // rate-limited inside SavedState_MaybeSave itself.
        if (HAL_GetTick() - tick_fram_check >= 500) {
            tick_fram_check = HAL_GetTick();
            SavedState_MaybeSave();
        }

        // Asynchronous loop for secondary telemetry and UI refresh (every 150ms)
        if (HAL_GetTick() - tick_screen >= 150) {
            tick_screen = HAL_GetTick();
            Control_SensorTelemetry(); // vacuum pickup's own actual CAN send (0x145) happens separately, in the telemetry TX block below
            Control_EndstopTelemetry();
            Telemetry_Drill();            Telemetry_LayerFan();
            Telemetry_HotendFan();

            static uint8_t anim_counter = 0;
            if (++anim_counter >= 3) {        // ~450ms per frame: animation is visible but not frantic
                anim_counter = 0;
                animation_frame = (animation_frame + 1) % 4;
            }
            Render_ToolScreen();
            
            CAN_TxHeaderTypeDef txH;
            uint8_t txD[3];
            uint32_t mb;
            txH.RTR = CAN_RTR_DATA;
            txH.IDE = CAN_ID_STD;
            txH.TransmitGlobalTime = DISABLE;

            // Gated by active_tool - sends the temperature telemetry frame
            // only for the tool that actually owns current_temperature at
            // the moment (soldering iron or 3D printer hotend), rather than
            // on a flat timer regardless of which tool is active.
            if (active_tool == TOOL_SOLDERING_IRON) {
                txH.StdId = 0x135;
                txH.DLC = 3; // extended: byte 2 = endstop
                txD[0] = (uint8_t)((current_temperature >> 8) & 0xFF);
                txD[1] = (uint8_t)(current_temperature & 0xFF);
                txD[2] = endstop_triggered;
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            } else if (active_tool == TOOL_3D_PRINTER) {
                // bxCAN has exactly 3 TX mailboxes, and these 3 sends happen
                // faster than the bus can necessarily drain them - checking
                // GetTxMailboxesFreeLevel before each send (below) skips
                // cleanly when none is free, rather than calling blind and
                // silently dropping a failed send. Not worth a retry here;
                // this is periodic telemetry, not a one-shot command.
                txH.StdId = 0x175;
                txH.DLC = 2;
                txD[0] = (uint8_t)((current_temperature >> 8) & 0xFF);
                txD[1] = (uint8_t)(current_temperature & 0xFF);
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }

                // Layer fan RPM telemetry (0x177)
                txH.StdId = 0x177;
                txH.DLC = 2;
                txD[0] = (uint8_t)((layer_fan_actual_rpm >> 8) & 0xFF);
                txD[1] = (uint8_t)(layer_fan_actual_rpm & 0xFF);
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }

                // Hotend fan RPM telemetry (0x179)
                txH.StdId = 0x179;
                txH.DLC = 2;
                txD[0] = (uint8_t)((hotend_fan_actual_rpm >> 8) & 0xFF);
                txD[1] = (uint8_t)(hotend_fan_actual_rpm & 0xFF);
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            }
            // 0x145: vacuum pickup analog/digital sensor telemetry, per CANBUS.TXT
            else if (active_tool == TOOL_VACUUM_PICKUP) {
                txH.StdId = 0x145;
                txH.DLC = 3;
                txD[0] = (uint8_t)((sensor_analog_reading >> 8) & 0xFF);
                txD[1] = (uint8_t)(sensor_analog_reading & 0xFF);
                txD[2] = sensor_digital_reading;
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            }
            // 0x147: drill RPM + endstop telemetry
            else if (active_tool == TOOL_DRILL) {
                txH.StdId = 0x147;
                txH.DLC = 3; // extended: byte 2 = endstop
                __disable_irq();
                uint16_t drill_rpm_snapshot = drill_actual_rpm; // atomic snapshot, defensive against a mid-read IRQ update
                __enable_irq();
                txD[0] = (uint8_t)((drill_rpm_snapshot >> 8) & 0xFF);
                txD[1] = (uint8_t)(drill_rpm_snapshot & 0xFF);
                txD[2] = endstop_triggered;
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            }
            // The laser and AOI endstop telemetry frames are minimal 1-byte
            // IDs, placed next to each tool's own command ID (0x160/0x150)
            // the same way 0x140->0x147 and 0x130->0x135 are already paired.
            else if (active_tool == TOOL_LASER_ENGRAVER) {
                txH.StdId = 0x165;
                txH.DLC = 1;
                txD[0] = endstop_triggered;
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            }
            else if (active_tool == TOOL_AOI_INSPECTION) {
                txH.StdId = 0x155;
                txH.DLC = 1;
                txD[0] = endstop_triggered;
                if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) > 0) {
                    HAL_CAN_AddTxMessage(&hcan, &txH, txD, &mb);
                }
            }
        }

        // Background processing of flags raised from CAN bus interrupts,
        // checked every loop iteration (not tied to the 150ms tick above)
        // for near-immediate response, with the AOI strobe as its own
        // independent check rather than nested inside the ring-flag one.
        if (oled_mode_pending_flag) {
            Process_OLED_NightModeChange();
        }

        Update_StatusLED_AutoColor();
        if (update_led_ring_flag) {
            // Only clears the flag once the status LED update actually
            // goes out over SPI/DMA - clearing it unconditionally first
            // would silently drop a color update that arrived mid-transfer,
            // with nothing left to retry it. The ring (bit-banged, always
            // synchronous) still always runs regardless.
            if (Update_StatusLED_SPI_DMA()) {
                update_led_ring_flag = 0;
            }
            Update_RingLEDs_BitBang();
        }

        // AOI stroboscopic sync pulse: flashes the CONN_LED2 ring at the
        // color last set via 0x100, for aoi_strobe_period milliseconds.
        if (active_tool == TOOL_AOI_INSPECTION && trigger_aoi_strobe_flag) {
            trigger_aoi_strobe_flag = 0;
            // Clamp: aoi_strobe_period comes straight from a CAN command
            // with no prior validation. A strobe/flash sync pulse should
            // be brief (single-digit to low-double-digit ms); without a
            // cap, a misconfigured or garbled command could keep the LEDs
            // on far longer than intended.
            uint16_t raw_period = aoi_strobe_period; // single atomic read
            uint16_t safe_period = (raw_period > 500) ? 500 : (raw_period < 1) ? 1 : raw_period;
            for (int i = 0; i < 8; i++) {
                ring_pixels[i].R = ring_color_r;
                ring_pixels[i].G = ring_color_g;
                ring_pixels[i].B = ring_color_b;
            }
            Update_RingLEDs_BitBang();
            // Records when to turn the LEDs back off instead of blocking
            // here with HAL_Delay(safe_period) - the rest of this loop
            // (PID, watchdogs, telemetry, OLED) keeps running normally
            // during the pulse instead of freezing for up to 500ms.
            aoi_strobe_off_tick = HAL_GetTick() + safe_period;
            aoi_strobe_active = 1;
        }
        if (aoi_strobe_active && (int32_t)(HAL_GetTick() - aoi_strobe_off_tick) >= 0) {
            aoi_strobe_active = 0;
            for (int i = 0; i < 8; i++) {
                ring_pixels[i].R = 0;
                ring_pixels[i].G = 0;
                ring_pixels[i].B = 0;
            }
            Update_RingLEDs_BitBang();
        }
    }
}

