JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// =============================================================================
// 14. PARAMETER PERSISTENCE (FM24CL64B F-RAM, SHARED I2C2)
// =============================================================================
// Saves a snapshot of the active tool's setpoints and the global LED/OLED
// settings periodically, so a sudden power loss doesn't leave the state
// "before" a shutdown as unknowable as the shutdown itself was unplanned.
// Deliberately does NOT auto-apply a recovered setpoint to anything that
// could re-energize on its own after boot (a heater, the laser, a spinning
// motor) - see SavedState_Load()'s own comment for the full reasoning.
// This is a diagnostic/recovery aid, not a "resume exactly where it left
// off" feature.

// Low-level chunked write. addr/len are trusted to be within
// FRAM_SIZE_BYTES - this is an internal helper, not exposed over CAN,
// so the only caller is this same file. Returns 1 on success, 0 on any
// HAL error (I2C bus fault, chip not present/not acking, etc.) - every
// caller treats a failure as "couldn't save this time, try again later"
// rather than anything fatal, since nothing about this board's core
// operation depends on this chip being present or working.
uint8_t FRAM_WriteBytes(uint16_t addr, const uint8_t *data, uint16_t len) {
    while (len > 0) {
        uint16_t space_in_chunk = FRAM_WRITE_CHUNK - (addr % FRAM_WRITE_CHUNK);
        uint16_t chunk = (len < space_in_chunk) ? len : space_in_chunk;
        // HAL_I2C_Mem_Write handles the 2-byte (16-bit) internal memory
        // address this chip's 8KB capacity needs (MEMADD_SIZE_16BIT) -
        // confirmed against the FM24CL64B's own documented control-byte
        // + address-byte protocol, the same scheme a serial EEPROM of the
        // same capacity would use (this chip is a drop-in replacement by
        // design). No delay follows the write below: F-RAM writes
        // complete at bus speed with no internal write cycle to wait for
        // ("NoDelay" writes, per the datasheet - unlike a real EEPROM,
        // there's nothing here to poll or wait out).
        if (HAL_I2C_Mem_Write(&hi2c2, FRAM_I2C_ADDR, addr, I2C_MEMADD_SIZE_16BIT,
                               (uint8_t *)data, chunk, 50) != HAL_OK) {
            return 0;
        }
        addr += chunk;
        data += chunk;
        len -= chunk;
    }
    return 1;
}

// Low-level read - one single transaction regardless of len, same as a
// write would be if FRAM_WRITE_CHUNK's conservative chunking weren't
// applied to it (reads never needed that chunking to begin with, on
// this chip or a real EEPROM either).
uint8_t FRAM_ReadBytes(uint16_t addr, uint8_t *data, uint16_t len) {
    return HAL_I2C_Mem_Read(&hi2c2, FRAM_I2C_ADDR, addr, I2C_MEMADD_SIZE_16BIT,
                             data, len, 50) == HAL_OK;
}

static uint8_t SavedState_Checksum(const SavedState_t *s) {
    // CRC-8 (polynomial 0x07, the standard CRC-8/SMBUS variant) over
    // every byte except the checksum field itself. Upgraded from a plain
    // additive checksum - that detected "blank/grossly corrupted" F-RAM
    // fine, but two bytes corrupted in a way that happens to cancel out
    // (one +1, one -1) would pass it undetected. Still not a security
    // boundary the way the OTA update's HMAC-SHA256 is (this data is
    // passive display settings, not anything safety-relevant - see
    // SavedState_Load's own comment on what it does and doesn't act on),
    // just a meaningfully stronger version of the same "was this
    // corrupted" check. Bit-by-bit rather than a 256-entry lookup table:
    // this runs only at F-RAM save/load, never in a timing-critical
    // path, so the table's flash cost isn't worth it for 27 bytes.
    const uint8_t *bytes = (const uint8_t *)s;
    uint8_t crc = 0x00;
    for (size_t i = 0; i < sizeof(SavedState_t) - 1; i++) {
        crc ^= bytes[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            crc = (crc & 0x80) ? (uint8_t)((crc << 1) ^ 0x07) : (uint8_t)(crc << 1);
        }
    }
    return crc;
}

// Called once, early in main()'s boot sequence, after active_tool is known
// but before anything reads recovered_state. Populates recovered_state and
// had_valid_recovered_state - it does NOT apply any of it to a live
// setpoint. Recovering a heater/laser/motor setpoint and quietly
// re-arming it the moment the board boots would mean a power blip (or a
// deliberate power cycle for entirely unrelated reasons) could resume a
// potentially hazardous operation with nobody watching, which defeats the
// point of every communication watchdog elsewhere in this firmware. What
// this DOES provide: recovered_state is readable over CAN (0x190/0x191 -
// see CANBUS.TXT) so a master/diagnostic tool can learn what the board was
// doing before the outage and make an informed decision - including
// deliberately re-sending the same setpoint if that's actually wanted.
// The safe, passive settings (LED colors, OLED mode) ARE applied directly
// here, since there's no hazard in restoring what color an LED was.
void SavedState_Load(void) {
    SavedState_t s;
    had_valid_recovered_state = 0;
    if (!FRAM_ReadBytes(SAVEDSTATE_FRAM_ADDR, (uint8_t *)&s, sizeof(s))) {
        return; // F-RAM not present or not responding - board still boots fine without it
    }
    if (s.magic != SAVEDSTATE_MAGIC || s.struct_version != SAVEDSTATE_VERSION) {
        return; // blank chip, or a layout from a different firmware version - don't trust it
    }
    if (SavedState_Checksum(&s) != s.checksum) {
        return; // corrupted - a partial/interrupted write, most likely
    }
    recovered_state = s;
    had_valid_recovered_state = 1;
    last_saved_state = s; // so the very first change-check in SavedState_MaybeSave() compares against what's genuinely on the chip

    // Passive, hazard-free settings only - restored directly.
    led_state_pixel.R = s.status_r;
    led_state_pixel.G = s.status_g;
    led_state_pixel.B = s.status_b;
    for (int i = 0; i < 8; i++) {
        ring_pixels[i].R = s.ring_r;
        ring_pixels[i].G = s.ring_g;
        ring_pixels[i].B = s.ring_b;
    }
    oled_night_mode = s.oled_night_mode;
    expansion_board_type = s.expansion_board_type; // passive config, not an actuator setpoint - safe to restore directly like the settings above
    free_tool_selection = s.free_tool_selection;    // same reasoning - passive config, not an actuator setpoint
    device_serial_number = s.device_serial_number;  // same reasoning - passive config, not an actuator setpoint
}

