JuanenRac/URTC/src/F303-master/V1.1/STM32F303CC.C
// Called every main-loop iteration. Cheap when nothing's changed (just a
// memcmp and a tick check) - the actual write only happens when something
// is both different AND at least FRAM_MIN_SAVE_INTERVAL_MS has passed
// since the last one. Unlike a real EEPROM, this isn't protecting a
// limited write-cycle budget - the FM24CL64B's endurance is rated in the
// trillions of cycles, effectively unlimited for anything this board
// would ever do. The interval is kept anyway for a different, more mundane
// reason: if a setpoint were ever adjusted rapidly (a UI slider being
// dragged, say), there's no reason to write every single intermediate
// value to the bus instead of just the one it settles on.
#define FRAM_MIN_SAVE_INTERVAL_MS 3000
void SavedState_MaybeSave(void) {
    SavedState_t s = {0};
    // Snapshotting every field with interrupts disabled - each individual
    // read below is already atomic on its own (single-byte/word volatile
    // reads), but without this a CAN message arriving mid-copy could
    // still leave a logically inconsistent mix of old/new values spread
    // across different fields (e.g. a new laser_power_setpoint but the
    // interlock pin state from before that same command). Brief enough
    // not to risk any timing-sensitive interrupt (SysTick, CAN RX) - this
    // is a few dozen register/memory reads, not a loop or a blocking call.
    __disable_irq();
    s.magic = SAVEDSTATE_MAGIC;
    s.struct_version = SAVEDSTATE_VERSION;
    s.active_tool_at_save = (uint8_t)active_tool;
    s.solder_setpoint = (active_tool == TOOL_SOLDERING_IRON) ? target_temperature : 0;
    s.printer_nozzle_setpoint = (active_tool == TOOL_3D_PRINTER) ? target_temperature : 0;
    s.drill_speed = (active_tool == TOOL_DRILL) ? drill_speed : 0;
    // Direction and interlock have no dedicated RAM variable - the CAN
    // handlers write these straight to their GPIO pin, so the pin's own
    // current output state (readable even though it's configured as an
    // output - HAL_GPIO_ReadPin reflects what's actually being driven,
    // not just an external voltage) is the only source of truth for
    // "what was it last commanded to" without adding a new variable and
    // touching those existing handlers.
    s.drill_direction = (active_tool == TOOL_DRILL)
        ? (HAL_GPIO_ReadPin(DRILL_FRIN_PORT, DRILL_FRIN_PIN) == GPIO_PIN_SET) : 0;
    s.laser_power = (active_tool == TOOL_LASER_ENGRAVER) ? laser_power_setpoint : 0;
    s.laser_interlock = (active_tool == TOOL_LASER_ENGRAVER)
        ? (HAL_GPIO_ReadPin(TMC_ENN_PORT, LASER_SAFETY_PIN) == GPIO_PIN_SET) : 0;
    s.layer_fan_power = (active_tool == TOOL_3D_PRINTER) ? layer_fan_duty : 0;
    s.hotend_fan_power = (active_tool == TOOL_3D_PRINTER) ? hotend_fan_duty : 0;
    s.status_r = led_state_pixel.R; s.status_g = led_state_pixel.G; s.status_b = led_state_pixel.B;
    s.ring_r = ring_pixels[0].R; s.ring_g = ring_pixels[0].G; s.ring_b = ring_pixels[0].B;
    s.ring_on = (ring_pixels[0].R || ring_pixels[0].G || ring_pixels[0].B) ? 1 : 0;
    s.oled_night_mode = oled_night_mode;
    s.had_critical_error = system_error_flag;
    s.expansion_board_type = expansion_board_type;
    s.free_tool_selection = free_tool_selection;
    s.device_serial_number = device_serial_number;
    __enable_irq();
    s.checksum = SavedState_Checksum(&s);

    if (memcmp(&s, &last_saved_state, sizeof(s) - 1) == 0) {
        return; // nothing meaningful changed since the last save
    }
    uint32_t now = HAL_GetTick();
    if ((uint32_t)(now - last_fram_write_tick) < FRAM_MIN_SAVE_INTERVAL_MS) {
        return; // changed, but rate-limited - will be picked up on a later call once the interval passes
    }
    if (FRAM_WriteBytes(SAVEDSTATE_FRAM_ADDR, (const uint8_t *)&s, sizeof(s))) {
        last_saved_state = s;
        last_fram_write_tick = now;
    }
    // On failure (EEPROM missing/unresponsive), last_saved_state is
    // deliberately left unchanged, so the next call's memcmp still sees a
    // difference and retries - rather than silently giving up after one
    // failed attempt.
}
